[
    {
        "topic": "best features of the samsung phones?",
        "reddit_posts": [
            {
                "title": "Me watching Samsung slowly becoming Apple.",
                "url": "https://www.reddit.com/r/samsung/comments/1kcy0h7/me_watching_samsung_slowly_becoming_apple/",
                "score": 1112,
                "comments_count": 315,
                "author": "RASHMIKA7",
                "created_utc": 1746183263.0,
                "selftext": "All things I liked about Samsung are slowly disappearing. I used to joke about iPhone users, and now, (using an S24), I feel the same way about myself. I miss the S5; that phone had features Samsung itself never heard of. It wasn't a good phone—the battery died like in a minute—but it felt like they tried their best. Now Samsung is basically Apple, but Android.",
                "comments": [
                    {
                        "author": "Numerous_Ticket_7628",
                        "comment": "Have you seen the new Pixel UI? It seems Google are also trying to morph into Apple along with most other Chinese phone manufacturers. The fact is the market will try and copy the most popular device.",
                        "published_at": 1746183682.0,
                        "likes": 305,
                        "subcomments": [
                            {
                                "author": "malmal2887",
                                "comment": "I have had three different pixel phones, the three, five, and currently the seven. And I will never get over the fact that the camera on the three was the best of all of them. How does the camera get worse at this point in the technology game???",
                                "published_at": 1746187395.0,
                                "likes": 80
                            },
                            {
                                "author": "Old_Yam6223",
                                "comment": "Chinese manufactures are mainly trying to make their UI like iOS, apart from this… nothing else to Applelise themselves…they are putting new tech battery Si-Carbon, charging 6000 mah in 40 mins, wireless 50 W charging, even Samsung is still 45 iirc in wired, and Apple is prolly the worst at 26W approx which is the prolly the worst in the industry among flagships. Camera sensors are almost 1 inch in Chinese phones, high PWM flicker vs 492 in Samsung and 480 in iPhones iirc, removing bluetooth functionality from S pen on the name of upgrade, delaying updates on S24 Ultra last year to boost s25 sales. I’m an iPhone user for years but I hate how bad Apple and Samsung is going in some directions.",
                                "published_at": 1746197282.0,
                                "likes": 37
                            },
                            {
                                "author": "Raztax",
                                "comment": "> The fact is the market will try and copy the most popular device.\n\nExcept iPhone is only the most popular in USA. In the rest of the world Android is miles ahead in popularity.",
                                "published_at": 1746202486.0,
                                "likes": 35
                            },
                            {
                                "author": "allergictosomenuts",
                                "comment": "Rather Apple has been morphing into android functionally and Android has been morphing into Apple visually and now they're meeting half way.",
                                "published_at": 1746224661.0,
                                "likes": 10
                            },
                            {
                                "author": "AdPrevious4844",
                                "comment": "It is absolutely disgusting to see both Samsung and Google let go of their signature device designs and follow what Apple is doing. The Pixel 9 and S24 series started this trend and its only going to get worse.",
                                "published_at": 1746244129.0,
                                "likes": 10
                            }
                        ]
                    },
                    {
                        "author": "sgtm7",
                        "comment": "Slowly?  They took away removable batteries, SD cards, and headphone jacks, quite awhile ago.  Has been a while since they stopped supplying chargers with new phones, also.  The only thing left, is the customize option.   It isn't just Samsung though.  All the major brands did the same crap.",
                        "published_at": 1746186323.0,
                        "likes": 127,
                        "subcomments": [
                            {
                                "author": "runski1426",
                                "comment": "Not all. Just Apple, Samsung, and Google. If you simply avoid these brands, you will get an awesome device in the flagship category.\n\nSD card and headphone jack? Sony.\nBest cameras? Vivo, Oppo, Xaomi.",
                                "published_at": 1746215513.0,
                                "likes": 27
                            },
                            {
                                "author": "MisterFlipster5",
                                "comment": "yeah, and don't forget that they made fun of apple via ads and then proceeded to copy (for example, the notch ad or the ad they made fun of apple for not shipping power bricks)",
                                "published_at": 1746223438.0,
                                "likes": 7
                            },
                            {
                                "author": "AdPrevious4844",
                                "comment": "I can forgive the removable battery and even the 3.5mm jack, but taking away the SD slot? That's just a middle finger to their most loyal customers and a general blow to any power user.",
                                "published_at": 1746244260.0,
                                "likes": 6
                            },
                            {
                                "author": "ImaginaryDamage8418",
                                "comment": "They have removed many features from ui too",
                                "published_at": 1746334925.0,
                                "likes": 1
                            },
                            {
                                "author": "FancySociety99",
                                "comment": "I miss the headphone jack and sd card slot. I heard Sony phones still have them, but I'm not too sure about the battery life of those phones.",
                                "published_at": 1746353408.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "Major_Enthusiasm1099",
                        "comment": "Samsung is the Apple of Android and they have been for awhile now",
                        "published_at": 1746184439.0,
                        "likes": 123,
                        "subcomments": [
                            {
                                "author": "runski1426",
                                "comment": "So is Google tbf.",
                                "published_at": 1746215527.0,
                                "likes": 13
                            },
                            {
                                "author": "showkali6426",
                                "comment": "I would rather argue, Google is the Apple of Android.",
                                "published_at": 1746326767.0,
                                "likes": 1
                            },
                            {
                                "author": "Imaginary-Worker4407",
                                "comment": "I wish, at least apple releases their updates as promised.",
                                "published_at": 1746335759.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "aesn1394",
                        "comment": "What bothers me, is that if they do want to become apple, at least design hardware, software and experiences that actually work seemlessly with one another. Android to Android its almost perfect. But the galaxybook side is woefully managed by samsung. They charge apple level prices, but deliever such mediocre laptops in specs and design. On the software side, I get that Microsoft is part to blame becuase windows 11 is also poorly manged, but again, dont charge us apple level prices. Also their laptop designs are stuck in like late 2010s, again dont charge me the same as macbook for that (downwards facing muffled speakers in an Ultra 16 inch laptop is just criminal for example).",
                        "published_at": 1746183776.0,
                        "likes": 88,
                        "subcomments": []
                    },
                    {
                        "author": "emperorlobsterII",
                        "comment": "Tbh, it's a general trend. Features are being held back, because the companies know that their product is (almost) perfected, so they wouldn't have a selling argument.",
                        "published_at": 1746183727.0,
                        "likes": 38,
                        "subcomments": []
                    },
                    {
                        "author": "Liammistry",
                        "comment": "S8 was peak for me… more features than I could use, even as a tech enthusiast",
                        "published_at": 1746186045.0,
                        "likes": 27,
                        "subcomments": [
                            {
                                "author": "SufferDieoxide",
                                "comment": "I still have my S8 and use it daily along-side my S21 and S24 🫡",
                                "published_at": 1746197276.0,
                                "likes": 6
                            },
                            {
                                "author": "Extreme_Ad1238",
                                "comment": "the s8 was literally the best. had a plus, absolutely loved the size of it. getting an s24 cause my s8 died really broke my heart. they downgraded so bad, its ridiculous.",
                                "published_at": 1746549535.0,
                                "likes": 2
                            },
                            {
                                "author": "Altruistic_Leopard_9",
                                "comment": "That was such a great phone until it broke (my fault). Phones were so much slimmer and lighter back then. Absolutely peak Samsung in my mind. They were very adventurous with official phone cases back then too.",
                                "published_at": 1746234212.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "horizon936",
                        "comment": "Apple always had better designs in both hardware and software. It's only natural for Android to move in that direction, as it's objectively better. If you preferred the old clunky and less polished look, then you're in the minority.\n\nAndroid is still a lot more open, especially OneUI, giving you a lot of options that iOS simply won't. iOS is also slowly improving and assimilating some year-long Android functionalities too, so they're definitely \"copying\" too. The two OS's are slowly converging and that's completely natural, seeing how neither company has anything left to innovate with, apart from AI, on these platforms.\n\nSame for Windows and MacOS. MacOS is becoming less and less clunky, copying features from Windows, and Windows is slowly assimilating the objectively better and more coherent MacOS UI language, as well as features that make MacOS more \"open\". I still prefer Android and MacOS in general, but I think everything is so similar at this point that pretty much anyone will be fine with using any OS after a while.",
                        "published_at": 1746184646.0,
                        "likes": 21,
                        "subcomments": [
                            {
                                "author": "premier024",
                                "comment": "Your high af if you think apple hardware is the peak",
                                "published_at": 1746812694.0,
                                "likes": 0
                            },
                            {
                                "author": "RASHMIKA7",
                                "comment": "I'm not only talking about the UI; I'm talking about what they offer and what they can do.  For the UI, yes, to me, One UI is much better, and I use an S24 myself; I got it the day it launched, so I know the UI, but that's not my point.",
                                "published_at": 1746185287.0,
                                "likes": -2
                            }
                        ]
                    },
                    {
                        "author": "Onanation",
                        "comment": "I've gone from loving Samsung phones to hating them. I think Kodak is a better comparison. Just not listening to what customers want. I love dual audio and the way it used to work on my s9. The changes they have made has made it completely unusable to me . Consequently I haven't purchased a new Samsung phone for almost a decade",
                        "published_at": 1746185014.0,
                        "likes": 18,
                        "subcomments": [
                            {
                                "author": "PinkPaladin6_6",
                                "comment": "\"Consequently I haven't purchased a new Samsung phone for almost a decade\"\n\nWhy are you even discussing on a Samsung subreddit than lol?",
                                "published_at": 1746241994.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "Zemerax",
                        "comment": "I mean Apples starting to become like Android as well. Last 3 iOS updates have been working on closing the customization gap. And rumor is this fall is a major rework of iOS, i wouldnt be surprised if they mirrored more QoL things.",
                        "published_at": 1746184216.0,
                        "likes": 17,
                        "subcomments": [
                            {
                                "author": "PinkPaladin6_6",
                                "comment": "Naw bro just keep spinning the reddit narrative that Samsung solely copies off Apple, as if Apple hasn't been doing the same for like the past couple years",
                                "published_at": 1746242242.0,
                                "likes": 10
                            }
                        ]
                    },
                    {
                        "author": "musicmaniac32",
                        "comment": "I've been thinking about this since they removed the charger right after criticizing apple for doing that. It's only gotten worse since.\n\nRemoved SD card storage\nCreated a fold with no internal S pen storage \nRemoved everything that made the S pen unique \n\nNext will be removing the S pen altogether. \n\nSamsung should realize that people chose it for the things it had that apple doesn't, not just because it's not apple. If Samsung devices no longer have the features I'm looking for, I'll just look at other brands. Apple gets away with being subpar because its followers are a cult. Samsung does not have the same following, at least not in the US.",
                        "published_at": 1746186939.0,
                        "likes": 16,
                        "subcomments": [
                            {
                                "author": "AMI_5664",
                                "comment": ">Next will be removing the S pen altogether. \n\nThis is literally the main thing that made Samsung's Note and eventually S series unique and different. Removing S pen would be one of the dumbest decisions in tech history.",
                                "published_at": 1746267849.0,
                                "likes": 4
                            }
                        ]
                    }
                ],
                "shares": 0
            },
            {
                "title": "Samsung is deliberately locking some of the Watch features",
                "url": "https://www.reddit.com/r/GalaxyWatch/comments/1h2ohoz/samsung_is_deliberately_locking_some_of_the_watch/",
                "score": 74,
                "comments_count": 53,
                "author": "Hammond_Robotics_",
                "created_utc": 1732894856.0,
                "selftext": "I have a Galaxy Watch6 paired to a Galaxy S23 Ultra.\nThose are both very premium devices, that were the best Samsung products of their lineups last year.\n\nWith the latest One UI 6 Watch update, I was happy to get the energy score feature, but also the following feature : \"Smarter replies with AI\nRespond to messages quickly with AI-generated replies tailored to the message you received. Suggested replies will appear when you view a message notification. Replies are generated on your phone so your messages remain private. Works with phones running One UI 6.1.1 or higher that support AI Suggested replies.\"\n\nHowever, I just learned that this feature is only supported starting on the S24 Series and ZFold/Flip 6.\nListen, there is absolutely no reasons why the S23 Ultra, a perfectly capable phone, with all the other AI features, wouldn't get this one.\nIt's because Samsung doesn't want us, poor S23 users to have it. And because of that, they're expecting me to pay full price for a new device, even tho I paid a lot last year for my perfectly capable S23 Ultra? That's absolutely insane.\nThey should stop doing this, because these kinds of practices are really disgusting. ",
                "comments": [
                    {
                        "author": "Centralredditfan",
                        "comment": "Go get a new phone you peasant. \n\n\n/s",
                        "published_at": 1732895298.0,
                        "likes": 68,
                        "subcomments": []
                    },
                    {
                        "author": "Enjinr",
                        "comment": "It works with any phone that has received 6.1.1. My S22 Ultra works and a S23U will as well. I don't even use the feature but it's there. Why in the world would someone even consider buying a new phone for this feature? That's insane. But you have the feature anyway, so calm down.",
                        "published_at": 1732895545.0,
                        "likes": 29,
                        "subcomments": [
                            {
                                "author": "Hammond_Robotics_",
                                "comment": "Downgrade you have the \"sparklies\" when you receive a new message and scroll down? If not, they are just standard suggested responses, not the new AI ones.",
                                "published_at": 1732895732.0,
                                "likes": -32
                            }
                        ]
                    },
                    {
                        "author": "vGraphsAlt",
                        "comment": "just dont use ai replies im pretty sure theyre not that good anyways",
                        "published_at": 1732895071.0,
                        "likes": 24,
                        "subcomments": [
                            {
                                "author": "Hammond_Robotics_",
                                "comment": "I knew someone was going to answer that. The problem is that they're locking away some features that should absolutely be available on my device. It's not horrible that I don't have it, but rather disappointing coming from Samsung.",
                                "published_at": 1732895304.0,
                                "likes": 12
                            },
                            {
                                "author": "niiima",
                                "comment": "You totally missed OP's points here. A lot of other useful features like specific Modes and Routines are being locked behind One UI 6.1.1.",
                                "published_at": 1732900639.0,
                                "likes": 1
                            },
                            {
                                "author": "-Pork_Skins",
                                "comment": "It's true. Theyre not. 😂",
                                "published_at": 1732918638.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "Any_Onion_7275",
                        "comment": "I mean my note 20 ultra works amazing still and I still have 60% battery at the end of the day even with charging to 100% and while over night till I wake up. And they won't allow me to get the update for my phone so I can't get the new features for routines and modes which is BS. I'm not buying a new phone just for these features when mine works perfectly fine. Should be a law against this as this creates electronic waste..",
                        "published_at": 1732902682.0,
                        "likes": 20,
                        "subcomments": [
                            {
                                "author": "jmpz11",
                                "comment": "I switched from the Stagnant Z Fold to the OnePlus Open... I can't wait to dump this POS watch as well. I used to be able to view most of the data on the watch -- it didn't depend on the phone. More and more things go missing -- you have to use the phone. Well.. Why TF should I wear the watch if I need the phone to use most of the features?\n\nGood question.",
                                "published_at": 1739419953.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "niiima",
                        "comment": "Wow these comments are definitely from Samsung shareholders!\n\nYou are absolutely correct and have the right to expect all the features to be available for you when you paid the full price for these devices. I too own an GW6 and am enraged that the new Watch Modes and Routines (like turning on/off AOD) are only available for devices running One UI 6.1.1.",
                        "published_at": 1732900538.0,
                        "likes": 6,
                        "subcomments": [
                            {
                                "author": "Hammond_Robotics_",
                                "comment": "Exactly. Why are they gatekeeping features like this? Really disgusting.",
                                "published_at": 1732918853.0,
                                "likes": 5
                            }
                        ]
                    },
                    {
                        "author": "No_Ad_5517",
                        "comment": "I will play devil's advocate here, although I am not sure if this is the case.\nThe processor of the Galaxy S23 cannot use AI on the phone without an internet connection, but the S24 processor can. So, perhaps regulations or Samsung's preferences dictate that this feature should function within the phone and not on the internet due to privacy concerns.\nMany minor AI features are excluded from \"older\" phones due to compatibility issues, and this could be the case here. I do not agree with every Samsung policy, but I do not believe they are acting greedily in this instance.",
                        "published_at": 1732929200.0,
                        "likes": 4,
                        "subcomments": []
                    },
                    {
                        "author": "bcycle240",
                        "comment": "This feature is nearly impossible to use, there are too many conditions that must be met. I have the correct phone and watch, but what apps are supported? Probably Samsung messages or something that nobody uses. And the phone must be connected to the watch to generate replies. Ridiculous. If I want to use my watch to reply it's because I don't have the phone with me. I'm very curious about it, it's turned on, but I've never seen it work.",
                        "published_at": 1732898246.0,
                        "likes": 4,
                        "subcomments": [
                            {
                                "author": "TerrorVizyn",
                                "comment": "Everyone I know that has a Samsung phone uses Samsung Messages for texting, including myself.",
                                "published_at": 1732916720.0,
                                "likes": -5
                            }
                        ]
                    },
                    {
                        "author": "Forsigh",
                        "comment": "I have S24 U Paired with W7 U and i don't have Ai responses. If You are in Europe anything Ai related is delayed here by a year or so.",
                        "published_at": 1732907005.0,
                        "likes": 3,
                        "subcomments": []
                    },
                    {
                        "author": "Gromchy",
                        "comment": "Yes that happens all the time. They just want you to buy a new phone every year.",
                        "published_at": 1732930025.0,
                        "likes": 2,
                        "subcomments": []
                    },
                    {
                        "author": "AbdoJoestar",
                        "comment": "First the differences between the flagships and the As by removing basic features like the camera controls, and now there is differentiation between two S generations with AI features lol what next Samsung?",
                        "published_at": 1732905167.0,
                        "likes": 1,
                        "subcomments": []
                    }
                ],
                "shares": 0
            },
            {
                "title": "Going back to Android from iphone 13 Pro",
                "url": "https://www.reddit.com/gallery/1ac8uz8",
                "score": 2027,
                "comments_count": 663,
                "author": "oddabhi",
                "created_utc": 1706354917.0,
                "selftext": " \nIt was about 2 years ago when after being an android fan for 11 years I finally [switched to iphone 13 pro](https://www.reddit.com/r/iphone/s/qLoJv2tp7I) from OnePlus 8 Pro. \n\nI loved the stainless steel and flat screen and back looks. The 120Hz screen on iphone 13 pro finally helped me take the step. The ditched Samsung s23 Ultra because of curved screen and heating issues at the time. \n\nNow finally after using iphone 13 pro for more than 2 years. I have decided to go back to Android. I was waiting for iPhone 15 launch. But there was nothing major addition in 15 series. \n\nIt was a good run with iphone 13 Pro. I had faced a lot of issues and limitations with the iOS system. But it wasn't as bad as I was expecting. \n\nThe best part of the iPhone 13 pro was the camera.  It was awesome for pics and videos both. \n\nBut I had missed the boat load of system tweaking features of Android. \n\nThe removal of rounded edges and screen, bigger vapour chamber for cooling and the stiched in AI in the phone, the *Samsung s24 Ultra* checked all the boxes for me. Loving the unlimited customisation, amazing camera, s pen, gorgeous 2600 nits display among other things in s24 Ultra. \n\nTill next time, Apple.",
                "comments": [
                    {
                        "author": "antmcl",
                        "comment": "Lol at the downvotes on your post. I used most Samsung flagship Android phones for years until switching to the 13P and it was great. \n\nWhile I would not switch back at this point, the S24 looks really cool for brute force power and features - enjoy!",
                        "published_at": 1706355903.0,
                        "likes": 88,
                        "subcomments": [
                            {
                                "author": "oddabhi",
                                "comment": "At least 1 person in this community showing good sportsmanship :D\n\nThanks.  \n\n\nEdit: My bad, most of the people have taken this post very well and have had good discussions.",
                                "published_at": 1706357394.0,
                                "likes": 34
                            },
                            {
                                "author": "Slu54",
                                "comment": "I've used only Samsung (I think I had a few iPhones for work for a while?), but yes Samsung camera always seems to suck compared to iPhone.\n\nI bought S21U thinking it's got 9000 cameras one of them has to be good right? Nope, if light is even a bit low sharpness drops off a cliff.",
                                "published_at": 1706368894.0,
                                "likes": 1
                            },
                            {
                                "author": "Unknown",
                                "comment": "Yes the  \"my team is better; you must be dumb if you use that \" is tiresome. Use what you like. The best device of any category is the one that lines up best with your use case.",
                                "published_at": 1706383532.0,
                                "likes": 1
                            },
                            {
                                "author": "TheSoussDaGoose",
                                "comment": "The Samsung series would be the only phone I’d switch too. Maybbeeeee Pixel in a few years when they switch to TSMC chips.",
                                "published_at": 1706398118.0,
                                "likes": 1
                            },
                            {
                                "author": "Unknown",
                                "comment": "lol at the upvotes! wtf",
                                "published_at": 1706408786.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "TheApplePerson_",
                        "comment": "I’m a big Apple fan but I can’t lie that phone looks amazing damn it’s beautiful lol",
                        "published_at": 1706362197.0,
                        "likes": 24,
                        "subcomments": [
                            {
                                "author": "oddabhi",
                                "comment": "Being honest about products is the best thing consumers can do despite their loyalty/attachment/commitment to a particular brand or ecosystem.",
                                "published_at": 1706367565.0,
                                "likes": 7
                            },
                            {
                                "author": "loverlaptop",
                                "comment": "Exactly, Apple does not have a proper file system. I wish it had",
                                "published_at": 1706372608.0,
                                "likes": 1
                            },
                            {
                                "author": "Zestyclose-Exam1160",
                                "comment": "Looks amazing?   It’s growing warts",
                                "published_at": 1706373053.0,
                                "likes": 1
                            },
                            {
                                "author": "Mtking105",
                                "comment": "It’s ugly why does it look like a plastic square?",
                                "published_at": 1706378643.0,
                                "likes": 1
                            },
                            {
                                "author": "emojimoviethe",
                                "comment": "It looks like a pop tart",
                                "published_at": 1706382752.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "vortex210",
                        "comment": "I thought that was a view from your balcony 🤣",
                        "published_at": 1706358682.0,
                        "likes": 20,
                        "subcomments": [
                            {
                                "author": "oddabhi",
                                "comment": "I wish 😀",
                                "published_at": 1706358974.0,
                                "likes": 6
                            },
                            {
                                "author": "cowbell1971",
                                "comment": "I thought it was a window. Just noticed it’s a computer 😂",
                                "published_at": 1706371406.0,
                                "likes": 2
                            },
                            {
                                "author": "ComputeBeepBeep",
                                "comment": "I would hope batman isn't staring at him on his balcony that much haha.",
                                "published_at": 1706368426.0,
                                "likes": 1
                            },
                            {
                                "author": "blambtn",
                                "comment": "I did too!!",
                                "published_at": 1706370691.0,
                                "likes": 1
                            },
                            {
                                "author": "loverlaptop",
                                "comment": "Damn, I thought so too",
                                "published_at": 1706372563.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "UttieBoi",
                        "comment": "S24 Ultra is a wonderful phone! (I know a person who has it)",
                        "published_at": 1706362348.0,
                        "likes": 7,
                        "subcomments": [
                            {
                                "author": "oddabhi",
                                "comment": "Can confirm.",
                                "published_at": 1706367577.0,
                                "likes": 3
                            }
                        ]
                    },
                    {
                        "author": "tortillas007",
                        "comment": "I wished I could switch man. But I have way too many apple devices for me to make the move. That Samsung is the best phone out right now",
                        "published_at": 1706371265.0,
                        "likes": 7,
                        "subcomments": [
                            {
                                "author": "oddabhi",
                                "comment": "I can understand. I have a mix of devices, it was easier for me.",
                                "published_at": 1706371471.0,
                                "likes": 2
                            },
                            {
                                "author": "Tricky_Ad6392",
                                "comment": "I made the switch. Only thing that didn't work was my apple watch. But you can use airpods and everything else with samsung!",
                                "published_at": 1706374501.0,
                                "likes": 1
                            },
                            {
                                "author": "Airriona91",
                                "comment": "Literally why I haven’t switched back. Too far into the ecosystem at this point.",
                                "published_at": 1706543444.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "Unknown",
                        "comment": "I love Androids more than my iPhone 13",
                        "published_at": 1706368355.0,
                        "likes": 7,
                        "subcomments": []
                    },
                    {
                        "author": "sanya773",
                        "comment": "The s24 ultra is so cool, but it’s too damn big for my hands :/",
                        "published_at": 1706368103.0,
                        "likes": 5,
                        "subcomments": [
                            {
                                "author": "moots27",
                                "comment": "I have small/medium hands. I made the sacrifice for a larger display and you can definitely get used to it. Like unironically my hand is more dexterous and durable to hold and use it now.",
                                "published_at": 1706731383.0,
                                "likes": 2
                            }
                        ]
                    },
                    {
                        "author": "Unknown",
                        "comment": "Damn that phone looks fine AF 🔥",
                        "published_at": 1706367475.0,
                        "likes": 3,
                        "subcomments": [
                            {
                                "author": "oddabhi",
                                "comment": "Thanks.",
                                "published_at": 1706368387.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "jcapo86",
                        "comment": "That phone looks amazing!\n\nPs your emailadress is visible on the bottom of your lock screen",
                        "published_at": 1706362648.0,
                        "likes": 3,
                        "subcomments": [
                            {
                                "author": "oddabhi",
                                "comment": "Yeah I noticed that before posting.",
                                "published_at": 1706362902.0,
                                "likes": 3
                            },
                            {
                                "author": "Unknown",
                                "comment": "Not only that, but name, birth year, email, location can be deduced to Dubai. Come on bro!",
                                "published_at": 1706464324.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "Alternative-Roll-112",
                        "comment": "I have the same phone and absolutely love it. It's great for games and photography.",
                        "published_at": 1706368724.0,
                        "likes": 3,
                        "subcomments": [
                            {
                                "author": "oddabhi",
                                "comment": "Initially I wasn't digging the camera on s24U. But after tweaking some setting, I am blown away from the quality from this phone.",
                                "published_at": 1706369276.0,
                                "likes": 1
                            }
                        ]
                    }
                ],
                "shares": 1
            },
            {
                "title": "We must talk again about the Android update situation",
                "url": "https://www.reddit.com/r/Android/comments/nv0k5x/we_must_talk_again_about_the_android_update/",
                "score": 6056,
                "comments_count": 1297,
                "author": "jorgesgk",
                "created_utc": 1623143561.0,
                "selftext": "iOS15 will be compatible compatible with [2015 iPhone 6S and 2014 iPad Air 2](https://www.apple.com/ios/ios-15-preview/). For a little bit of context, in the iPhone 6S is older than a Galaxy S7 and a little younger than the Galaxy S6.\n\nThe iPad Air is around the same age of a Samsung Galaxy Note 10.1 (yeah, they were not even called Galaxy Tab back then).\n\nThis is why Fuchsia is needed now. Google can't pretend to build a successful platform for the future when it provides updates for half the life of its main competitor at best. These devices are expensive. Galaxy Tabs are similarly priced than comparable iPads, and so are flagship Android phones, yet iPhones get much more support. Even Surfaces from the same year still receive the latest version of the OS. I know this has been discussed before, but just because nobody does anything doesn't mean we should stop complaining.\n\nI know the problems of the Linux kernel ABI, but if Treble is not going to be a solution, you must find something else.\n\nEdit: Kay guys, I'm gonna stop the replies notifications. You get butthurt instead of acknowledging the true problem.",
                "comments": [
                    {
                        "author": "robinp7720",
                        "comment": "The problem with updating an android phone is that there is no incentive to do it. Most manufactures only make a profit at the time of sale of the device, without continuous income from the users continued use of the device. This is contrary to the way apple produces income from the iPhone where they are still able to produce income from iPhone users through services such as the App Store.\n\nAnother major problem is the support period Qualcomm has for their SOCs. They don't contribute their changes to the Linux kernel back upstream. This means that updating the Linux kernel is a fairly labor-intensive task. PostmarketOS is trying to improve this by improving the modifications to a standard such that they can be mainlined and contributed upstream.\n\nFuchsia won't necessarily improve the situation. ~~It's not an open source solution, which means that other phone manufactures might not be able to use it, which also means reduced competition which is certainly worse for the consumer. It also means that you are not legally allowed to modify and redistribute it, unlike AOSP. Projects similar to Lineage OS wouldn't exist for Fuchsia to extend device support beyond the EOL from the manufacturer.~~ (See joshwd36's comment for a better explanation). The problem that phone manufactures won't produce a profit beyond the time of sale will still continue to be a problem. Maybe it'll allow Google to support their phones for beyond the 2-3 year mark. It'll be worse for everyone else though.\n\nWhat problem do you know about Linux ABI stability? Linux userspace is stable. IE: It doesn't change. The problem is hardware support from Qualcomm who doesn't upstream their kernel changes to support their SOCs.\n\nEdit: Fuchsia is FOSS which means that my point about lack of 3rd party support isn't applicable.",
                        "published_at": 1623145682.0,
                        "likes": 979,
                        "subcomments": [
                            {
                                "author": "joshwd36",
                                "comment": "Just a correction, Fuchsia is open source. However, it's distributed under more permissive licenses which do not require manufacturers to share the hardware-specific modifications they have made, as the kernel in Android does under the GPL license. This could make custom roms more difficult/impossible as they often rely on those modifications to work on the hardware, but it won't make them illegal.",
                                "published_at": 1623150625.0,
                                "likes": 334
                            },
                            {
                                "author": "UpsetKoalaBear",
                                "comment": "I thought Fuchsia is open source?\n\nhttps://fuchsia.googlesource.com/",
                                "published_at": 1623150464.0,
                                "likes": 62
                            },
                            {
                                "author": "Unknown",
                                "comment": "But... It's not the consumer's responsibility to *care* about that, and it's not the consumer's responsibility to try to fix it with customer ROMs and kernels.\n\nWhatever the reason is, Apple does it better, on the whole.",
                                "published_at": 1623156843.0,
                                "likes": 60
                            },
                            {
                                "author": "Unknown",
                                "comment": "which means when Google releases new Android, it has to go through chip manufacturers to modify it so it becomes compatible with their SoC. Then it is handed over to OEMs.  \nam i right senpei?\n\nLast year Samsung lauched a bunch of smartphones with their old Exynos 9611 processor. [Browse to the device section](https://www.samsung.com/semiconductor/minisite/exynos/products/mobileprocessor/exynos-9611/) \n\nTech community bashed these devices for its processors & the 9611 was ridiculed. \n\nBut all these devices were quick to receive Android 11 update than their Snapdragon & Mediatek competitors.",
                                "published_at": 1623154273.0,
                                "likes": 39
                            },
                            {
                                "author": "OptimisticCheese",
                                "comment": "Not only that, costumers are also another problem. Most people outside of this sub who buy Android phones do not care about updates at all, meaning the manufacturers do not need to either.",
                                "published_at": 1623152734.0,
                                "likes": 39
                            }
                        ]
                    },
                    {
                        "author": "FalseAgent",
                        "comment": "there will be a lot of people in here inhaling copium and coming up with unique and inventive ways to say how aKsHuAlLy updates maybe bad and updates maybe not big deal\n\nCut the bullshit. Android's failure with updates is baked into the Android business model. There is no way around it. The best we've gotten is Samsung's benevolence.",
                        "published_at": 1623150670.0,
                        "likes": 602,
                        "subcomments": [
                            {
                                "author": "hnryirawan",
                                "comment": "After using Android for so long and stepped out of the Samsung's bubble for awhile back then, I've realized that Samsung actually doing alot to make base Android competitive with iOS.",
                                "published_at": 1623152708.0,
                                "likes": 189
                            },
                            {
                                "author": "TheCrazyStupidGamer",
                                "comment": "The only reason why I went for samsung this time around.",
                                "published_at": 1623152077.0,
                                "likes": 82
                            },
                            {
                                "author": "AL2009man",
                                "comment": "[I've been downvoted for poking fun at Motorola (and later OnePlus in a annoyed faction)' software updates](https://www.reddit.com/r/Android/comments/nuezjr/exclusive_oneplus_ceo_reveals_n200_phone_details/h0y6387?utm_source=share&utm_medium=web2x&context=3), but I don't think Fuchsia is the solution to the problem.  \n\n\nI just wish the Android industry takes Software Updates more seriously.",
                                "published_at": 1623157043.0,
                                "likes": 22
                            },
                            {
                                "author": "Future_Khai",
                                "comment": "Then how do people explain the Google phones lack of updates compared to iPhones? Google pixels in theory should be going toe to toe with iPhones but they simply don’t. The pixel 4 is currently the only pixel receiving updates which came out in 2020.",
                                "published_at": 1623167931.0,
                                "likes": 14
                            },
                            {
                                "author": "OrganicToes",
                                "comment": "Literally encouraging ewaste on a massive scale by making perfectly adequate hardware antiquated after only 2years. Whoever is to blame, the fact is that it's totally unacceptable for this to he the case. On the desktop u can slap Linux distros on an ancient machine and they will be secure and chug along just fine. Let alone you have many phones with the highest of specs that will quickly fizzle out due to poor support.",
                                "published_at": 1623165537.0,
                                "likes": 8
                            }
                        ]
                    },
                    {
                        "author": "1uamrit",
                        "comment": " While regular notifications for update may suck and update process even more but to their credit windows provide regular updates to windows.\n\n Most Chinese oems don't care about the smart phones once they release a newer phone. Youtubers go on and on about how good their new (Chinese and other) smart phone is after using it for a week then they shift to new phones, not caring its performance in the long run. People don't change phones like those reviewers do. Meanwhile the manufacturer provides no additional updates to the phone.",
                        "published_at": 1623154383.0,
                        "likes": 585,
                        "subcomments": [
                            {
                                "author": "Unknown",
                                "comment": "Exactly, there's a bunch of channels that show off how great a phone is in the short term but realistically they don't last past a year or two.",
                                "published_at": 1623168696.0,
                                "likes": 175
                            },
                            {
                                "author": "Unknown",
                                "comment": "That exactly why Google is moving towards the Windows model for updates - they've  been making steady progress on this for years, and it is advanced enough now that most of the important parts of the OS can (and are) updated remotely and silently even for old phones.\n\nThis is actually a much better way to do updates then the way iOS does it.",
                                "published_at": 1623177212.0,
                                "likes": 24
                            },
                            {
                                "author": "Znuff",
                                "comment": "> People don't change phones like those reviewers do. \n\nMost reviewers also don't get the device for longer periods.\n\nYes, most have to actually give the devices back after 1 or 2 weeks (2 weeks is maximum that Samsung gave me a device to test and write about). \n\nThe longest I have kept a device for review was 2 months (Xperia 1 II), but usually you have a deadline on when to publish the review - that is, in the first week of the device release, of even before it gets released, to hype it up.",
                                "published_at": 1623181203.0,
                                "likes": 18
                            },
                            {
                                "author": "arahman81",
                                "comment": "Desktop OSes aren't hardware dependent. And ChomeOS devices get regular updates too. For Android, it's mainly OS updates having to include drivers too.",
                                "published_at": 1623178771.0,
                                "likes": 16
                            },
                            {
                                "author": "minilandl",
                                "comment": "In the case of Xiaomi they are one of the most popular devices on XDA because miui is an add riddled mess and devices aren't supported long term. The only way to have a good experience is custom ROMs.",
                                "published_at": 1623317401.0,
                                "likes": 4
                            }
                        ]
                    },
                    {
                        "author": "darkstarrising",
                        "comment": "The problem is, almost all Android phone manufacturers have their entire business model built around getting people to upgrade every year or two. Which is why the cheaper the phone the less updates it gets. It made sense in the initial years where there were HUGE changes. But not so much any more. \n\nBut to change that manufacturers have to change business models. Which probably means more ads. So that could mean even worse things for us as Android users.",
                        "published_at": 1623153488.0,
                        "likes": 489,
                        "subcomments": [
                            {
                                "author": "cliffotn",
                                "comment": "Let's talk about companies that brag about what they're doing to lower their carbon footprint.  Imagine how many phones would have a much longer lifespan if updates were longer, and if (for ex) one could grab a tiny torx screwdriver, remove the phones back, and connect a brand new battery.  I get water resistance and thinness precludes an old style pop off the back and swap out a battery design.  But I'm not convinced a battery couldn't be easy enough for most to do with a simple, tiny screwdriver.  \n\nThe e-waste and carbon of hundreds of millions of what could be serviceable phones being trashed is staggering.",
                                "published_at": 1623173706.0,
                                "likes": 122
                            },
                            {
                                "author": "JaxJaguar",
                                "comment": "The phone manufacturers need to limit development to 4-6 phones per year. Samsung released 44 different models last year... It's impossible to adequately maintain that many devices over a long period of time. \nIt ends up hurting the brand long term as the people who buy the cheap stuff are less likely to be loyal when they have the means to get something more expensive.\n\nIt's the same problem that's plagued Microsoft's reputation. People will usually start with the cheapest thing. They end up hating it because it doesn't last long and then upgrade to Mac or iOS because it's more consistent quality and basically no research is required across it's entire product line.\n\nFor Microsoft and Android you really want a Galaxy S or XPS type device, but there are so many cheaper options it's overwhelming for the consumer when \"they all look the same\".\n\nhttps://www.samsungsfour.com/mobiles/samsung-galaxy-smartphones-complete-model-list-released-year.html",
                                "published_at": 1623165596.0,
                                "likes": 61
                            },
                            {
                                "author": "Zambini",
                                "comment": "How is this different than IPhone? Their cycle is practically yearly now.",
                                "published_at": 1623164135.0,
                                "likes": 56
                            },
                            {
                                "author": "paul-cus",
                                "comment": "Beat me to it. Android OEMs want to do just enough with updates to appease most people.",
                                "published_at": 1623164164.0,
                                "likes": 2
                            }
                        ]
                    },
                    {
                        "author": "FragmentedChicken",
                        "comment": "Pardon my ignorance, what would Fuchsia solve?",
                        "published_at": 1623146147.0,
                        "likes": 253,
                        "subcomments": [
                            {
                                "author": "gold_rush_doom",
                                "comment": "Nothing. All the problems that android is facing can only be solved with open sourcing drivers.",
                                "published_at": 1623150078.0,
                                "likes": 488
                            },
                            {
                                "author": "jorgesgk",
                                "comment": "The driver problems by having a stable kernel ABI. Updates would be possible for longer.",
                                "published_at": 1623151248.0,
                                "likes": 6
                            },
                            {
                                "author": "PrismSub7",
                                "comment": "Modular updating.\n\nIt won't solve it, but it'll improve the situation again.",
                                "published_at": 1623151180.0,
                                "likes": 6
                            },
                            {
                                "author": "Cheeseblock27494356",
                                "comment": "Nothing. OP is a troll. See it's post history.",
                                "published_at": 1623211717.0,
                                "likes": 2
                            }
                        ]
                    },
                    {
                        "author": "Slusny_Cizinec",
                        "comment": "The problem is not the Linux ABI. The problem is business model. There is zero incentive to support Android phones for long, as the vendor doesn't make any money from it. \n\nThus, your hopes on Fuchsia are completely misplaced.",
                        "published_at": 1623153743.0,
                        "likes": 227,
                        "subcomments": [
                            {
                                "author": "PowderPuffGirls",
                                "comment": "What is the difference to windows OEMs? Windows has a stable driver ABI, am I correct? Why can't we have that for Android? There's zero reason in my mind why my 8 year old ThinkPad can run Windows 10 but my OnePlus 5T is supposed to be at the  end of its software life. Lenovo is not making any money from the ThinkPad either after the initial sale.",
                                "published_at": 1623163673.0,
                                "likes": 37
                            },
                            {
                                "author": "Green0Photon",
                                "comment": "Yeah.\n\nThe issue is that each device manufacturer modifies the Linux kernel manually, so every single android is running a different version of Linux, instead of merging device drivers into a single kernel (or just using the baseline and having proprietary drivers). So since no company wants to maintain their device, the devices stop being supported because the custom Linux versions stop being supported.\n\nBut if they merged their work with upstream, then they *would* be able to stop giving a fuck but each device would still support new versions.\n\nhttps://postmarketos.org/",
                                "published_at": 1623176434.0,
                                "likes": 3
                            },
                            {
                                "author": "chiniwini",
                                "comment": ">There is zero incentive to support Android phones for long\n\nHow about this: if you don't support the phone for 5 years, you're not allowed to use Android.",
                                "published_at": 1623219567.0,
                                "likes": 2
                            },
                            {
                                "author": "TheBeliskner",
                                "comment": "It also doesn't seem to help that most consumers don't care about updates. So while we make noise in here Google aren't dropping market share because of it so have basically no incentive to fix anything.",
                                "published_at": 1623219649.0,
                                "likes": 2
                            }
                        ]
                    },
                    {
                        "author": "neon_overload",
                        "comment": "There are multiple products called the Galaxy Note 10.1.  The one I have was the original, and was released 2012.  It was not updated past Android 4.4.  Another one was released years later.\n\nPeople upgrade tablets less frequently than phones, so it would be nice if tablets could receive updates for more than 5 years.",
                        "published_at": 1623158260.0,
                        "likes": 185,
                        "subcomments": [
                            {
                                "author": "Alternative-Farmer98",
                                "comment": "The Lenovo Chromebook duet gets support until 2028. Fyi",
                                "published_at": 1623176179.0,
                                "likes": 52
                            },
                            {
                                "author": "Unknown",
                                "comment": "[deleted]",
                                "published_at": 1623165247.0,
                                "likes": 46
                            },
                            {
                                "author": "someguy3",
                                "comment": "I get the impression they're aiming to make ChromeOS tablets their main line. And Android tablets will die off.",
                                "published_at": 1623195884.0,
                                "likes": 9
                            },
                            {
                                "author": "bazooopers",
                                "comment": "Hey I think we have the same tablet, I was wondering what do you use it for nowadays? I rooted mine but still haven't really found a good use for it, it's a bit too slow and outdated for some apps...",
                                "published_at": 1623203647.0,
                                "likes": 2
                            },
                            {
                                "author": "Minto107",
                                "comment": "Yeah and there was Note 10.1 2014 edition(i think this is the one OP's talking about)",
                                "published_at": 1623212862.0,
                                "likes": 2
                            }
                        ]
                    },
                    {
                        "author": "VMX",
                        "comment": "I don't think those things are directly comparable to the Android situation.\n\nSure, the iPhone 6S may \"get\" the update, but half of the stuff is usually stripped out of the specific iOS version that will be built for the iPhone 6S, which is not the same version that will be built for the iPhone 7, which is not the same version that will be built for the iPhone 8, etc. You can't just compare numbers and assume the devices will be on the same level.\n\nAnd I'm leaving aside performance issues that many people report when they update such old devices to new iOS versions.\n\nMeanwhile, a 5 year old Android phone may not get Android 12, but it still continues to receive lots of new OS-level features by updating native system apps through the Play Store + Google Play Services updates.\n\nLet's not forget on an iPhone, updating things as basic as the calculator or the calendar app requires a full iOS upgrade. On Android, your can completely update (or replace) your phone app, your native keyboard, even your Android launcher directly through a normal app update, because absolutely everything is modular.\n\nIn other words, an Android phone is a living thing, receiving constant updates and changes even if the OS isn't directly updated. Whereas an iPhone becomes completely stale and outdated very quickly without OS updates.",
                        "published_at": 1623145260.0,
                        "likes": 179,
                        "subcomments": [
                            {
                                "author": "undernew",
                                "comment": "A whole bunch of mental gymnastics why it's ok for Android phones to only get 2-3 years of updates.\n\n>\tSure, the iPhone 6S may \"get\" the update, but half of the stuff is usually stripped out of the specific iOS version that will be built for the iPhone 6S\n\nIf a feature requires specific hardware it possibly isn't available on older devices. Hardly surprising. You still get all the important security updates.\n\n>\tAnd I'm leaving aside performance issues that many people report when they update such old devices to new iOS versions.\n\nIgnoring that many users report better performance after updates, what kind of argument is that? \"Performance could get worse after an update so I'm glad that I don't get any updates at all on Android\".\n\n>\tMeanwhile, a 5 year old Android phone may not get Android 12, but it still continues to receive lots of new OS-level features by updating native system apps through the Play Store + Google Play Services updates.\n\nAnd you also don't get any security updates making your phone a risk for sensitive work.\n\n>\tLet's not forget on an iPhone, updating things as basic as the calculator or the calendar app requires a full iOS upgrade.\n\nHow is this relevant for updates on Android? An OS update is more than just some internal apps getting updater.",
                                "published_at": 1623150523.0,
                                "likes": 267
                            },
                            {
                                "author": "Unknown",
                                "comment": "From a developer perspective this isn't true. When you build apps for iOS you can target the absolute latest version of iOS and have no compatibility issues. That gives you 95% customer reach across the iOS ecosystem. In order to achieve the same market 'reach' on Android you have to target much *older* API levels. Google can't push every new feature through the Play Store, some things needs a system update (e.g graphics, machine learning). This means all those new and fancy features revealed at Google I/O are completely useless unless you plan to release on the absolute newest phones. That's not good for business. This is often why the time-to-launch apps is months or even years ahead on iOS. It's why photography, augmented reality, and gaming are miles ahead on iOS. Android's app ecosystem is years behind because developers have no choice but to target 2-3 year old phones. Coupled with the fact that iOS users are much more likely to spend money on apps, you end up in a situation where iOS apps get prioritized over Android. This is why Google themselves launch iOS first, it's more profitable. System updates are an absolute must for Android regardless of consumer interest. Android is a second-class platform for consumers and developers.",
                                "published_at": 1623151112.0,
                                "likes": 109
                            },
                            {
                                "author": "8day",
                                "comment": "The only reason I want updates is for [OS] security. Yes, situation with native iPhone apps is likely to result in decreased sucurity, but shouldn't it be possible to use 3rd party apps instead in such cases? I haven't used iPhone or any Apple product for that matter, but it looks like iPhone is worth the investment if you are unlikely to loose or break it.",
                                "published_at": 1623149123.0,
                                "likes": 56
                            },
                            {
                                "author": "Unknown",
                                "comment": "I don't know if you're exaggerating to try and make your point seem more valid or it's just disingenuous, but \"half of the stuff\" is not going to be stripped out of the iPhone 6S version of iOS 15. At most the older phones miss out on a couple of new features.",
                                "published_at": 1623150107.0,
                                "likes": 37
                            },
                            {
                                "author": "katsuku",
                                "comment": "Older, yet still capable devices lose out though as apps restrict compatible software versions. I have a Galaxy Tab pro tablet stuck on like 4.4 or something like that, and can't get apps like crunchyroll any longer even though it's a perfectly capable media player.",
                                "published_at": 1623151749.0,
                                "likes": 29
                            }
                        ]
                    },
                    {
                        "author": "reddanit",
                        "comment": ">I know the problems of the Linux kernel ABI, but if Treble is not going to be a solution, you must find something else.\n\nYou got the problem backwards - it's Qualcomm and other SoC providers that are adamant about providing shit drivers and preventing anybody else from updating them through licensing agreements. Kernel ABI has nothing to do with it.\n\nGiven that Google doesn't have the clout (or willingness) to force SoC manufacturers to play ball with Linux kernel, I'm not sure how anything would change with Fuchsia.",
                        "published_at": 1623146424.0,
                        "likes": 161,
                        "subcomments": [
                            {
                                "author": "rocketwidget",
                                "comment": "I'm not sure how important Fuchsia will be, but things might change if Google creates it's own silicon that they can provide extended support for, themselves.\n\n[https://www.xda-developers.com/google-pixel-6-custom-system-on-chip/](https://www.xda-developers.com/google-pixel-6-custom-system-on-chip/)\n\nIt will be very interesting if long term updates become an Apple *and Pixel* thing.",
                                "published_at": 1623154238.0,
                                "likes": 33
                            },
                            {
                                "author": "Ivashkin",
                                "comment": "Maybe time to require manufacturers to recycle devices once they are no longer supported. Right now they get all the profits, but the world has to deal with e-waste because a chip maker won't update its drivers. Maybe they would if they had to pay for the cost of recycling everything that contained the chip they refused to support?",
                                "published_at": 1623156171.0,
                                "likes": 16
                            }
                        ]
                    },
                    {
                        "author": "fensizor",
                        "comment": "I would be fine with 3 years of updates if it was the new standard for all major manufacturers.",
                        "published_at": 1623150611.0,
                        "likes": 143,
                        "subcomments": [
                            {
                                "author": "Unknown",
                                "comment": "That's a more realistic and doable start.  Would be great for most people since a lot of those studies show that upgrade cycles are 2-3 years on average.\n\n3 years should be the minimum, and 5 for bigger companies like Samsung, Google.",
                                "published_at": 1623150827.0,
                                "likes": 107
                            },
                            {
                                "author": "krebs01",
                                "comment": "I just want Samsung tablets getting the same support Apple gives to the iPads. I mean, the iPad Pro from 2015 is getting the iOS 15 and tablets are not something you change as frequently as smartphones",
                                "published_at": 1623153672.0,
                                "likes": 68
                            },
                            {
                                "author": "nudie_magazine-day",
                                "comment": "This has annoyed me so much that I just bought an iPhone 8 today for $250 and I'm going to sell my galaxy 10e for about 350. Androids and iPhones lately have really just all become similar, charging an arm and a leg for really basic generational changes in my view. The only thing that is different these days seems to be the software and security patches, and I am guaranteed 2 major updates on this \"new\" phone which is 4 years old in September. Compared to android it's unbelievable. I never thought I'd be an iPhone user but these update timelines have absolutely sold me. Reduce, reuse, recycle is also a factor for me. I think I'll be buying 2nd hand iPhones for cheap for a while now, until android can catch up...",
                                "published_at": 1623155463.0,
                                "likes": 40
                            },
                            {
                                "author": "bobnoski",
                                "comment": "I'd also like to see more timely updates.\nandroid 12 is around the corner and I'm still waiting on the promised android 11 update for my Edge and it's not like Motorola really changes anything on android.",
                                "published_at": 1623158066.0,
                                "likes": 14
                            },
                            {
                                "author": "HCrikki",
                                "comment": "3 years is still too short. Devices dont stop working after that period or become ridiculously slow.\n\nIf you buy devices used or late in their sale cycle, you also wouldnt get that full 3 years of support. Used iphones keep commanding a high resale price that helps people justify getting newer devices because devices are supported, safe and usable much longer.",
                                "published_at": 1623170219.0,
                                "likes": 2
                            }
                        ]
                    }
                ],
                "shares": 0
            },
            {
                "title": "Bought OP13 after watching 100s of videos - 3 months review",
                "url": "https://i.redd.it/fnna7wyb370f1.jpeg",
                "score": 824,
                "comments_count": 223,
                "author": "anmolbaranwal",
                "created_utc": 1746988203.0,
                "selftext": "After watching 100s of youtube videos and comparing phones from Iqoo, Xiaomi, Motorola, Vivo, Samsung, Pixel, other... I decided to buy OP13 (512gb version).\n\nI was actually waiting for S25 ultra, but as soon as they announced the price... it just didn’t feel worth it. so I decided to go with this.\n\nMy last phone was redmi note 10 pro (bought in 2020), which is something you should know because I've never used a high end phone.\n\nHere is my review after 3 months of usage:\n\n1. easily the best phone I have ever used, in every single way.\n2. battery is super fast, I can use it for the entire day, just put it on charge for 30 minutes and done. the only thing to note is battery seems to drain very fast when I record 4k videos.\n3. camera is very good, but sometimes it takes okay photos for no reason. maybe i'm just bad at clicking photos (can't say). ai features are decent too, didn't try it hard on captured photos (I prefer original ones)\n4. ui is very good & clean. widgets, quick menu, notification layout and other stuff are nice\n5. performance is crazy, opening and closing apps are so fluent. never had any lag till now.\n6. the small features like file dock, dynamic island, global search make the ux so much better.\n7. speaker output felt a bit lower compared to other phones\n8. recently I took it to a water park without any plastic bag and clicked photos. IP69 rating + aqua touch is cherry on top\n\nI'm going to use OP13 for at least 5 years!",
                "comments": [
                    {
                        "author": "Spare_Reference1505",
                        "comment": "You will regret for sure. Too many videos to decide. \nNah I'm joking. Enjoy it as I'm enjoying my OnePlus 12. Great phones. ",
                        "published_at": 1746988353.0,
                        "likes": 168,
                        "subcomments": [
                            {
                                "author": "anmolbaranwal",
                                "comment": "I was too confused on what to buy haha... seriously, I was watching way too many videos. I'm not a fan of using AI stuff in phones, so this is perfect for me. enjoying it so far :)",
                                "published_at": 1746989220.0,
                                "likes": 41
                            },
                            {
                                "author": "Mommyistweaking",
                                "comment": "Got me in the First Half Doc",
                                "published_at": 1747033524.0,
                                "likes": 3
                            },
                            {
                                "author": "HasnainMohiuddin",
                                "comment": "Your comment was very close to downvote.",
                                "published_at": 1747224760.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "rj_0011",
                        "comment": "I've watched more than 100 videos too but I'm thinking of sticking with my xiaomi 11 lite ne & waiting for next year's OnePlus flagship. \n\nOP 13 is one of the best devices.",
                        "published_at": 1746989770.0,
                        "likes": 32,
                        "subcomments": [
                            {
                                "author": "anmolbaranwal",
                                "comment": "awesome. I usually don't change phones often, so this is going to stick with me for a very long time.\n\nxiaomi phones are really good.. I used one for 4 years myself, so I can say that with confidence. yes, people do hate chinese stuff but it's totally fine as long as it works. I wonder what kind of naming system they use hehe",
                                "published_at": 1746992066.0,
                                "likes": 7
                            },
                            {
                                "author": "Horrrrlicks",
                                "comment": "Same here, using 11 lite Ne, got hyper os 2.0 update recently, really happy with the update policy of xiaomi, a midrange released in 2021 getting updates even in 2025, I'm planning on upgrading to X15 or X16 if released early, by the end of the year",
                                "published_at": 1747193884.0,
                                "likes": 1
                            },
                            {
                                "author": "TKTheoKay",
                                "comment": "When's the next flagship, the OnePlus 14, due to be announced and launched?",
                                "published_at": 1747555819.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "Alert_Maintenance_35",
                        "comment": "Congratulations 🎉🎉🎉🎉🎉🎉🎉🎉🎉",
                        "published_at": 1746988804.0,
                        "likes": 28,
                        "subcomments": [
                            {
                                "author": "anmolbaranwal",
                                "comment": "thanks buddy. happy to be op user :)",
                                "published_at": 1746989276.0,
                                "likes": 4
                            }
                        ]
                    },
                    {
                        "author": "MFBeast",
                        "comment": "I'm having a really hard time deciding between the OP13 or the Oppo Find X8 Ultra. \n\n\nI'd love to know how the phone handles gaming?\n\n\n\nPreviously had a OP3 and currently using OP7 pro. Decisions decisions ",
                        "published_at": 1746990100.0,
                        "likes": 13,
                        "subcomments": [
                            {
                                "author": "anmolbaranwal",
                                "comment": "yeah I remember that oppo phone, some youtubers recommended it over this. I installed a 1.8gb game a while back and it worked smoothly, no lag or heating issues at all... still, I dont play games that much so please check reviews on youtube",
                                "published_at": 1746992852.0,
                                "likes": 5
                            },
                            {
                                "author": "Thisboiistaken",
                                "comment": "How are you getting the oppo for the same price? Nonetheless, if I were you, I'd pick the oppo find x8 ultra",
                                "published_at": 1746993513.0,
                                "likes": 3
                            },
                            {
                                "author": "Existing_Bowl_1381",
                                "comment": "I have the oneplus 13, if you are a gamer then get op but if you use the camera a lot of time, oppo might be better(also it has better selfie cam?), but i am very satisfied with the op 13 camera especially when using portrait mode, i use it for gaming all the time , it does not disappoint, also 120 fps is amazing and does not frame drop , heat is also minimal compared to rog phones",
                                "published_at": 1747017288.0,
                                "likes": 2
                            },
                            {
                                "author": "_rizzler",
                                "comment": "I can confirm OP13 handles games seamlessly, I was able to play CODM and Genshin for hours with zero  lag or frame drops at 120fps with little to no heating even after a solid hour or two of gaming. \n\nI'm impressed with the performance and would heavily recommend it. 📈",
                                "published_at": 1747062998.0,
                                "likes": 1
                            },
                            {
                                "author": "LogicalChart3205",
                                "comment": "Oppo find x8 ultra annihilates Oneplus 13 in camera department. Genuinely DSLR shots. \n\nRest they're both pretty similar except Oppo getting Wifi 7",
                                "published_at": 1747068881.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "Dremlin2000",
                        "comment": "I dropped by Samsung S22 ultra and got cracks on the screen so decided to try OP 13. I also had an OP 6T in the past and it was a good phone at that time.\n\nI like its size not overly big but because of heavy camera module it is not well balanced and the upper side is a little bit too heavy which may cause a sudden drop if not handled properly especially with one hand.\n\nBattery life is just insane in compt with S22 Ultra. For my usage I get 2 days without charging. Charging speed is another big plus of OP13.\n\nOxygen OS 15 is very smooth but the font size inconsistency does not look good at all.\nTBH, I like the default design of OneUI more than Oxygen 15.\n\nCameras... I think that S22 Ultra takes a little better photos on the main and wide angle cameras whereas OP13 has better front and 3X camera. The Samsung also has 10X telescopic camera which is a good addition but I used it maybe a few times so no real life usage really.\n\nWhat I also do not like is that speakers on OP13 are not balanced, e.g. the bottom speaker is much louder than the top one. Also auto brightness works a little bit weird (maybe the phone is still adapting to my preferences), sometimes the screen is either overly bright or too deem and I need to change brightness manually.",
                        "published_at": 1747014158.0,
                        "likes": 7,
                        "subcomments": [
                            {
                                "author": "anmolbaranwal",
                                "comment": "based on the reviews as well, people preferred OneUI for obvious reasons. ty for the comparison.. i like the dim the brightness gets on op, like it's very low during night which helps avoid any strain on eyes yk",
                                "published_at": 1747062731.0,
                                "likes": 1
                            },
                            {
                                "author": "jdubinitup",
                                "comment": "I swapped from the s22u as well and this is pretty much spot on. I really think the cameras are on par with the s24u-s25u cameras. I've had this phone for a good 4-6 months now and I don't see myself swapping at all! \n\nMy only negatives are the swipe gestures, speakers compared to more expensive phones and some notifications with my Galaxy Watch Ultra. Id love to have the old s22u swipe up from bottom to go back gestures vs this dumb swipe back from the side. I find myself swiping back on things way too much.  I might have to see if there is some launcher customization to adjust that. The speakers need work but it's not a horrible sound at all just weirdly balanced like you mentioned.\n\nAs for the watch, it could just be the watch vs the phone.",
                                "published_at": 1747064660.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "stryfe14",
                        "comment": "Congrats, these are definitely awesome photos and well worth the price, especially when comparing to the competition!",
                        "published_at": 1746989854.0,
                        "likes": 5,
                        "subcomments": [
                            {
                                "author": "anmolbaranwal",
                                "comment": "thanks, I don't really care about the competition (or the next xyz thing), as this works for me. here is a photo that I took without any setup\n\nhttps://preview.redd.it/f842sqdfh70f1.jpeg?width=4096&format=pjpg&auto=webp&s=384bba87ea59a0f57a9aee4c9ee260fd2daa2efd",
                                "published_at": 1746992568.0,
                                "likes": 4
                            }
                        ]
                    },
                    {
                        "author": "bitesized314",
                        "comment": "I'm in a similar boat but with the OnePlus 12. I had my S21 Ultra break during black Friday and got a S 24 Ultra for about week before returning it for a 512 GB OnePlus 12 for $649 no trade in. The S24 Ultra didn't feel any different than my S 21 Ultra. The OnePlus 12 is just as good in everything except the speakers are not as loud. I like to watch YouTube videos in the shower and now it's a bit low if the video isn't a particularly loud video. But in every other way they are equal \n\nI had the OnePlus 3, 3T with no issues. Customer service on my 7 Pro and 9 Pro lead me to leave and get a Samsung. OnePlus never could fix a problem in one attempt or just never fixed a problem. Couldn't give me a correct quote for the battery and back glass in my 7 Pro after getting 5 incorrect quotes. Couldn't give me a preorder bonus for my 9 Pro despite me preording after the first bonus was out of stock and before the second bonus had taken it's place. OnePlus also gave me incorrect information on a device repair on my 9 Pro. They told me to file the claim in a OnePlus website directly instead of their insurance partner for the protection I bought at checkout, and I had to then file the correct claim with Asurant or whatever their partner was named. I had even given OnePlus my order number that had the device protection in it.\nGoing back to the OnePlus 12 is OnePlus last chance. Don't mess up again with customer service.",
                        "published_at": 1746995355.0,
                        "likes": 5,
                        "subcomments": [
                            {
                                "author": "anmolbaranwal",
                                "comment": "i noticed that about speakers as well, when comparing it with a phone that's a third of the price.\n\nis customer service that bad? let's hope I don't have to ever visit them",
                                "published_at": 1747031423.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "ferema32",
                        "comment": "Congrats, i want one. I see so many reviews, at the moment have s20 fe snapdragon in Great condition but i want something new, better and with a huge battery like op13. I see s24/25 ultra, like it but the battery for me is very important",
                        "published_at": 1746990732.0,
                        "likes": 4,
                        "subcomments": [
                            {
                                "author": "anmolbaranwal",
                                "comment": "s24 is really good, I wanted to buy it but the costs didn't feel worth it, then I found out samsung plans to make their AI features paid after a while, so that was a no for me.\n\nbattery is super cool in op13, tbh it's insanely fast and it lasts almost a day",
                                "published_at": 1746993189.0,
                                "likes": 3
                            },
                            {
                                "author": "kawsar4547",
                                "comment": "I'm in the same situation just like you",
                                "published_at": 1746995287.0,
                                "likes": 3
                            },
                            {
                                "author": "Sharath4676",
                                "comment": "Damn! Even I am in the exact same situation. I use a Samsung watch, I use the Samsung health as well. Will I miss anything if I move away from Samsung?",
                                "published_at": 1747040980.0,
                                "likes": 2
                            },
                            {
                                "author": "Humblebf109",
                                "comment": "Check out the Realme GT 7 Pro, 6500 mah battery.",
                                "published_at": 1746999105.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "New_Aardvark4184",
                        "comment": "I'm torn between the Honor Magic 7 Pro and the OnePlus 13. What factors did you consider when choosing the OnePlus?",
                        "published_at": 1746991562.0,
                        "likes": 4,
                        "subcomments": [
                            {
                                "author": "anmolbaranwal",
                                "comment": "multimedia, fast charging, performance, os, extra features (ip69), camera (don't use that much)...",
                                "published_at": 1747031745.0,
                                "likes": 2
                            }
                        ]
                    },
                    {
                        "author": "CosmicHavn",
                        "comment": "Even I’m planning to buy the OP13 but the Pixel 9/9a is giving me a hard time to decide as I like the design and software of Pixel. Any particular reason you went for OP13 instead of Pixel range (I know there are a lot like OP13 being snappy, fast charging, to name a few).",
                        "published_at": 1747025539.0,
                        "likes": 3,
                        "subcomments": [
                            {
                                "author": "osomfinch",
                                "comment": "If the camera is important for you - go with pixel.\n\nIf you value neat little features throughout the system - go with op13.",
                                "published_at": 1747033967.0,
                                "likes": 5
                            },
                            {
                                "author": "anmolbaranwal",
                                "comment": "based on reviews, people said to go for pixel if you want really nice cameras.. for me, op13 felt like better in several other ways so i just went with it. plus I've seen family members with op, not pixel ... so maybe it was a subconscious choice",
                                "published_at": 1747063025.0,
                                "likes": 2
                            },
                            {
                                "author": "Visthebeast",
                                "comment": "Chipset ig",
                                "published_at": 1747043702.0,
                                "likes": 1
                            }
                        ]
                    }
                ],
                "shares": 0
            }
        ]
    }
]