[
    {
        "topic": "What are the ethical considerations of genetic engineering?",
        "reddit_posts": [
            {
                "title": "Humanity spoke softly",
                "url": "https://www.reddit.com/r/HFY/comments/1ktyf83/humanity_spoke_softly/",
                "score": 762,
                "comments_count": 72,
                "author": "Edge_Anonymous",
                "created_utc": 1748045113.0,
                "selftext": "Short piece about a diplomat meeting a dangerous, weird creature with a dangerous and weird history. Hope you enjoy.\n\n\\---\n\nShe guided him toward a towering, overgrown archway that led outside, where the true splendor of Ilthea was just a glimpse. As they stepped through, the air was immediately filled with the scent of early-blooming night-vines, their luminescent petals casting a glow even in the fading daylight. The western, diplomatic district sprawled before them—gleaming spires intertwined with lush, cascading greenery, white walkways suspended between trees, and streams of crystal-clear water winding through the streets. A metropolis, nestled in and mimicked on the forests of the northern continent of Ilthea, alive and breathing as they were.\n\nIz watched his reaction with nervous excitement. \"This is our capital, Vaelith,\" she explained. \"The heart of Ilthean civilization. The planning alone took our entire caste of scholars - no resource was taken without being replenished, but still, nothing was spared.\" She hesitated, then added carefully, \"I imagine it must seem... very different from the cities of Earth. From-from what I have seen, in your … records.\" What does he think of our lack of walls? Our open markets, our cultural works, that are touted at each corner so proudly? The lack of pollution anywhere? But she held her tongue for now, four ears quietly fluttering, allowing him to absorb the sight of it all before pressing further. His eyes took it in with quiet fascination. This must be the first thing that she found so peculiar about humans… they all seemed so quiet.\n\n\"It must have taken decades to complete...\", he commented with an almost inaudible air of wonder, staring up and down at the spiraling structures of the Towers of the First Accord. “I have never seen something quite like this…”\n\nIz's ears flicked in amusement, a soft, melodic hum escaping her as she followed his gaze upward. \"Decades?\" she echoed, her voice laced with a quiet pride. \"Oh, no—*centuries*. Some of these spires have stood for over a thousand years, maintained and refined with each generation.\" \n\nShe gestured toward a particularly grand structure – though that would be hard to pin down in Vaelith – with its surface shimmering an iridescent sheen as if woven from liquid pearl. \"That one next to them—the Luminis Spire—was first erected during the Age of First Bloom. It was designed to catch the light of our twin suns at dawn and dusk, scattering it across the city like a blessing.\" Her tail gave a gentle sway as she spoke, \"We do not believe in haste when it comes to creation. Every detail is... considered. Every curve, every material chosen to honor the balance of form and function… speaking of which, there is a garden not far from here. I believe you might like it…\" \n\nHis gaze followed the skyline, eyes barely touching the ground as she adjusted their path. The interior gradually faded, white corridors replaced by an open space rich with the scent of Vaelith, soothing and herbal like the Ilthean south. The garden connected harmoniously, mathematically precise – Iz herself designed a fern here, in a manner that its leaves perfectly approximated Pi’s first 50 digits in what humans called a Fourier Series.  Before she could comment on it however, the human had already conquered the bench, admiring a genetically engineered waste bucket. Iz almost screamed when he bared his teeth, but quickly composed herself, clinging onto the tablet. *It was a yawn, Iz…* \n\n“Excuse me. It has been quite a journey,” he said, in an apologetic tone. He was tired. She had been drowning him in conversation, and all this time he did not even have the opportunity to sit down – Iz had read thousands of pages of his culture’s work and didn’t once think *he’d need to sit down*.\n\n“I’m sorry, of course, yes... no harm in it, is there?” \n\nA rhetorical question. Iz learned about those. A question not meant to be answered - the sheer paradox of it captivated Iz’s imagination and pen. Her cohort-mate grew tired of it fairly quickly – *but what did she know?*  \n\nShe set the slim device between them and joined him on the cushion. The human’s eyes were still busy with the garden’s scenery.  \n\n\"Regarding my question… this garden, or our spires… does such patience exist among humans?\" she asked, her voice carefully neutral. \"Or do your people prefer to build... *swiftly*?\" The question was diplomatic, but beneath it lay a deeper curiosity. The question seemed to pull the human back to the present, his back and strong, decorated fabric straightening once more. \n\n\"Before I answer... what is your natural lifespan?\"  He asked, running his paw – no, his… *hand* \\- across the surface of the bench. \n\nIz's ears stiffened slightly at the question, her tail going still. A flicker of hesitation passed through her before she answered—measured, precise, recalculated to human years in her head. \"The average Ilthean lives between 300 to 350 of your Earth years,\" she said, her voice as steady as possible. \"Though some of our scholars and spiritual leaders have reached around 400 cycles.\" \n\n\"And yours?\" she asked softly, though she already knew the answer. The reports had been very clear: humans burned bright and fast. Like *fire*. Like predators on the hunt, who had no time to waste. She watched his fingers trace the outline of the alloy’s frame. The contrast was there —his blunt, grasping digits against the smooth, organic alloy of Ilthean craftsmanship. \n\n\"It is ... different. Our natural lifespan reaches 90 of our years, more for some, but for many... *less*. Life to us must be like a fleeting dream to you...\" he seemed to almost shrink at this fact, gaze cast down over the railing at the edge of the garden overlooking the unhurried streets below. \n\nIz's breath caught in her throat, her ears lowering slightly as she absorbed his words. The thought was... unsettling. To live so briefly, to rush through existence like a spark in the dark—how could any species thrive under such pressure? Her four ears tilted forward, betraying her curiosity despite her diplomatic poise.  \n\nShe hesitated before speaking, choosing her words with care. \"To us, such brevity is... difficult to comprehend,\" she admitted, her voice low. \"We take centuries to perfect a single art, to nurture a bond, to *understand* one another. But you—\" Her gaze flickered to him, studying the way the twin suns caught in his eyes, metal on his fabric colorful like the garden. \"You must learn, create and *live* in the span of a single Ilthean adolescence. I myself am barely just 85…\" \n\nA quiet tension coiled in her chest. Was that why humans were so… *hungry*? So relentless? Why they *eat* other beings? Their development had been grand – comparable to Ilthea already, in a dizzyingly short amount of time. Though their history seemed... with many holes and hiccups during that progress. If she had only decades to her life, what would she chase with such fervor? Would it not make sense to take more for herself – *living or not*? \n\n\"...Does it frighten you?\" she asked suddenly, the question slipping out before she could stop it. \"Knowing how much *less* time you have than others?\" She silently chastised herself. This was a diplomatic, cultural exchange, not a *meditation class*.\n\nHe pondered the question for a moment. \"It does,\" he said. The soft tinkling of the lichen played on Iz’s ears. Below, the traffic murmured upwards like a gentle gust of wind.  \n\n\"But my fear changes nothing.\" \n\nIz's ears pressed back against her skull, her chest tightening at the raw honesty in his voice. For a moment, she forgot to be diplomatic—forgot to analyze, to assess. Instead, she felt. \n\n\"That is... remarkable,\" she murmured. \"To carry such weight and still move forward.\" Her tail curled around her thigh, a nervous tick of hers. \"We Iltheans—we have the luxury of time. We can afford patience, deliberation. But you...\" She trailed off, her blue eyes searching his face. \"You must build, love, strive, *live* \\- knowing how swiftly it will all be taken from you.\" \n\nA strange warmth bloomed in her chest—something between admiration and sorrow. She had spent so long fearing what humanity's reckless, downright predatory nature might mean for the galaxy. But now, faced with the quiet courage of this fleeting being, she wondered if she had misunderstood them entirely. Their pale moon, the Blue Mother, peered through the tall clouds above, as another gondola headed to the heavens above, raking upwards on thin wire. Her ears lifted slightly, a tentative softness in her gaze. \"Perhaps... that is why your people reached the stars so quickly. *You had to*.\" \n\n \n\n“That concerns you, does it not? That we had to *run* before we could *walk*?”  \n\nThose direct words pierced between Iz’s defenses. It took her effort to not tremble at the observant question. Though it went beyond that – she was not concerned, she was *terrified*. They all were. The galactic community, frail as it was, had not seen anything like this. Carnivory. A species, making leap after leap, without slowing down, no, accelerating as they went. That leapt from their moon to their solar system and beyond, before the Ilthean elders decided on their *name*. What drove these beings? \n\nThe concept of such… drive, such inexhaustible fervor, was alien to her in every sense—Ilthean philosophy spoke of cycles, of gradual growth, of the universe's infinite patience. But this? This seemed like *fire*. This was the desperate, clawing thought that time was not a river to wade through, but a wildfire to outrun. Before it choked you, and consumed you alive. *Running before walking*, she repeated in her head. \n\n \n\nThe Ilthean found herself on her legs, stepping close to the railing without thinking, her voice hushed against the rising air.  \n\n\"You are right,” she admitted, “to us… it is... terrifying. To all of us, all members of the First Accord.\" Her tail curled tight against her back. \"And yet—\" Her gaze flickered over his face, tracing the lines of his stoic expression. \"I think there is a kind of *beauty* in your struggle, isn't there? To know your limits so intimately, to rage against them even as you test them...\" \n\nFor the first time, she envied humans. Their urgency, their hunger—it was scary, yes, but also *vibrant*. Her gaze was drawn to the main avenue again, where another precession was moving past. Another grand poet was parading his works, evidently inspired by the grand, first-contact ceremony between their two races. It was moving slower than the clouds above, taking its own pace as Ilthean after Ilthean spoke to recite lines from the great work, joining and leaving the spoken word in a grand, alive chorus. If circumstances had been different, if her application as attaché had been rejected, she would have gladly been part of that beautiful thing. But… now it seemed almost trivial to her. She wondered how he viewed it. Would he even understand? A treacherous thought burned in her head. *Perhaps he was right not to.* Perhaps humanity was alive in a way her people had forgotten long ago. \n\n\"Tell me… your history… why…” The request was impulsive, undiplomatic—but she no longer cared. She needed to understand, “… why this *urgency*? That… burns, even against one another? Against *your own kin*? Did it have to be this way? On Ilthea, we have solved every problem, every disagreement, with *dialogue*, *thought* and *time* –“  \n\nShe cut herself off, realizing her sheer naivete. Iz knew this species did not have this luxury. Had not the *lush opulence* provided by good Ilthea. Did not have the calm ecological niches for them to rise with gradually, organically, in a warding harmony. Never could afford to trade *good enough* for *perfect*. Iz cursed herself silently, four ears fluttering in embarrassment. Though the human did not laugh at her – something she learned humans often subjected another to.  \n\n\"I suppose that… ambition was ingrained into us, from our early years. *Lowly mammals*, scrapping to survive. We took grand steps... some forwards, many backwards...\" he joined her on the railing. \n\nIz's claws flexed against the alloy as she absorbed his words. \"*Ambition*,\" she repeated softly. \"We have no true equivalent in our language. The closest term translates to... '*the reaching of roots toward water*.'\" Her ears flicked downward, a shadow passing over her expression. \"But yours is not so patient, is it? Yours would be a *clawing*.” The term sat heavy in her mind, so human in its implications—a species that clawed its way up from nothing, that refused to accept its place in the natural order. Iltheans were practically groomed to be their planet’s rulers. *Not so with humanity*, or so the Xenohistorians surmised: humanity’s rise from cradle to the stars was a painful affair. Some even referred to it as a *conquest*, though Iz revolted at the term.   \n\nShe exhaled slowly, \"You spoke of it all so... *casually*,\" she murmured. \"What you did, to… just survive.... for us, such thinking is—\" She hesitated, searching for the right word. \"*Unthinkable*. We evolved in abundance, in harmony.\" A strange tension coiled in her chest.  \n\n\"We did not,\" he commented neutrally, the way only a human could have. \"Mother Earth was not all kind to us. And for many of our ancestors, that… old night was cold and dark.\" \n\n*Cold and dark*. The words seemed in Iz’s chest like a weight. She had read the reports, of course—the reconstructions of Earth’s brutal ecosystems, the simulations of early human survival. But hearing it from him, so starkly, so *matter-of-factly*—it made something in her gut twist. She could not bear that thought, to see your own fellow being … cease to be, randomly, but with terrifying certainty. From the uncaring cold, or worse, from another Ilthean.  \n\n\"We knew your world was... *harsher* than ours,\" she admitted, her voice a whisper. \"But to hear you speak of it—\" She cut herself off. How could she even articulate the horror? The *wrongness* of it? Ilthea had never known true scarcity, true *predation*. She dropped the thought, but the human continued it. \n\n\"Our ancestors were wise, however. They saw the dark, and created *fire*,\" said the human, \"... they had to make fire - had to learn to *run*, first.” \n\nHer tail was restless. She had seen the reconstructed records of human history, the way their civilizations flickered and flared, some burning out too soon, others spreading like wildfire. It was nothing like the slow, steady glow of Ilthean progress. \n\nHer ears trembled nervously, as she struggled to reconcile this philosophy with everything she knew. \"So… you *ran*,\" she echoed, her voice hollow. \"While we... *walked*.\" The realization set in. All this time, her people had assumed humanity's rapid advancement was a sign of recklessness, of danger. Another attribute of a carnivorous species. But what if it was simply necessity? What if they had no other choice? \n\nShe eyed the Luminis Spire, that stood for a thousand years, having been perfected by each generation. And then she thought of human cities—built in decades, rebuilt in years, reinvented between Ilthean breaths. \n\n \"...We had never needed that … *fire* the way you did,\" she admitted softly. \"Perhaps, if things had been as hard for our ancestors, we would have been far across the universe by now…\" The words tasted bitter, heretical. To imply that Ilthean peace was anything less than *perfection* was unthinkable—and yet, here she was, thinking it. \n\n“But we are both here… with or without it…” he said, features settling in what Iz knew to be a relaxed expression.  She exhaled softly.\n\n\"Yes,\" she murmured, quieter now, less guarded. \"We are.\" \n\nFor a moment, she allowed herself to simply look at him—not as a predator, not as a potential threat, but as... a *person*. A being who had fought a different kind of battle than her people ever had. Body shaped for labor, for running in the most literal sense. For struggle and strife. For tracking and hunting in the heat of savannah or the biting frost. And yet, here they both stood, from worlds lightyears apart, beneath the same blue sky. \n\nShe tried to measure her tone. \"Did you believe our records? The pictures of Ilthea? Our history? Or did they seem… too good to be true to you?” \n\n“We did believe you, but me, personally? I still wanted to set foot on another planet, and see it with my own eyes. To do what my ancestors could only dream of. Grasp the stars…” he said, appendage tentatively raised to the gently blinking twin suns above, tiny shadows dancing on his face. \n\nHer chest tightened. She had never *yearned* for them the way he described. To them, the stars were simply... there. A part of Ilthea's harmony, not a challenge to be met. But the way he spoke—with such quiet reverence, such *awe*—it made something in her stir. A feeling she couldn't name. \n\n*Was he not angry?* The thoughts swirled in her head. To see what they had built without ever needing to *take* it? Grasping for the lights above with stubby digits, reaching it through struggle – then meeting those who never *reached*, who never *struggled*. But now, seeing themselves here on this other world, had they not achieved enough? A part of her wanted to tell him, directly. That they did not have to *run* anymore. But another part of her knew that he would not understand. And that must have been at the center of Iz’s fear.  \n\nPart of her recoiled at the idea—such waste, such chaos. But another part, small and traitorous, again thrilled at it. To be cold and hungry, having nothing… but wanting everything? The sheer audacity of a species that looked at the stars, reached out their hand and said: *‘Mine’*. \n\n\"We have records—ancient poems, carvings—of when we first reached the stars,\" she said softly. \"But for us, it was... inevitable. A natural progression.\" She hesitated, \"...but I see now that… for you, it was a *victory*.\" The word felt heavy, significant. \"Wasn't it?\" \n\nHe nodded, seemingly comforted at her words. \"It was a hard-fought victory. Against nature... against ourselves. It did not come easy to us.\"  \n\nThe implication hung in the air. For *you*, it was *easy*. For us, it was conquest. It was *war* \\- that peculiar term that terrified Iz. Her ears flattened, her tail curling tight against her back as if to shield herself from the very concept. She had studied it, of course—the reports, the simulations, the endless debates among Ilthean scholars about how a species could turn on itself with such violence, on such a scale, over and over again - If it even was possible. Doubts that were quickly washed away once first contact was established, and the humans sent all their records willingly. As if that had not been the most *profane* document Iz had ever seen with her long, blue eyes.  \n\n\"That fact…,\" she quivered, \"...the idea that your people could—that you did—\" She cut herself off, tail flexing against the railing. \"We have no equivalent. No framework to even understand it. And yet... you can speak of it as if it were just another step. Another tool. As if war was your nature…\" \n\nHis gravely voice was an odd tone now, almost… remorseful. \n\n\"It is, in a way. We were born in *war*. *Peace* was something we had to learn...\" \n\nIz went rigid, her fur bristling along her spine. *Born in war*. The phrase echoed in her skull, dark and primal. Her ears flattened against her skull. \"You... *invented* peace?\" The words tasted strange on her tongue. To her, peace was like air—ever-present, unquestioned. The thought of it being a *construct*, something fragile and hard-won... \n\n\"...We invited you here,\" she said slowly, \"because we feared what you might do if left unchecked.\" Her blue eyes locked onto his, and his were as a still sea, every word silently sinking beneath. \"But now I wonder if we should have feared what you might teach us instead.\" \n\nThe admission hung between them, charged. For the first time since his arrival, Iz was aware of the chasm between their cultures. The utter incomprehensibility of one side to the other. How not just their world, but her way of living was at risk. What if those ideas spread here too, just like on his Earth? Would it not burn Ilthean culture to ash?\n\n\"We figured as much, which is why we waited for you to invite us, rather than the other way around…” he said, his tone carefully measured. *He did not want to judge … but he was tense*, she thought.\n\n“Tell me, Iz… when your people saw into the dark, what did you think you would find? What was it you see?”\n\nShe followed his gaze upwards to the stars, her lower ears twitching as she considered the question. What were the stars? A constant, gentle presence. The backdrop of a beautiful, weaving still-life that included Ilthea.  \n\n\"When we look,\" she began softly, \"we see harmony. Patterns. The same cycles that govern our world, reflected in the heavens.\" she relaxed at the thought, \"Color, and vibrancy, life... and with each member of the First Accord that feeling only intensified… forgive me, but… silent? I do not understand.” \n\n \n\nThe human stiffened, almost painfully. \n\n“When we peeled our eyes skywards, it did not look this way to us...”\n\nIz could not stop herself.\n\n“You… feared it, didn’t you?” \n\n“I want to say that we respected it, but… you are probably right.”  \n\nA pause. Then, quieter, she complemented his thought. \n\n\"You saw them cold and dark... just like your home. Is that why you build your… *war-ships*?” she carefully asked. Iz realized that this was veering dangerously into topics the human might object to talk about, but something made her ask it anyway. It was a concept, so disturbing – so *paradoxical* to her. It was an oxymoron – two opposites, combined: spaceflight and progress together with barbarity and predation – the epitome of both peace, and *war*.  \n\n\"You embraced us, welcomed us, and you accepted us, and for that humanity is forever grateful,” his words become one with the murmur of Vaelith, the gentle swaying of the golden lichen, \"but...before first contact… it was for us as it was for our ancestors. We were alone, and the stars were cold and silent. Have you ever considered… *why*?”  \n\nHer claws flexed and she whispered \"But… to build those… *things*…” \n\n \n\n“How can I explain? There is an old saying…” the human seemed amused, a seemingly old memory flooding to him. “Speak softly… but carry a big stick.” \n\nHer ears shot upright, her tail puffing out in alarm before she could stop it. *A big stick*. The euphemism was almost playful, but the meaning beneath it was anything but. She had seen the reports and images —humanity's warships – blocky, stretched steel, rife with implements their scholars were still trying to identify. Rather… undignified compared to the carefully preened Ilthean vessels, but hard, enduring, and *teeming*. Their expansion had already surpassed the limits of the First Accord's charts, and still they ventured on without pause, like stones sinking into deep, black waters.\n\nTheir automated deterrence strategies. Machined intelligence – utterly taboo on Ilthea – whose purpose was only to preserve the human defensive lines in cold, unfeeling calculus. To her people, such things were monstrous. Unthinkable. \n\nThen, all at once, it clicked. Humanity hadn't reached the stars—they had conquered them, just as their world. From their caves, to continents, to the cosmos. They never stopped. Not just out of curiosity, but defiance, to keep that fire burning. The thought was equal parts awe-inspiring and terrifying. \n\n\"...Did your people ever... plan for us?\" The question was rife with danger, Iz knew as much, but she was more scared of the answer. \"Before first contact. Before all ceremonies, before all … this. Did you prepare for the possibility that we might be... a *threat*?\"  \n\nHe pressed his lips together, in thought for a moment.\n\n“…but you were kind to us,” the human said simply.   \n\nIz's breath caught in her throat as his words dug their way in, and the human beside her suddenly did not seem small at all. The implication was clear—humanity's grace was not inherent, but *chosen*. A deliberate restraint that could be *withdrawn*. The human was not a predator, but a *soldier*. A soldier in a war that had lasted millennia before her ancestors even dreamed of tools. A soldier that had *chosen* peace. Not because he couldn't do otherwise, but because he *hadn't needed to*. \n\nA terrible understanding dawned in her. Of course they had built their warships, their orbital platforms. They hadn't known the galaxy was filled with *herbivores*, with *pacifists*. Her breath came shallow now, her pulse racing. \"You did *war-game* us,\" she breathed, horrified. War-game. Another terrible, human oxymoron. \"You were running war games …before you even knew what we were. You had strategies. *Contingencies*.\" The thought was sickening. The stars above seemed suddenly colder, sharper—no longer just points of light, but targets. How many of them had humans already reached? *How many more would they claim?* \n\nShe swallowed hard. \"You are saying... your kindness now, your peace… is a *gift*. Not a nature. That your people could have come to us with fire and teeth, but instead... you came with open hands.\" \n\nThe realization was at once humbling and horrifying. All this time, the Iltheans had assumed their peaceful ways made them superior. But now? Now she wondered if they were simply *lucky* that humanity had decided to play by rules older than their civilization.  \n\nThe human did not say anything, still deliberating. The golden lichen softly chimed, and when it paused, Iz could only watch as the human slowly picked up her tablet, and expertly navigated her device with stubby digits. He paused the tablet’s recording with a swipe of his fingers. \n\n“You… you can read Ilthean?”  \n\n\"I had plenty of time to learn during my journey… but please, listen carefully. You should know that it goes deeper.” he again kept his voice steady, diplomatic, but a turbulent undercurrent remained.  \n\nIz listened with bated breath. \n\n\"After unification day, our scientists and weapon engineers never stopped working. There is an installation, within our inner asteroid belt. It is a weapon; the greatest humanity has ever built. Virtually undetectable, it harvests asteroids and refines them into ultra-dense munitions. It can launch them, at a considerable fraction of the speed of light. A kinetic artillery that can reach anywhere.”  \n\nIz's entire body went deathly still. Her ears pinned back so sharply it hurt, her fur standing on end as if charged with static. The glittering of the lichen seemed obscene in the silence. \n\nThough physics was not her strong suit, the calculations unfolded in her Ilthean mind with horrifying ease and clarity. Kinetic impulse of that relativistic scale could reduce cities to craters in the blink of an eye. Render entire biospheres uninhabitable – no, crack entire worlds in two. Ilthea had no defenses. Not even a plan. \n\n \n\nWhen she finally spoke, her voice didn't sound like her own—it was too raw, too small. \"You... you built a doomsday device while *pretending* at diplomacy?\" Her breath came in shallow gasps. \"Was this always your plan? To study us, learn our weaknesses, and then—\" \n\nShe cut herself off, trembling. The beautiful spires around them suddenly felt like targets. The open streets, like kill zones. Every Ilthean going about their day in blissful ignorance - playing music in the gardens, debating philosophy in the shade of thousand-year-old towers. Never suspecting that their new 'allies' had already aimed at them from the start. \n\n\"Why tell me this?\" she demanded, voice cracking. \"Is this a threat? A warning?\" The words tasted like bile. All her careful diplomacy, her attempts at understanding—had they ever mattered at all? \n\n\"No, Iz, you misunderstand. We did not build this weapon with **you** in mind.\" he said, words heavy, dragged out.  \n\n*Not for us.* \n\nThe human retrieved his own device, akin to her tablet, but bulkier and in black – an Ilthean would have refused to even gaze their eyes upon such a thing – but Iz was stunned and drank it in. \n\n“Watch.” \n\nThe black material came to life with a seemingly ancient recording. Humans were out and about, and their singular sun shone above white sand, not unlike the sands Iz remembered from their southern coast. The recording panned up, and revealed their large, cratered moon, which Iz had grown fond of from humanity’s depictions. All greater was her horror then, when a dash of white light struck its side, pieces visible in the blue sky for just a blink, and the feed cut to black. Iz stared at her own reflection in stunned silence. The screen turned on again, showing their blue marble, a dash of *red* – like a gaping wound - cut across its surface. Horrible pictures kept flooding the space, cities and bodies consumed by flame, and Iz had to look away to not throw up. \n\n“Our moon saved us that day,” he said, scratching his face-fur, “Their timing was off, by a few short *hours*. Mere Femtoradians with a cosmic scope, I’d imagine. Yet, *tens of millions* died, many more when the fragments rained down.”  \n\n“Wha-what was it? An-an asteroid, or?”  \n\n“A *missile*.” \n\n“Are you sure? Not… a wayward comet, or…?” \n\nThe question died halfway out of her mouth. Iz was unable to explain away what she saw. It had been so fast, she could count each frame in her head before the light sprang from moon to their planet. A mere second, if at all.\n\n“Too many heavy elements. Definitely artificial. Launched with *purpose*. It was what we would call a *kill-missile*.” \n\n“But… who, what kind of *monstrous*… mind would use this weaponry? Without reason – without even reaching out to…”  \n\nIz shuddered, struggling to grasp it all. The human spoke again. \n\n“So… yes, to us the stars were not something that seemed welcoming. The night was dark…”  \n\nIz could see it now, Ilthea in flames. Light from the heavens, burning bright for an instance, then forever extinguished, swallowed by the stars. The human’s voice kept her anchored. \n\n“…but, from our ancestors, we had *learned*… we knew what to do.” \n\n\"And you made your *fire*…” Iz completed his thought. “You... you think they will come back. *Finish the job*.” she whispered. \"Some… merciless *genocider*, amongst the dark? That erased world after world, keeping the universe silent?\" Her tail coiled tight around her leg, her entire body trembling. \"And, after realizing this, instead of hiding or praying… *your first instinct was to build a gun pointed at the dark*!?\" \n\nThe human nodded. \n\nA hysterical laugh bubbled up in her throat. All this time, the Iltheans had pitied humans for their short, violent lives. She shuddered. *What if they did come back?!* The galaxy suddenly felt vast and *hungry* in ways her civilization had never dared imagine. And this brief, brutal creature beside her? Had it deciphered the universe all along? Iz felt sick, and held onto the railing for dear life. *For humanity, it had never been about the Iltheans at all.* \n\nHer heart stopped as another terrible thought struck her. \"That weapon you built,\" she whispered. \"… it was… it *is* for *everyone* that would threaten you. Like your ships… your … machines. And… had we,” she bit her blue tongue, “… *been hostile* …that would have included *us*.\"  \n\nIt hung between them, unspoken. Iz finally understood the human saying. *Speak softly, but carry a big stick*… all their diplomacy, their cultural exchange—it was just the *preferred* option. Not the only one. Never the only one. All this time, her people had feared what humanity *was*—but they had never stopped to consider what it was that humanity *feared*. \n\n\"We're children,\" she breathed, staring at her shaking paws. \"Playing in a garden we never fathomed might be surrounded by… *bones*.\" The admission tasted like ash. All their art, their philosophy, their peace—how much of it was just luck? That some great evil had its back turned on them, for *a* *cosmic minute*? \n\n\"… you had it all planned, hadn’t you? How to erase our population centers. How to decipher our communications, how to coordinate… *interstellar war* beyond what we could comprehend. Against all members of the First Accord... you thought… *we* were that threat at first, didn’t you?” \n\nHis gaze was tired, and his voice was with a tone that Iz thought resembled ... remorse. \"Iz… by now, you know the answer, don’t you? We had been drilling endlessly for such an event. Not just a rod in the dark. A *true* first contact. Bunkers, evacuation plans, early warning satellites, scattered throughout systems, all were at the ready. The *rods* were in their silos. We always expected to be struck first... so we waited for your move. And waited, until you contacted us in our own language. And… you had made... **songs** for us. We had not expected this. We hadn't even planned for it... frankly, we did not know what to do.\" \n\nHer people had spent centuries observing Earth, debating the ethics of contact, carefully crafting their approach over decades. All that time, humanity had been *hunkered down*, fingers on triggers, staring at the stars like sentries waiting for an ambush. While her people had spent millennia composing symphonies to the dark above, they had been preparing to *fight* it. Or, at least, *take it down with them*. \n\n\"You... you thought first contact would be *gunfire*,\" she choked out, nodding, her ears trembling. \"Of course… since you think the natural state of the universe is *war*.\" Her claws scraped, leaving faint marks against the alloy.  \n\n“It sure seems that way to us.” \n\nIz knew not what to answer. \n\n\"And when we came speaking of peace, you must have thought it was a *trick.* A trick of those who had hurt you...\" \n\nShe looked up at the human, who was scanning the procession down below with curious eyes. \"We thought we were civilizing you,\" she admitted. He met her gaze, sympathetic.\n\n“Sorry to say… but, we could tell…” a chuckle rang from this throat. How could he still be so calm? Her doubts were so clear now. Their peaceful utopia – had it really been a *fluke*? A temporary bubble in a cosmos that rewarded that exact, human blend of paranoid, pragmatic violence and intellect? \n\n\"You... you lived like that? Waiting to be struck, again? Preparing to *burn the sky* in response?\" The concept was unthinkable. No Ilthean could function under such existential dread—they'd wither from the stress alone. Yet here the human stood. Not just functioning, but *thriving*. Building. Exploring. Even now, this one spoke with grim clarity rather than madness. \n\nThe calculations raced in Iz’s mind, and the severity of it all took hold: The wider galaxy *was* silent. Suspiciously so. The thought was revolting, but… what if someone really was *perpetuating* that silence, with those unthinkable terror-weapons? Her people and the First Accord had called the silence of the cosmos serenity. Humans saw the same and called it a *warning*, then a *danger*. And yet, even with tireless searching, there could always be a world left unturned, harboring what nightmares dwell in human minds. Iz understood then. For their own survival, humanity couldn’t stop *burning*. The twin suns cast her two shadows long and trembling across the ground. \n\n\"Do you understand what you're telling me?\" she whispered. \"That your entire species has been holding its breath, waiting for the galaxy to show its teeth once more?\" Her tail lashed violently. \"And instead of that... you got *us*.\" \n\n\"It is funny how the universe works sometimes, isn't it?\" the human gave, smiling wearily, \"But we are relieved that we discovered you, instead of the others...\" \n\nThe casual way he acknowledged *that what dared called itself an intelligence* made her stomachs churn. The greatest horror the Ilthean mind could conceive had been a *slightly aggressive trade negotiation* up until an hour or so. \n\nShe rose slowly on unsteady legs, her fur still partially bristled. \"You are relieved,\" she repeated.\n\n“I am. We *all* were.” \n\nThe garden was quiet for a moment. \n\n\"We have no defenses,\" she admitted. \"No plans. No contingencies. If the galaxy is as dangerous as you fear... if it came for us… we would not survive.\" The admission tasted bitter.  \n\n\"But you would. Your ... '*big stick'* would save you.\"\n\n\"Humanity's history taught us the fine difference between peaceful and harmless…” the human worded carefully, measured, to not cause much offense in Iz, at least that was how it seemed to her. It stung anyway.\n\n\"You're saying...that my people are the latter.\" The realization felt like frost. \"That we built this … harmless paradise because we never had to *fight* for it. Because nothing tried to *take it from us*…\" Iz's ears drooped. *Peaceful, not harmless*. The distinction cut deeper than any claw could. \n\n“Your people never needed to learn,” he tried to put her at ease.  \n\n*And perhaps that has doomed us*, Iz mused.  \n\nShe simply stared at Vaelith's shimmering spires—so pristine, so *fragile*. They lasted a thousand years because no one had ever *tested* them. No predators in the dark night. No rods from gods. Just... peace. *Taken for granted*. \n\nA humorless laugh escaped her. \"And now here you are,\" she murmured, \"holding our innocence at gunpoint just by *existing*. You don't even have to *do* anything. The moment I grasped what you were, saw what you showed me… it seemed like the galaxy stopped being the one I knew...\" \n\n\"...We need to talk to your leaders,\" she said abruptly, straightening her posture with visible effort. \"*Properly*. No more diplomatic dances. Because if the universe is as dark as you believe... we need this... *fire* of yours, more than ever…“ \n\nFor the first time since his arrival, Iz didn't look nervous around the human. She looked afraid of everything else. The human straightened his back, and the metal on his chest reflected golden in the suns. \n\n“I agree. Together, our chances are greater – we would be honored to teach you.\" \n\nIz's tail uncoiled from around her leg as she studied the human's face for any hint of deception. Finding none, she felt a tinge of warmth.\n\n\"*...Honored*?\" she repeated softly, her voice trembling with cautious wonder. \"After everything you've just told me, after knowing what we are—*soft, slow, unprepared*—you would still call it an honor? Not a *drag*?\" \n\nA strange emotion flickered in her. Not fear, not awe—something closer to hope. Humanity had clawed its way to the stars with bloodied hands, yes... but they were offering to extend those same hands to lift her people up, not strike them down. She reached out hesitantly, her clawed paws against the railing near his hand—not touching, but close enough to feel the warmth radiating from his skin. \"Then teach us,\" she whispered. \"... how to face this ... dark.\" \n\n“We will,” the human agreed with no second-guessing, “and Iz… once our people are ready…”  \n\nThe human’s face now was steeled with a steadfastness that Iz would have shuddered at before, but made her chest tighten with resolve now.\n\n“…we will find whoever cast that rod. If it takes *centuries*. If it takes *millennia*. But we will find them. And perhaps then, both of us can teach them the distinction between *peaceful* and *harmless*.”  \n\nIz found herself gripped by the image and clutched that comfort as her gaze drifted to the stars—no longer just beautiful, but watchful. Cold and dark. In truth, she was terrified at their newly made meaning. But beside her, the human stood, unmoved by all this, surely and steadily planning in his mind. \n\n\\---\n\nedit: formatting, spelling",
                "comments": [
                    {
                        "author": "Different-Money6102",
                        "comment": "OK, just...WOW.  It's great as a one-shot.  It could be better as a series, but then, I personally would be afraid I'd ruin it.  I hope you are braver than I am.",
                        "published_at": 1748047123.0,
                        "likes": 86,
                        "subcomments": [
                            {
                                "author": "KazakiriKaoru",
                                "comment": "Yep, I think it would be better to be left as-is. \n\nMaking this into a series would ruin the beauty of the slow pace. The entire short feels like it was purposely written to be slow, from the perspective of Iz's race. Not to mention that it would just devolve into another war story.",
                                "published_at": 1748049822.0,
                                "likes": 49
                            },
                            {
                                "author": "Edge_Anonymous",
                                "comment": "Thank you kindly. And yes, I would be lying if I said there hadn't been more (there was, and sadly it had to go so it could all fit in one post) - but the essence is all here. Maybe the rest will find its way here, some other way?",
                                "published_at": 1748083781.0,
                                "likes": 25
                            }
                        ]
                    },
                    {
                        "author": "MechisX",
                        "comment": "This \\^\\^\\^. This right here. \n\nThis is HFY in a nutshell. \n\nNot crazy super tough death world beings, not super soldiers who can take down anything, not insane beings who breath and drink things that a are pure poison to them.\n\nJust another being forged under conditions that no one understands until it is explained.\n\nWe are humans, we pair bond with almost anything.\n\nWe love with all our hearts and when we hate it is with our complete being.\n\nAnd neither heaven or hell can stand against us if we feel you have threatened us or those we call friends.\n\nSpeak softly and carry a big stick.",
                        "published_at": 1748065466.0,
                        "likes": 83,
                        "subcomments": [
                            {
                                "author": "Edge_Anonymous",
                                "comment": "Taken straight from my thoughts, exactly! Phenomenal!",
                                "published_at": 1748083890.0,
                                "likes": 21
                            }
                        ]
                    },
                    {
                        "author": "Original_Memory6188",
                        "comment": ">the distinction between *peaceful* and *harmless*.”  \n\nYes.  Excellent writing, story building.  \"Moar!\"",
                        "published_at": 1748048411.0,
                        "likes": 54,
                        "subcomments": [
                            {
                                "author": "Edge_Anonymous",
                                "comment": "Thank you - I have some ideas still, we'll see where it goes.",
                                "published_at": 1748084663.0,
                                "likes": 23
                            }
                        ]
                    },
                    {
                        "author": "Amadan_Na-Briona",
                        "comment": "Loved this story. Very well written & does a good job of contrasting the differing views of the aliens vs humans – and logical reasons why they exist.",
                        "published_at": 1748047507.0,
                        "likes": 44,
                        "subcomments": [
                            {
                                "author": "KazakiriKaoru",
                                "comment": "Also, the entire story was slow-paced, so carefree and slow, written from the perspective of Iz's race.",
                                "published_at": 1748049969.0,
                                "likes": 37
                            },
                            {
                                "author": "Edge_Anonymous",
                                "comment": "Thank you so much for the kind words.",
                                "published_at": 1748083999.0,
                                "likes": 16
                            }
                        ]
                    },
                    {
                        "author": "Fontaigne",
                        "comment": "Phenomenal.  \n\n!n",
                        "published_at": 1748051054.0,
                        "likes": 30,
                        "subcomments": [
                            {
                                "author": "Kafrizel",
                                "comment": "Does that still work for nominations?",
                                "published_at": 1748056582.0,
                                "likes": 9
                            },
                            {
                                "author": "Legendendread",
                                "comment": "!n",
                                "published_at": 1748508556.0,
                                "likes": 2
                            }
                        ]
                    },
                    {
                        "author": "UmieWarboss",
                        "comment": "These elf monkeys are under our protection now. Lay one finger on them and learn just how big our stick is",
                        "published_at": 1748088925.0,
                        "likes": 27,
                        "subcomments": [
                            {
                                "author": "redbikemaster",
                                "comment": "Yep they've been adopted. We are now their big stick ",
                                "published_at": 1748115032.0,
                                "likes": 15
                            }
                        ]
                    },
                    {
                        "author": "Kafrizel",
                        "comment": "Hooooo boy. I have no notes. This was EXCELLENT and bah gawd i want to see the aftermath of it all. Fuck yeah.\n\nEdit:\n\nThis is fantastic as a oneshot.",
                        "published_at": 1748056513.0,
                        "likes": 17,
                        "subcomments": [
                            {
                                "author": "Edge_Anonymous",
                                "comment": "Perhaps we shall meet the cosmic genocider one day...",
                                "published_at": 1748083925.0,
                                "likes": 13
                            }
                        ]
                    },
                    {
                        "author": "Key_Reveal976",
                        "comment": "Really good!",
                        "published_at": 1748047408.0,
                        "likes": 14,
                        "subcomments": []
                    },
                    {
                        "author": "Dick_Knubbler666",
                        "comment": "Damn, that was a good read!",
                        "published_at": 1748051415.0,
                        "likes": 10,
                        "subcomments": []
                    },
                    {
                        "author": "Stomp_Water_Rat",
                        "comment": "Wow, what an amazing story.  This is one of the best I've come across.  THANK YOU!",
                        "published_at": 1748052823.0,
                        "likes": 10,
                        "subcomments": []
                    }
                ],
                "shares": 0
            },
            {
                "title": "An Introduction to Terran Zoology - Chapter 46",
                "url": "https://www.reddit.com/r/NatureofPredators/comments/1h5yeov/an_introduction_to_terran_zoology_chapter_46/",
                "score": 479,
                "comments_count": 113,
                "author": "Still_Performance_39",
                "created_utc": 1733260560.0,
                "selftext": "Thank you to u/SpacePaladin15 for the NOP Universe.\n\nHey all, hope you’re well. It’s time for a Kailo chapter and a look into why he let the tarantula out. We also have a new animal which I hope you’ll like!\n\nThank you to u/cruisingNW and u/Eager_Question for all your help with this chapter!\n\nThe link further down the chapter links to artwork by LIFE with MOTH’s twitter page. I’m honestly not sure if it’s a person or a company, but the art’s great!\n\n[\\[First\\]](https://www.reddit.com/r/NatureofPredators/comments/11sf8jb/nop_fanfic_an_introduction_to_terran_zoology/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) [\\[Previous\\]](https://www.reddit.com/r/NatureofPredators/comments/1gpqxz1/an_introduction_to_terran_zoology_chapter_45/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) [\\[Next\\]](https://www.reddit.com/r/NatureofPredators/comments/1hgn0bq/an_introduction_to_terran_zoology_chapter_47/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\n**Memory transcription subject: Kailo, Venlil Exterminator**\n\n**Date \\[standardised human time\\]: 12th September 2136**\n\n*“Stupid, stupid, stupid, that was so dumb! Agh! Why did I do that?! Brahk!”*\n\nI cursed at myself as I ducked and wove around my classmates' coats and the clustered exhibits; albeit at a hushed and *hopefully* inaudible volume. The last thing I wanted to do was draw attention to myself. I’d only *just* avoided Rysel by a hair's breadth for the second time after first distracting him with the Chinchilla.\n\n*I don’t think he noticed me. He seemed pretty focused on the animal, plus the Doctor was with him so he was probably talking… with… him…*\n\n***OH SPEH!*** *What if he tells the Doctor?!* ***BRHAK!***\n\nPanic stabbed my chest and the room started to blur around me, fear of being kicked out of the exchange immediately drowning my mind in a despairing tide. The Doctor hadn’t expelled me from the classes over my behaviour so far, but this was different. In a brazen display of sheer idiocy I’d let one of the specimens loose, a predatory arachnid of all things. Not only that, but it’d gotten free in a room full of venlil, most of whom were likely barely hanging on to their sanity due to being surrounded by strange creatures; creatures that they knew *might* be predators.\n\n*If someone had seen the spider they might have panicked and caused a stampede. It would’ve been all my fault!*\n\nFlashes of the hall in ruin zipped through my mind, toppled cages and smashed tanks scattered across the floor; their inhabitants spilling out and racing every which way in search of shelter, a perch, or even prey. The imagined cacophony of scared bleating venlil rang in my ears, running over anyone in their path in blind terror as they tried to flee from the chaos I’d unintentionally wrought.\n\n*…I feel sick.*\n\nDazed, I awkwardly fumbled my way to a bench between two enclosures and sat down, gulping in as much air as my lungs could hold before letting it out in a forced exhale in an effort to get my nerves under control. As my heart rate started to level out, the sense of impending dread began to fade away; though it was swiftly replaced by a wash of shame.\n\n*I’m an exterminator. I’m supposed to keep the herd* ***safe***\\*. And what do\\* ***I*** *do? Let myself be spehing goaded into letting a predator out of its cage just to prove that I could handle it?! I’m a brahking idiot! And so’s the brahking idiot who brahking brought it up in the first place!*\n\n“Hey Kailo, how’re you doing?”\n\n*Speak of the Night!*\n\nThe scruffy white wooled form of Lokki materialized almost out of nowhere beside me, his ears swaying in slight concern as he moved to sit beside me. Without even thinking about it I recoiled from him, shuffling further down the bench as anger drowned out any momentary regret I’d felt.\n\n*“How am I doing?!”* I spat back in a barely restrained whisper, the stress of someone overhearing me managing to quell what would otherwise have been a shout, *“How do you think I’m doing?! You disappeared the moment the spider got out!”*\n\nLokki gawked at me, his ears shooting up as his jaw fell open in stupefied disbelief, the accusation leaving my usually witty classmate at a complete loss for words, “You- Wait… **what?!**”\n\n“You heard me! It got out and you ran off. Gah! I shouldn’t have listened to you!”\n\nThat managed to jar Lokki out of his funk, my condemnation snapping him back from confused alarm to an indigent frown, “What do you mean listen to me? ***I*** sure as Night didn’t tell you to let that thing out of its tank!”\n\nI scoffed back, tail thumping angrily off the benches legs, “Yes you did! You said *‘Bet you couldn’t handle that crawling in your wool.’*, you *literally* dared me to do it!”\n\nLokki flung his arms wide, almost knocking into a passing human, while his eyes bulged exasperatedly, “Uh, Kailo. I. Was. **Joking!** You know what a joke is? It’s a thing you say in jest, because you don’t really mean it!”\n\nHis defense hit me like a ton of bricks, my mind reeling as it rapidly rewatched the memory of our interaction until just before I’d unlatched the tank. He’d been laughing it up, making quips about the animals we passed by, and assuming some outrageous things about them as well. In other words, he’d been acting the same as he always was; making jokes. \n\n*Oh my- Kailo you woolhead! Of course this idiot was only joking.* ***AGH!*** \n\n“Wha- Well how was I supposed to know that?! You’re always joking around so I never know when you’re being serious or not!” I snapped back furiously as my tail lashed behind me. In a huff I crossed my arms and turned away from Lokki, trying to disguise the bloom that was beginning to burn its way across my snout at record speed.\n\nLokki groaned in response, snout falling into his paws with a soft thump while his ears twirled incredulously, “Uggghhh… Common sense, Kailo. Some Tenets-taught common sense.”\n\nAfter our *exchange* we both sat in silence for a bit, stewing uncomfortably in the quiet that followed our spat. Our classmates and the occasional human happily milled about the nearby exhibits, a stark contrast to the air of aggravation permeating the space between Lokki and I. \n\nIt wasn’t difficult to guess how Lokki might be feeling, probably being pretty annoyed with me for blaming him for my own stupidity. As for me, I was just acting like a prideful fool who couldn’t swallow his ego long enough to simply apologise for lashing out.\n\n*Gah! For Inatala’s sake. Have I learned spehing nothing?!*\n\nMy scolding self-scrutinising thoughts were abruptly interrupted as Lokki broke the silence between us with a sigh, all while an abashed twirl made its way through his tail, “Huuu… Alright, look. I’m sorry Kailo. I shouldn’t have joked about that.”\n\n*…what?*\n\nTaken completely by surprise, all I could do was blink back at him in wall-eyed shock; utterly stunned by Lokki’s out-of-the-blue apology. Before I had a moment to process what he’d said, my reply came tumbling out of my mouth, burdened by my own guilty conscience and a fairly substantial amount of frustration at myself on Lokki’s behalf.\n\n“Wha-? No! No, no, you don’t need to apologise for anything! I’m the one who let it out. I’m the one who did something so woolheaded because I wanted to prove something!”\n\nLokki shook his ears dismissively, “No see, that’s the point. You said it yourself ages ago. You’re an exterminator who came here with the intent to learn stuff to protect people. Basically, and please don’t take offense to this, you’re high strung. I should’ve been more considerate and not joked about something that you might take as a challen-”\n\n**“Speh to your consideration! I was the one in the wrong. That’s all there is to it. That’s that!”**\n\nA few ears twisted my way as they caught my less-than-hushed repudiation of Lokki’s completely unreasonable accommodations for my blistering dimwittedness. A swift glare was all it took to turn curious ears away, though Lokki’s were firmly dialled in on me and spiraling in alarm. In spite of this however, I noticed that an unexpected mischievous wiggle had begun to creep along his tail in a way that was all too similar to how a human would start to grin after being caught while attempting to to tease someone or otherwise joke around.\n\nIt was in that moment, as his tail began to wag into a full fledged merry blur, that I realised I’d been fooled yet again! The look of fury on my face as it all clicked into place was enough for Lokki to drop his facade, wrapping an arm around my shoulder and pulling me to his side as a controlled chortle swelled into a hearty belly laugh.\n\n“**Hahaha!** I’m sorry Kailo, for real this time I swear.”\n\nOutraged by the deception, I tried to wriggle free from his paw but to no avail, his arm holding firm with shocking strength in spite of how slim he was, “I don’t give a damn about your apology! Why do I keep getting tricked into saying sorry?!”\n\nLokki whistled merrily, thankfully letting me go as he finally noticed my escape attempts, “Honestly? Personally, I think it’s because you’re a pretty earnest guy at heart but you keep it under wraps most of the time. Some people, like yours truly, notice these things and can’t resist giving you a poke so that you’re honest with yourself from time to time. Yeah it’s a bit of a dick move, and for that I *am* sorry, but hey, it got you to open up didn’t it?”\n\nA harsh chuff escaped my snout as the wool along the back of my neck bristled, frustration over his duplicitous methods at odds with my own feelings of disappointment as it sank in that Lokki was infuriatingly correct. I *had* wanted to apologise, but my burned ego chained down any thoughts of giving my regret a voice. It was the same ego that had made it a near impossibility to say sorry to Dr MacEwan until he’d provoked me into letting my apology rage forth. The same ego that had caused me to butt heads with Rysel on so many occasions during our time here.\n\nThe same ego that had caused me to argue with my parents about coming to the exchange in the first place, which ended up in me not having had a proper phone or video call with them since I got here; though that would finally be fixed later this paw.\n\n*I’m glad I talked to Roisin about that. There’s nobody like a Doctor to tell you what you need to do to help yourself get better, hehe.*\n\nWith a heavy resigned sigh that released every taut knot of tension across my body, I turned an eye to Lokki, the class jokester's ears still twirling mirthfully as he waited for my reaction, “Heeew… alright, fine. I accept your apology. For the trick, not the joking speh! …And I’m sorry too.”\n\nLokki’s ears spun delightedly, clearly very pleased with himself over how this had gone; but I wasn’t going to let him slide by that easily.\n\n*Time for a* ***joke*** *of my own.*\n\n“But if you provoke me like that again then I’ll not forgive so easily next time,” I gestured a paw in a large sweeping motion from the top of my head to my lower paws, “This wool-cuts commonly called the Exterminator Cut. Mess with me like that one more time and I’ll shear yours even shorter!”\n\nWhile I did try to stare him down with my most fiery glare, forced as it might have been, my *threat* seemed to only embolden the merry jokester, his jaw dropping in over dramatised shock despite his tail flapping in energetic amusement, “No! Say it isn’t so?! How could you be so cruel as to threaten my lovely coat.”\n\nHe resumed his gleeful whistling as he stood from the bench, flicking an ear in invitation to stand with him while he caught his breath after the brief giggle fit, “Heeeheee! I’ll remember that Kailo, honest. But hey, speaking of wool, have you been to the rest of the insect exhibit yet?”\n\nI waved an ear back in the negative, curiosity taking the place of the hurricane of raging emotions that’d now fallen silent.\n\nBizarrely, my answer caused Lokki to bounce on the spot excitedly, his tail spinning ever faster as he started walking off in the direction of the insect enclosures, “Awesome! You’re in for a treat! These things are so cool and they’re even fluffier than the Chinchilla that Rysel’s going pup-eyed over!”\n\nWith that he took off and disappeared around the nearest stack of tanks, my piqued interest compelling me to chase after him to see what animal could possibly be so intriguing as to make anyone else in our class act like our resident animal lover.\n\nTailing close behind Lokki, my curiosity rose even higher as my ears caught an enamoured squee from where he’d stopped a few tails ahead of me, and he wasn’t the only one there. Standing next to an enormous wire and glass enclosure was a human man - Victor I think his name was - and the familiar fluffy grey coat of Solenk. It was immediately obvious that the high pitched squeal had come directly from the latter of the two, as Solenk appeared to be buzzing ecstatically as he cradled the largest bug I had ever seen in his arms; almost as long and at least half as wide as the torso of the venlil holding it.\n\n*Is that even a bug? What in Inatala’s name is this thing? Wait, I’ve seen that before. Is that a-*\n\n“Hey there! Are you two interested in the [Titan Moths](https://x.com/life_with_moth/status/1741103044715311288)?”\n\nViktor confirmed my suspicions unprompted, though his answer only gave rise to further questions. I’d heard of and seen pictures of moths before, the first being the Rosy Maple moths the Doctor had shown us in our earliest lessons, but none of them had been anywhere close to this size!\n\nMy ears fell to either side of my head in gobsmacked astonishment, an expression that was quickly picked up by Lokki, currently stroking another moth sitting on the edge of the enclosure's gate, “I know, right?! They’re amazing. Solenk can’t take his paws off them.”\n\n“What can I say? I love bugs, sue me.” Solenk replied in mock affront, ears wiggling in unabated enjoyment as the moth in his arms bapped his snout with its forelegs, pulling a giggle from him, “Hehe, you’re a curious one aren’t you. Can you believe this, guys? Could you *ever* have imagined handling animals like this before we came here?”\n\nLokki shook his ears indifferently, not taking his eye off the moth that’d stolen his attention, “Yeah not a chance. Observe from a distance? Sure. Make a closer inspection of sites they frequent when they’re not around? Yup. But cuddle them like you’re doing? Ha! As if.”\n\n“Oh, that’s rather sad to hear,” Viktor piped up, sadness flashing across his face as he ruffled the fluff on the back of the Titan Moth Solenk was holding, “I know how you feel about *some* animals, but I kinda assumed you’d be closer with the ones you consider safe. You know, like a pet?”\n\nHis remark drew the eyes of Solenk, Lokki, and myself away from the poofy insects and squarely onto Viktor with confused ear flicks; though I wasn’t totally unaware of the term myself. Roisin had let it slip a while back but hadn’t gone into much detail, choosing to keep silent on the topic until Doctor MacEwan brought it up in one of his lectures. I’d also seen it mentioned on several of the info-screens at some of the exhibits. The idea of keeping an animal as a companion in your home was incredibly alien to me. So much so, that I would’ve dismissed it out of paw if it came from anyone other than the already strange humans who’d defied all concepts of normality for as long as they’d been on the galactic stage.\n\nViktor soon clued into our bewildered stares, swiftly backpedalling as worry strung itself to his voice, “I uh- Nevermind um… If the Doc hasn’t told you about that yet then it’s uh, probably best I leave that for now. Anyway! Do you have any questions about these guys? They’re pretty fascinating.”\n\nEager to pivot us back to the moths, Viktor waved a hand at the display beneath their enclosure; inviting the three of us to learn about the massive insects. Lokki and I were able to fit around it quite comfortably though Solenk, still supporting the moth against his chest as it tried to crawl up his body, awkwardly shimmied his way between us. With the three of us settled, Viktor began to steadily tap his way through the screen, giving us plenty of time to read each page.\n\n***“The Titan Moth, an insect birthed by an amalgamation of the natural world and human science. That’s right dear reader, the Titan Moth is not a naturally occurring species. Rather it is the brainchild of one Doctor Frank Tazza who in the mid-2050’s, taken over by what he referred to as a “Vision of Greatness”, sought to use advancements in genetic sciences to create a creature that until now had only ever existed in the realms of imagination. Through a combination of selective breeding and genetic engineering, Doctor Tazza slowly increased the size of his experimental moths over successive generations; aiming to make the moths as large and as fluffy as they appear before you today.”***\n\n*By Inatala…*\n\nMy head began to spin as I reached the end of the first paragraph of text. The nonchalant way the writer had simply explained how a human scientist had just *created* a brand new species in the same way an artist would be struck by the inclination to paint was mind boggling!\n\n“You’re kidding,” Lokki spoke softly, eyes wide in disbelief while his tail lolled aimlessly behind him, “You just made a new species?”\n\n“Why though?” Solenk tacked on, one eye on Viktor while the other kept the moth in view while a hint of uncertainty flickered across his ears, a slight accusatory bite worming into his tone as he pushed for more information,  “Is that something humans just do because they feel like it? Put different genetic sequences together to see what happens?”\n\nI was still too lost in my thoughts to vocalise my own feelings on the matter, but I wanted to hear Viktor answer just as much as Lokki and Solenk did. The idea that a human had gone in and messed around with the DNA of another living being just to make it bigger and fluffier, traits I *knew* humans liked, seemed appalling on its surface.\n\nViktors tight-lipped grimace in response to the questioning didn’t alleviate my worries one bit. Instead of any defense he just pointed back at the info-screen, “Keep reading, you’ll find a few answers there.”\n\nAfter a shared glance the three of us did as he asked, peering back at the display with increased interest in the backstory of these creatures.\n\n***“Dr. Tazza’s efforts were not without consequences however. The study of genetic mechanisms had been practiced for some time and technological advancements made it possible for private citizens to do their own work. Consequently however, this led to an explosion of reprehensible projects. Smaller practices, like those of Dr. Tazza, saw many failures on both the practical and, more importantly, ethical level.*** \n\n***To tamper with the building blocks of a living organism is taboo for good reason.*** \n\n***It is one thing to use similar gene-altering techniques to correct genetic deficiencies and prevent or cure genetic diseases. It is something else entirely to create a hybrid for no other reason than you feel like seeing if you can. While such research was not outside the purview of established scientific norms of the day, Dr Tazza skirted around numerous ethics boards in his efforts. This led to shortcuts in his work which left early generations of the moths suffering from deformities brought on by rushed experimentation. After his failings were uncovered, it was decided that the project would continue under stricter guidelines. Rather than release the moths into the wild, where they could endanger themselves and local ecosystems, they were relocated to suitable accommodation for continued observation and treatment to overcome the defects they suffered from. Today they live solely in captivity, housed in several dozen manmade colonies across the world, unburdened by the issues that afflicted their early ancestors. Widely beloved for their cute appearance and gentle temperament, they have found a place in the world despite the struggles they once faced.”***\n\n*Whoa. I didn’t expect that. Especially after how it started so positively.*\n\nIt was safe to say I was pretty stunned by the whole thing. As upfront and aloof as I’d found the first part, the second hit hard with a criticism of apparent recklessness by the scientist who was responsible for the moth's creation, followed by a brief retelling of efforts to make up for his failings; though there was one thing in particular which still nagged at the back of my mind.\n\nI managed to find my voice before the others this time around, a question already primed on my lips the instant Viktor and my eyes met, “What happened to the Doctor?”\n\nLokki and Solenk looked up at Viktor expectantly, perhaps thinking the exact same thing as me. The text had only said he was found out and not that he’d personally faced consequences for what he’d done. The entire thing made my skin crawl. The concept of tweaking the genes of a species to change it to suit your preferences was uncomfortable to think about. Even the usual thoughts I had on how I could use such information to protect the herd against predators fell silent, any whisper of a thought suffocated by the mental image of a mutated Shadestalker driven mad by careless experimentation.\n\n*Nuh-uh. Nope, nope, nope. Don’t want to think about that. Let’s just hear Viktor out for now.*\n\nThe frown Viktor had sported earlier turned into a weary smile, coupled with an equally tired nod, “Good question. Short and simple answer, he got in a huge amount of trouble to start with. Licences were revoked, he was barred from a number of scientific circles both professionally and personally, and he became pretty infamous in the news for a while as well. Then the actual legality of what he’d done was brought up and it turned into a huge mess. I’m talking about a colossal landfill fire style of mess. The scientific community had practically done away with him because of the ethical dilemmas on the issue but that didn’t necessarily mean he’d done anything wrong in the eyes of the law. A lot of people thought what he did was verging on criminality but others thought it was just an ethics issue with no actual laws being broken. Then a bunch of international agencies got involved, because *someone* had to step up and deal with a completely new species of insect that was currently packed into his lab, sparking *another* ethical debate about what to do with them. Ultimately he was brought in to assist those agencies, under *strict* supervision of course, because he knew the most about the moths. As soon as they learned everything he knew they tossed him back into the legal drama he’d caused for himself. He kind of faded into obscurity after that so I don't know what happened to him in the end. He’s likely dead now though, he was in his mid-forties when this all went down, and that was eighty years ago.”\n\nI stared at Viktor in dumbfounded silence, his avalanche of a *short* explanation making it difficult to decide what to comment on first. Lokki didn’t suffer from this same issue, bleating out a laugh a heartbeat after Viktor had stopped talking.\n\n“That’s your short and simple answer? By the Tenet’s, I think I’ve read more concise summaries of how to make antimatter!”\n\nLokki’s joke helped shuffle the lingering discomfort off of my shoulders, his antics managing to incite a chuckle in Solenk and Viktor as well, all while he resumed petting one of the moths that was still hanging around the edge of its enclosure.\n\n“I know right? You could’ve just said he got fired.” Solenk piled on with a cheeky sway of the tail, taking a moment to gently pet the moth that continued to cling to his chest, “I’m glad though. Not that they went through that, Stars no! Just that they got a better life in the end.”\n\nI watched the both of them handling their respective moths, a sensation of want tugging at my chest as I wondered just how soft the fur of the cloud like insects must be. I clearly wasn’t hiding my feelings too well though, as Viktor suddenly waved a hand to grab my attention before gesturing at the cage.\n\n“You uh, you want to hold one? They’re pretty calm and inquisitive little guys.”\n\n*Little?! Is he serious? They're almost as big as the pups at the orphanage!*\n\nI kept that thought to myself as I nodded back at Viktor and took a step closer; though it still made itself known through an amused ear flap. With a wide toothy grin Viktor leaned past Lokki and his moth, reaching into the enclosure to pick up another moth that was splayed out across the ground in peaceful relaxation. It wiggled a bit as it was moved but didn’t object to being disturbed. I readied myself as he walked over to me, preparing to support a significant weight against my torso as Viktor steadily lowered the moth into my waiting arms. Shockingly however, the moth was far lighter than its enormous puffy bulk would suggest.\n\nOnce it was safely secured against me I glanced down at it, meeting the gaze of its bulbous black eyes as I slowly lifted a paw to properly pet its fluff covered back. The moth beat me to the strayu though, the curiosity Viktor promised immediately getting to work as it wriggled up closer to my snout, fore legs tapping away at my upper chest and jaw line while its head seemed to twist and turn like it was inspecting me from every angle it could get to.\n\nI tried to keep my cool as the insect attempted to scale me further, but it was *extremely* difficult. Every move of its furry legs tickled me while its adorably enthusiastic exploration of the new thing in front of it warmed my heart in a way that completely blindsided me. At one point it even extended a freakishly long tongue that made the wool along the back of my neck prickle, but even that had a strangely endearing quality to it that I just couldn't rationalise in the moment. \n\nUltimately my efforts to keep my composure were all in vain. I tried to fight it, I really did, but I couldn’t hold back any longer.\n\n“**Awwwwww!**”\n\nA cooing trill that I had absolutely **zero** control over escaped me, accompanied by my ears and tail wagging in complete adoration of the beautiful creature in my arms. Viktor beamed ear to ear, delighted by my reaction, though Lokki and Solenk’s expressions were ones of utter jaw dropping astonishment. In that instant I was keenly reminded of the fact that these two, and everyone else for that matter, only knew one side of me; and it certainly wasn’t as a guy who would ever go *‘Awww’*.\n\nBefore they had the chance to even think of making a comment I glowered at the pair, rapidly flicking my ears to keep them silent, *‘say something, I dare you’*.\n\nThe two relented, swaying their ears indifferently before returning to their own moths; though I swear they were doing their absolute hardest not to burst into laughter over my abrupt change in character.\n\n*Ack! Nevermind, I’ll deal with that later.*\n\nPutting it out of mind for the moment I finally petted the moth's wool, my paw sinking into its wonderfully soft silky fur as I carefully ran my claws along its back.\n\n*Woah, this is amazing!*\n\nAs I continued to pat the Titan Moth, I recalled how Viktor had brought up pets and what Roisin had already taught me about them. It still seemed strange to me that humans would just keep animals near them, as well as in their homes of all places. But I had to say, while holding this *little guy* in my arms, I think I was starting to see the appeal.\n\n*Pets huh? Hmmm… I think humans might be onto something there. Hehe, so cute!*",
                "comments": [
                    {
                        "author": "VenlilWrangler",
                        "comment": "In today's episode, Kailo reminds everyone that he is still a \"spicy\" teenager. He's a handful but a lot of fun.\n\n\nBig moths are pretty neat. Growing up I saw a lot of Luna, Giant Silk, and Hummingbird moths. I haven't seen any in a long while though.",
                        "published_at": 1733262003.0,
                        "likes": 91,
                        "subcomments": [
                            {
                                "author": "Still_Performance_39",
                                "comment": "He is indeed, at least he's fairly introspective though.\n\nI think moths are great, sadly don't get a lot where I live but I've seen a fair few, couldn't tell you the species though.",
                                "published_at": 1733262441.0,
                                "likes": 43
                            }
                        ]
                    },
                    {
                        "author": "IAMA_dragon-AMA",
                        "comment": "Chapter 47: Kailo *definitely doesn't* kidnap a moth",
                        "published_at": 1733262689.0,
                        "likes": 57,
                        "subcomments": [
                            {
                                "author": "Still_Performance_39",
                                "comment": "What? Kidnaps a moth? What are you talking about, perish the thought... >\\_>",
                                "published_at": 1733262935.0,
                                "likes": 33
                            }
                        ]
                    },
                    {
                        "author": "Mysteriou85",
                        "comment": ">The concept of tweaking the genes of a species to change it to suit your preferences was uncomfortable to think about.\n\nSweet sweet irony, my poor Kailo, your not ready for the futur\n\nAlso ! I was not expected a fictional animal but that fun ! Moth will be always be one of the best insect for me so it's nice it's a giant fluffy moth",
                        "published_at": 1733264117.0,
                        "likes": 47,
                        "subcomments": [
                            {
                                "author": "Still_Performance_39",
                                "comment": "I know, I laid on the foreshadowing thick this time around!\n\nYeah I saw the pictures that I linked to the chapter and was inspired to make it for the story, why should the aliens be the only ones with cool fictional animals :)",
                                "published_at": 1733264342.0,
                                "likes": 28
                            },
                            {
                                "author": "nmheath03",
                                "comment": "The awkward moment when humans have been making new species for 30,000 years",
                                "published_at": 1733267049.0,
                                "likes": 12
                            }
                        ]
                    },
                    {
                        "author": "ISB00",
                        "comment": "I love the idea of new species being made. Yeah that would happen. Reminds me of the Mockingjays from the Hunger Games. GMOs that were discarded but managed to establish themselves in the wild.",
                        "published_at": 1733262444.0,
                        "likes": 39,
                        "subcomments": [
                            {
                                "author": "Brave-Stay-8020",
                                "comment": "It's something that is happening even now. You had this one rancher recently try and hybridise a near extinct species of ram with some of his own sheep.  He was arrested on multiple accounts and they are trying to find all the places where he sent out \"samples\" to.  Or, you could look at all the different breeds of dog to see how far humans will take genetic manipulation.",
                                "published_at": 1733262984.0,
                                "likes": 27
                            },
                            {
                                "author": "Still_Performance_39",
                                "comment": "Oh absolutely, give people tech and they'll do anything they can think of just because they can. I wouldn't be surprised if it happened in real life, especially seeing as how there are scientists trying to edit some species like mosquitos.",
                                "published_at": 1733262856.0,
                                "likes": 18
                            }
                        ]
                    },
                    {
                        "author": "Copeqs",
                        "comment": "Titan Moths and Venlil... It would make a good combination pet-owner wise. A gentle pet for a gentle soul.",
                        "published_at": 1733262374.0,
                        "likes": 26,
                        "subcomments": [
                            {
                                "author": "Still_Performance_39",
                                "comment": "Definitely, two fluffy friends just chilling in their home. Though there would be the odd moment of chaos as the moth gets a bit curious around the appliances, specifically the lighting XD",
                                "published_at": 1733262760.0,
                                "likes": 23
                            },
                            {
                                "author": "Underhill42",
                                "comment": "Hmm... could be a problem though if these moths eat wool.  \n\nSure, it's cute when they nibble on your fuzz,  but then you wake up looking forward to a hot date only to discover a dinner-sized plate bald patch on your chest because you forgot to feed them before going to sleep.",
                                "published_at": 1733264443.0,
                                "likes": 15
                            }
                        ]
                    },
                    {
                        "author": "Brave-Stay-8020",
                        "comment": "I think that Kalio is forgetting a little something with his detour for the moth, he should be worrying about how much Bernard will make an example of him for letting a spider get loose.  I mean, Kalio knows that Bernard is going to find out sooner or later.  Now personally, I wouldn't do anything to badly, just something a little bit tradtional in terms of school punishments.  He needs a dunce cap for a day or two.",
                        "published_at": 1733262624.0,
                        "likes": 20,
                        "subcomments": [
                            {
                                "author": "Still_Performance_39",
                                "comment": "Yeah he's gotten a bit distracted but like you've said, Bernard isn't that harsh. We'll see how he handles it :)",
                                "published_at": 1733262905.0,
                                "likes": 12
                            }
                        ]
                    },
                    {
                        "author": "JustTryingToSwim",
                        "comment": "*The scruffy white wooled form of Lokki materialized almost out of nowhere beside me,*\n\nOh, now it makes sense: **Loki** is the god of mischief.",
                        "published_at": 1733264366.0,
                        "likes": 17,
                        "subcomments": [
                            {
                                "author": "Still_Performance_39",
                                "comment": "Hurray! Someone finally said it haha \n\nI thought I was making it pretty obvious when I introduced him as a prankster in the snake chapter but here we are at the moth chapter XD",
                                "published_at": 1733264490.0,
                                "likes": 14
                            }
                        ]
                    },
                    {
                        "author": "FactoryBuilder",
                        "comment": "I thought the chapter would end with Kailo’s enjoyment being cut short from hearing the Doctor behind him asking to speak with him for a moment.\n\nThis chapter made me think about what lab-designed creatures we’ll have in the future. Certainly a mess of a topic I don’t want to deal with.",
                        "published_at": 1733263340.0,
                        "likes": 16,
                        "subcomments": [
                            {
                                "author": "Still_Performance_39",
                                "comment": "Fortunately for Kailo the Doctors not that much of a spoil sport, but they'll have words eventually.\n\nIf the day ever comes where it's an easily accessible technology I can imagine it'd be messy too, but maybe giant friendly moths will come out of it haha",
                                "published_at": 1733263947.0,
                                "likes": 13
                            }
                        ]
                    },
                    {
                        "author": "OmegaOmnimon02",
                        "comment": "BIG FLUFFY MOTHS!!!",
                        "published_at": 1733263196.0,
                        "likes": 13,
                        "subcomments": [
                            {
                                "author": "Still_Performance_39",
                                "comment": "They are cute and floofy and everyone must love them!",
                                "published_at": 1733263290.0,
                                "likes": 9
                            }
                        ]
                    },
                    {
                        "author": "ItzBlueWulf",
                        "comment": "That's a nice bit of worldbuilding and nice backstory for this adorable little guys.\n\nI guess it also will help them get an handle with the idea of domestication later on.",
                        "published_at": 1733262732.0,
                        "likes": 12,
                        "subcomments": [
                            {
                                "author": "Still_Performance_39",
                                "comment": "Thanks, glad you like it!\n\nIndeed it will, they've already gotten used to the idea of pets on the surface so it'll definitely help.",
                                "published_at": 1733262973.0,
                                "likes": 12
                            }
                        ]
                    }
                ],
                "shares": 0
            },
            {
                "title": "[Transcripts] Resolve -Chapter 5: First Offical Contact",
                "url": "https://www.reddit.com/r/HFY/comments/1i8y04i/transcripts_resolve_chapter_5_first_offical/",
                "score": 172,
                "comments_count": 63,
                "author": "squigglestorystudios",
                "created_utc": 1737732605.0,
                "selftext": "##[Wiki/Chapter list](https://www.reddit.com/r/HFY/wiki/series/transcripts) = [First Chapter](https://www.reddit.com/r/HFY/comments/ftp5nq/transcripts_disparity_prologuechapter_1_isekaid/) = [Previous](https://www.reddit.com/r/HFY/comments/1i8x4ft/transcripts_resolve_chapter_4_state_of_affiars/?) =  [Next]()\n&nbsp;\n\nThe wait was agonizing.\n\nThey had all heard the commotion when the councillor arrived, and now, it was only a matter of time before Nako retrieved them for First Official Contact.\n\nJasmine was pacing to calm her nerves, practicing breathing in and out and going over the plan she, Xant and Itsuki had devised amongst themselves. Questions to ask, demands to make, subtleties and nuances of alien culture she had learned were all about to be put to the test.\n\nThere couldn’t be any room for doubt.\n\nSpades sat beside Beau, the large man had a hand over his partners head, gently running his fingers through the fur. They had plenty of practice waiting, lost in thoughts far beyond the confines of the room, while he would have preferred to talk, he couldn’t let his emotions get ahead of himself or anyone else.\n\nItsuki finished the last knot of ribbon around a wooden box, fiddling and fussing the elaborate fabric until it was deemed ‘presentable’. A small token they had agreed upon, since even in the depths of space, it felt uncomfortable coming empty handed to such an occasion.\n\nXant pried his eyes away from the door, the anticipation was driving half of him to irritation, while the other longed for the days of his stoicness. Humility and reservation, it was not his place to have ‘loud’ emotions today.\n\nXant offered Jasmine a cold glass of water, she took it graciously, but barely took a sip when they all felt the chilled air of the lieutenants arrival.\n\nJasmine’s nerves flared, but Xant’s hand over hers brought her back down.\n\n“Even presence,” he reminded her, and she half smiled.\n\n“Calm thoughts,” she replied.\n\nBeau stood up, reaching for the faceless helmet that accompanied the suit.\n\n“Your time to shine,” He prompted her, before clasping the unwieldy armour over his face, “I’ll try to keep my simmer down,” Despite the request made to the Engine lord to make their helmets exactly the same as diagrams provided, Viitoic had insisted the design was incompatible with the galactic safety standards. There was no visor, and no meaningful way to turn his head, once the helmet was connected to the suit the organic cameras on the outside became his eyes. He could see everything around and behind him, it made him feel like a walking tank, an ugly tank, but a tank none the less.\n\nItsuki tucked the wooden box under his arm, and adjusted the alien sword at his hip.\n\n“Ready when you are, Sunshine,” he stated without sarcasm.\n\nJasmine nodded, affording herself one last sigh before heading for the door.\n\nClosing her eyes, she could get a better feel for those outside the room, Rynard’s relaxed bravado unwavering while the fresh chill of the Lieutenant felt like cracking ice.\n\n“It feels like he’s waiting outside,” she whispered allowed, and he felt just as nervous as she did. Jasmine turned back to face her friends, all of them waiting for her orders, so she put on a brave face and a warm glow, “lets go make first contact,”\n\n-*-\n\nCounillor Kaalijorn looked rather disparagingly at the room, despite the hours the attendants had, there was just no way to restore millenia old steel in a day.\n\nThe conference room had been bare, since Kotorn took most of his meetings in his own office, the space had been spared the physical damage but suffered from abandonment and neglect. Even with added wall coverings and floor rugs, the best Kaalijorn could do was make sure it was clean, neutral space, devoid of any obnoxious odors.\n\nIt had crossed their mind, several times infact, to hold such an occasion upon their own ship, the surroundings would have been more comfortable for everyone involved, but then that would have undermined the security and secrecy. It was not a good idea to be outnumbered by an alien species in an advanced stealth ship.\n\nSeveral tables and stools stood beside the infloor holoprojector, their own data uploaded to it and synced so that should the need arise the councilor could pull files with a simple command. Speeches and holovids prepared to show off the glory of the Galactic Council and the great boons they would receive upon their admission were all prepared before he even left Clentessia. Kaalijorn chuckled to themself, despite being the ‘ambassidor’ they was really only there to help the fledgling species navigate the endless contracts of citizenship.\n\nAnd from the Esaander reports, he might not even need to explain that much of the legal work at all. How thrilling, to meet a species understanding of bureaucratic decorum.\n\nThe quiet contemplation was interrupted by the pinging of an attendants comms. Kaalijorn motioned for the tall, graceful Savori pair to allow his guests in as they took their position for greeting.\n\nThey had studied the materials on humans for the last weeks before arrival, but feeling them in person was, indeed, a completely different matter. They far surpassed the presence of the Lieutenant commander escorting them, distinct and ever shifting, the councilor tried to compose themself before the doors opened but being in the same room only caused further stumbling.\n\nSir Tar Nako, the arvas Lieutenant acted as announcer, but dressed as though he were receiving the councillor himself. Kaalijorn’s fins twitched as the young soldier presnted a salute.\n\nFridged air was his signature, the favoured calling of tactious Princes, ruthlessness behind a professional mask.\n\n“Your eminence!” Sir Tar Nako bowed, “May I present; Namegiver Jasmine Anne Howe and her entourage,” Nako quickly and expertly side stepped to reveal the smaller aliens behind his flourishing cape “Sir’s Sargent Beau Mathews, Sugawara Itsuki, Captain Rynard Derjan, Captain Spades and Doctor Uru’Nav Xant,”\n\nThe pleasant aura of a solar lamp warmed his blue skin, and although they heard it many times, the humans voice carried an air of regality they did not posess over the audfiles. She bowed respectfully.\n\n“Councillor Kaalijorn,” her entourage followed after her, bowing in turn, “thank you for hosting us,”\n\nKaalijorn slowly returned the bow, regaining his composure upon becoming upright.\n\nTheir impressions of the humans already shifting, they had expected inexperienced yet eager individuals, not the coordinated and poised collection before them now.\n\nThey had integrated considerably in the short months since ‘arriving’.\n\n“Namegiver Jasmine, and Entourage,” Kaalijorn greeted, turning to offer them a seat, “Welcome to The Galactic Councills 138 sector Military Branch, please, take which ever arrangement suits your standard,”\n\n“Thank you councillor,” Jasmine acknowledged, “but before we begin the formal proceedings,” she gave a mere glance to the smaller of her kind, “it is customary for human delegations to bring a gift, as a token of respect and a hope that we can foster a friendship in the times to come,”\n\nKaalijorn clicked his toothplate unexpectedly, as the smaller human, dressed in a scientist coat offered him a glimmering wooden box. An attendant was quick to rush forward and take it from the human's hands, but stalled once the box was in his possession, the Kitarian was staring at the human with wide golden eyes, then, shaking, as if overcome from simply being too close. The male humans freq was chilling, crisp, but filled with a subtle sense of… despair. Kaalijorn, quickly, accepted the box from his attendant, allowing the poor creature to return to their place behind him.\n\nThe box was heavy in his hands, polished and lacquered to show off the intense cellular structure of the woods grain. Beautiful.\n\n“A most generous offering Namegiver, the council appreciates the forethought,”\n\nThe human accepted their reply but turned a sympathetic eye to the poor attendant, before finding a seat for herself.\n\nKaalijorn’s webbed fingers curled around the box, from the females warm sunlamp to the males chill of an airlock, they’d have to watch how quickly their Frequencies interacted with their own, perfectly balanced personality.\n\nCuriously, the councillor sat down at the table, studying at a glance his negotiators to be, they arranged themselves in the exact order they had walked in, they had been given extensive equtitte training and followed it, which was impressive for such a short amount of time.\n\nKaalijorn counted an alarming amount of pleats in the armoured human's cape, his face completely covered so he couldn't see the difference in phenotype, but the body shape was obvious. The user-level species, who had been given a captains designation sat patiently and obediently at his feet, the number of pleats in his cape, however, should certainly not have been the case, causing the councillor to frown.\n\nThe smaller, colder feeling human chose to focus his piercing eyes at his attendant's feet, hand covering his face so only his eyes were visible, glancing as subtly as the councillors own around the room. The white coat suggested he was of scientist’s build, but his head was the same size as his maidens.\n\nThe Sulin Knight stood up against the back wall, knowing his presence was not needed, except for the human's request, but curiously, the Zenthi doctor, sat at the table with the humans…\n\nNako stood at the door, while he was the escort he was not included in the discussion, the arvas was probably wary of his standing and behaving for good measure-\n\n“Councillor?” Namegiver Jasmine spoke, snapping him from his reconnaissance, “are you going to open the gift?”\n\nKaalijorn turned to look at the box.\n\n“The box is not the gift?”\n\n“It is, but, there is a token inside,” she smiled, a bright glow of anticipation.\n\nKaalijorn studied the object and tugged at the thin blue fabric, the delicate wisp of ribbon fell aside allowing the contents inside to be revealed.\n\nA strange trinket indeed.\n\nA clear, glass bottle, the length of his arm and double the thickness, lay atop gold stands, yet inside there sat a fully realised replica vessel of ancient design. Kaalijorn sat there stunned, the longer they looked at the thing the more detail they noticed, an exhausting feat of engineering.\n\n“I…” they began, but the words and polite manner did not want to co-operate. Sensing the councillor's discomfort, the zenthi doctor spoke up.\n\n“It is purely decorative, your eminence,” the swell of a river followed his words, “humans prefer to be surrounded by aesthetically pleasing things,”\n\n“It's symbolic too,” the Namegiver added, “the galleons sailed the unknown oceans in search of a safe harbour, just as we,(humanity) are searching for our own,”\n\nKaalijorn gulped, hearing the ‘secondary’ layer of human voice poking through the translator’s filter. The thought and care put into the gift and their meeting alone was unprecedented, so often when speaking with a new peoples the council would have to talk down, simply and while the situation was delicate and unprecedented, he did not need to speak down to the species infront of him. Perhaps, this would be a new dynasty defining moment in more ways than one.\n\n“The council offers sanctuary to all those who seek it,” the councillor gestured to their attendants, the lights were lowered, the aud-recording prepared, “Namegiver Jasmine, shall we begin the proceedings?”\n\n“Yes councillor, we are ready,”\n\n[***These transcripts are classified until reviewed as Historical Audfiles under the Galactic Council Authority and to be housed at the Clentessian Domain Audchive. Council Member authority needed to duplicate, distribute, and broadcast the audfile inquisition. Transcripts are official property of Councillor Kaalijorn, Qzetillian standing member.***] \n \nCouncilor Kaalijorn: It is 1030 [hours] on the 142nd [day] the second quarter of [year] 306, Rejuvenation Dynasty. I Councillor Kaalijorn will preside over the formal first contact between the galactic council and the new species, Humanity and Dogs, please state your names and titles as a matter of record.\n\nNamegiver Jasmine: Namegiver Jasmine Anne Howe, \n\nItsuki: Sugawara Itsuki\n\nSargent Beau: Sargent Beau Mathews, \n\nCaptain Spades: Captain Spades, Friend of Namegivers\n\n[Councilors notes: The Holomap of the entire Galactic council territory was displayed for the humans, they reacted rather nonchalantly, probably used to the holoprojectors during their stay amongst Galactic Council Military.]\n\nCouncilor Kaalijorn: the galactic council envelops 53 planets, 142 stations and serves the needs of 40 billion citizens. 12 species with over 60 variants we are a harmonious civilisation aiming for excellence and rebuilding to the height of the Prosperous dynasty. As a joining member, you will be promised your own homeworld for internal affairs and access to the entire galactic Civ-net, logistics network and the protection of the Council Rangers. As a creator level intelligence, you will receive a seat at the council and have a nominated candidate for councillor. Contribution accreditation will be evaluated and given a score to participate within the economy and live your lives in perpetual comfort. I am here to guide you through the entire process, and I am sure you have many questions.\n\n[Councilor Kaalijorn rises from their stool and approached the hologram.]\n\nCouncilor Kaalijorn: Namegiver, would you care to add your homeworld to our map?”\n\nNamegiver Jasmine: [Sad/Embarressed] I’m afraid I can’t… Humanity is not yet a star-faring species, I couldn't tell you where Earth would even be…\n\n[Councilors notes: One of Humanity’s unique traits amongst Creator-Level intelligences is the ability to communicate complex emotions even after going through the translator filter. Such a strong sense of self is important for Commander units.]\n\nItsuki: I can.\n\nSargent Beau: [Shocked] What?!\n\nNamegiver Jasmine: [Surprised] What??\n \nItsuki: [happy/confident/annoyed] I know where Earth is on the galaxy map.\n\nSargent Beau: [confused] What? How? Why?\n\nItsuki: [Shrugs] you know, ‘just in case’.\n\n[Itsuki stares at the map, raising his hands to the holograph]\n\nItsuki: councilor, can you zoom out? \n\n[councilors notes: this was unexpected, with the exception of the Sulin, no species since joining the Council has been able to point out their home planet, even the Arvas though space fairing, did not have the technology to map star systems beyond unaugmented vision.]\n\n[holomap zoomed out to show the entire branch of the galaxy]\n\nItsuki: No like, zoom all the way out, I need to see the whole of the [milky way]\n\n[councilors notes: The smaller human took a few minutes of deliberation, focusing on the outer stars of the galaxy. Eventually pointing to a cluster on the opposite galaxy arm, uncharted even from before the Painful Dynasty Record Purge.]\n\n\nItsuki: [confidently] There, roughly, give or take a few thousand light-years,”\n\nSargent Beau: [Excited/Jubelant] And you’re sure? You’re absolutely sure?!\n\nItsuki: [Confident] 90% sure, I mean, [hesitant] the pictures taken from the opposite end of the galaxy but… yeah.\n\nCouncilor Kaalijorn: If you’re sure it is in that direction, it should not take more than, 15 [years] to make the necessary journey.\n\n Itsuki : [shocked] 15 years? That’s all?... \n\nNamegiver Jasmine: [Relief/Excitment] It’s so close…I thought… I thought we’d never get back home…\n\nItsuki : [confused/incredious] Why would you think that? I thought your first instinct would be to find your way back?\n\nNamegiver Jasmine: [Anger/Dissapointment] The Rajava harvest planets and people, if Earth had survived, or [sadness] red buttoned the invasion, everyone and everything I knew would have been gone anyway… [relief] Thought I was hundreds of millions of lightyears away but now…\n\n[councilors notes: I have never felt such a strong and quick reaction, so much freq blasting in such intensity so quickly. My assistants nearly all succumbed to VFS. particularly Namegiver Jasmine and Sargent Beau]\n\nNamegiver Jasmine: [Determination/Confidence] Councillor, we are humbled by the council's most generous of offerings, but I’m afraid we will not be acknowledging citizenship contracts today.\n\nCouncilor Kaalijorn: [shocked] y-you won't? I was under the impression you, that is to say, Namegiver Jasmine, were ready to commence proceedings, at least that is what your Audfile Transcripts indicated.\n\nJasmine: [polite/diplomatic/commanding] Yes, I was, but circumstances have changed, this new information has come to light and it would be morally and legally irresponsible of me to proceed without consulting my companions and confirming additional concerns about the Council and its ongoings. With our home planet so close it would not be right for us to make decisions encompassing Humanity and the remaining species of Earth. \n\nCouncilor Kaalijorn: [caught off guard] O-of course; is there anything you have particular concerns about? Surely you would be the most qualified to make these decisions having been living amongst the people of the council for the longest-\n\nNamegiver Jasmine: [polite/diplomatic/commanding] No. Humanity is no stranger to the complexity and morality of the law. ‘Do not sign anything you don’t understand’ is the first lesson humans learn about law. I want to thank you councilor for your patience in this whole fiasco but unfortunately, while your citizen and military personnel have been most generous hosts, the short few months during mine and my companions stay have highlighted several conflicts of interests between our two parties. Our cultures are very different and while we eager to broker a peace between us, there may be some aspects that neither us will be able to reconcile without further discussion. While I have done my best to keep this diplomatic, neither I nor my companions are qualified to broker this new peace between our peoples. \n\nCouncilor Kaalijorn: Conflicts of interests? Namegiver, the Council has offered you everything you have requested and more. Acknowledging the contracts is more a formality and once they are agreed to and you are welcomed into the community, there is nothing we couldn’t provide. In terms of assets ships, stations, planets… in terms of immaterial, we can offer physical rejuvenation, planetary tours, and judiciary powers within government. I fail to see what would be such a large conflict of interest that your people would not forgive you for speaking without them.\n\nItsuki: Genetic engineering is taboo.\n\nCouncilor: oh. Yes, I remember you saying it was a fledgling science-\n\nItsuki: [Concern/Contempt] not a fledgling science, a forbidden one. We have mapped the genome and identified numerous genetic diseases, cured a few even, but to tamper directly with human DNA directly? Then that would lead us down the dark road that you are currently on, and are desperately seeking to get away from. \n\n[Councilors notes: Namegiver’s subordinates speak out of turn, humans while they do have a designated leader it seems to be more of a consensus then a direct line of authority. They all act independently of one another even when possessing a translator.]\n\nCouncilor: but the opportunities provided to you should your genetic material be made available to the council are exponential.  New materials in the hands of our geneticists can reverse the many limitations we currently suffer in the reproduction and healing process.\nThe preliminary studies of your cohesive structures could save the qzetillian race, like myself, from genetic decay, humanity would be giving trillions of new lives a brighter future.  \n\nBeau: [anger/disgust/insulted] ***No***.\n\n[councilors notes: The military model human barely speaks but his commands are very confronting. The other humans and the User companion, while startled by his contribution recover quickly from the command.]\n\nJasmine: [polite/firm/diplomatic] councilor, it makes me happy to hear you are open for discussion, but we cannot make any promises at this time. We need to recess, discuss and reconvene. \n\nCouncilor: New technology can seem scary and confronting to those who do not understand it but I truly believe you are overstating the dangers-\n\nJasmine: [incredulous/defensive] Counilor, I’m not sure you understand it. My companions experienced first-hand what the technology looks like and I wouldn’t describe it as a bright future.\n\nItsuki: [anger/disgust] We were imprisoned at a corporate station, they were using our DNA to make homunculi, trying to splice human DNA with alien. Even with all your experience and tech it didn't work, they had thousands of failed experiments kept in refrigeration!\n\nBeau: [Repulsed/disgusted] ***and they were still alive and suffering…***\n\nCouncilor: [disbelief] I… was not informed Kyu-Kage corporation was conducting unauthorised R&D research on unsanctioned genetic material. There will be a formal investigation into their conduct within the market. But if you truly do not want to negotiate then I’m not sure how much further we can extend our hospitality.\n\n[Councilors notes: humans, it seems, having no prior experience with Freq are very sensitive to tone shifts and vocabulary. The wrong wording can set off threats the speaker had no intention of implying.]\n\nNamegiver Jasmine: [concerned/nervous] We’re not finished with negotiations Councilor, we just need time to discuss- \n\nSargent Beau: ***[loathing/anger] …***\n\nItsuki: [appalled/confrontionational] So you’d make us destitute within council space for retaining our genetic autonomy?!\n\nCouncilor: Not destitute no, every citizen within the sphere is kept to a minimum standard of living, food, shelter, hygienic facilities health care, all provided for, but the amount of deficit you have accumulated under the good Lieutenant’s account would be enough to destroy all of his equity…and more. If you refuse to acknowledge the citizenship contracts then you can no longer exist at the standard of accommodation you are at now.\n\nSargent Beau: ***[Loathing/Replused/fury] … …***\n\nJasmine: [Pleading/insulted/diplomatic]Councilor, my companions and I want to help, we do, but we can't hand over our genetic rights without proper consultation, and threatening us with our benefactor’s wellbeing is not the way to broker trust between us.\n\nCouncilor: it was by no means supposed to be a threat Namegiver, i am simply stating the facts. Without citizenship you and your user-level intelligence species are relegated to being the Lieutenant’s assets. your companions were responsible for an estimated 35% destruction of the entire progenitor companies output. And since Kyu-Kage are the primary producer of citizen and military assets for the sector that accounts for nearly 13 thousand [years] worth of lost productivity and of lost lives. That is a considerable amount of credit and even the esteemed lieutenant does not have that much in accreditation. You would all be downgraded to the minimal living conditions until you join as citizens and get accredited yourselves.\n\nItsuki: [anger/incredious] Councilor, humans would absolutely consider that a threat.\n\nCouncilor: I am simply stating facts and trying to warn you of the consequences of your actions Namegiver. I am bound by the law and am presenting them to you as such.\n\nJasmine: [Blunt/Unimpressed] Fine. Is there any way we can control who has access and for what reasons? Are we allowed to revisit the contract and renegotiate after a certain amount of time is up? Can we control absolutely all copyright?\n\nCouncilor: It is under council law that as a Creator Species, you are entitled to designate what aspects of your DNA might be put into circulation. If you desire to limit your access we would be willing to accommodate, but absolutely all copyright would be a hard clause to enact if you wish to produce more citizens-\n\nItsuki: [distraught/angry] Absolutely not! No human clones of any kind! \n\nJasmine: [appalled/Dissapointed] Never. Full Human Cloning goes against every moral, ethical and philosphic virtue we stand for. Designer genes invites prejudices and destroys stability, we need diversity in our lives, we need time to mature and grow to become people. Every human’s genetic imprint is unique, special, our DNA can't survive being paired with related strains, identical pairings would only cause debilitating diseases. I don’t think our brains can even comprehend a sea of identical faces without breaking down. You cant manufacture humans… [Pleading] Councilor, I cannot stress how much of a violation cloning is to us…\n\nCouncilor: Namegiver I am forced to profusely dissagree with your statements. Cloning is what saved the Galactic council from absolute extinction, we’ve revived species from the dead and erraticated more diseases then your planet has probably produced. The fact you are sighting incompatible related strains confirms you are not well versed with the technology or its capabilities. With only a single human sequence we would be able to repair the damage done to the 11 original council species, retaining longevity and minimizing abnormalities with current build models. We could rectify any abnormalities within the sequence and produce citizen and military models-\n\nBeau:[Righetous/Furious] ***How many times do we have to tell you no?***\n\nCouncilor: [startled/scared/shocked] ?!\n\nBeau:[Righteous/Furious] ***All men(Humanity) are created equal, there will be no lesser or superior beings, there will be no more monsters made from us-skkwjebfkashgq .: . / ’ ; k j s#%7q899-***\n\n\n***Transcripts error- Disconnected.***\n\nThe room was enveloped by a burning hatred reserved for Knight commanders and living bombs. Every Freq feeling being was forced backwards, except for the councilor, pinned in place by a righteous fury.   \nBeau stood from his seat, Spades growling at his heel as the soldier strode across the room and grabbed the councilor by the collar of his robes. Even with the helmet on Kaalijorn could feel his eyes seering holes into his own.\n\n“Councilor, We do not trust you and we do not fear you, we will not go quietly,”\n\nThe growl was deep and guttural, the statement cutting and a true threat.\n\nItsuki ran over and tried to pull Beau off the councilor, but he had no hope of matching the man's size or strength.\n\n“Put them down!” Itsuki exclaimed, but Beau grabbed Itsuki's wrist, twisting it around and forcing the kid to heel. \n\n“Beau don’t kill them!” Jasmine cried out in fear and alarm, watching as the negotiations fell apart before her. “Let them go!”\n \nRynards hulking presence seemed frozen, caught between inaction of Jasmine's fear and the realisation he could not intervene without hurting Beau or the councilor, his claws too big to grab either safely. Nako jumped from the door after hearing the plea, sword launching out to within centimetres of Beau's back, crackling with electricity.\n\n“Unhand the Councilor!” Nako commanded, but the wall of ice simply passed over the human.\n\n“Not until they tell me why they’re so desperate for our subjugation!” Beau shouted back with terrifying volume, “This is first official contact and this so-called representative of the galactic council is forcing us to sign over the fate of the human race without even allowing us a recess?! They don’t want harmony they want submission, so desperate they're willing to threaten us to comply, why? The devil is in the details and you aren't giving them to us…”\n\nBeau’s Freq seared like plasma, the wave of fury, fear, and disgust was painful, even the lieutenant’s grip on his blade wavered as the human continued to broadcast his extreme discontent. \n\nKaalijorn shook, terrified in the human's grip.\n\n“I am just trying to guide you through the contracts-” they answered meekly.\nBeau lifted the councilor from the ground easily, Kaalijorn held onto his robes for dear life.\n\n“If you harm me the lieutenant will kill you where you stand!” they attempted to regain control, but the human only replied with a bone-chilling.\n\n“There are fates worse than death,”\n\nKaalijorn went pale, Nako hesitated, his sword dropping height as the air in the room went deathly still. Beau spoke again.\n\n“Why are you so desperate for us to sign the contract? Answer me.”\n\nKaalijorns eyes darted to Nako desperately.\n\n“Don't look at him, answer me!” Beau demanded and Kaalijorn was forced to comply.\n\n“We need your DNA,” he said quietly, “we can't keep producing inferior citizens models at this rate, if we slow production we will fail to comply with demands and be outnumbered by the billions,”\n\n“By the Rajava?” Jasmine asked, “the pirates?”\n\n“No, the Arvas Imperium.” The councilor answered bitterly, “Their reparations and demands from the Painful dynasty have to be satisfied, we were forced to create citizen models to fulfill them but our current output isn’t enough…” Kaalijorn could not break the human's gaze no matter how hard he tried, “... even the genome of one of you could balance the universe in our favour.”\n\nBeau carefully placed the councilor down and released Itsuki from his grip.\n\nThe fires smouldered to embers of disdain and contempt. \n\n“Thank you for your honesty,” he replied cruelly, “we will be deliberating over these details at our accommodation, we will inform you of our answer.” as Beau turned he side-stepped Nako’s sword, staring down the lieutenant.\n\nNako was forced to acknowledge his presence did nothing to the human, Beau had been in war longer than nako had been alive. There was nothing he could do to match such a ferocity… \n\n“Jasi! Itsuki! We’re leaving, we do not negotiate with eugenicists.” Beau ordered, and without saying a single word, Rynard stepped aside for him.\n\nThe two younger humans stood in shock, Spades barking at the pair of them when they refused to move. Xant’s hand suddenly grabbed Jasmines and he pulled her along.\n\n“Jasmine, you follow Beau, I will speak with the councillor,”\n\n“But Xant!-” She exclaimed, panic beginning to set in. \n\n“I can't calm Beau’s anger but you can,” he reminded her, a voice of reason in the cacophony “Itsuki, Captain, help Jasmine, I will handle the councillor, ”\n\nItsuki and Jasmine looked at Xant dubiously but they had no choice but to run after Beau, he was a danger to everyone on base. The captain scooped the pair of them up and gave Xant a quiet nod as the door closed behind him.\n\nNako was helping the councillor off the floor as Xant offered a helping hand.  \n\nThe councillor was shaken, a fury and self-disappointment flickered behind his eyes.\n\nXant waited patiently for the councillor to address him, the ruined politician could not stand on his own two feet, requiring the doctor to bring them water and medications. The councilor's attendants were in even worse shape, barely beyond response, collapsed in a heap and shivered from overexposed nervous systems. \n\nThankfully, Xant was able to administer some small chemical relief, but the incident had left them all worse for wear.\n\n Kaalijorn sat on the stool and looked up at Nako and Xant miserably.\n\n“I propose you would call that a catastrophe…”\n\n“Councillor, if things did not go terribly wrong where humans are concerned, I would consider it a first,” Xant conceded. The councilor blinked surprised, Xant was unharmed by the display of freq and was trying to comfort him, despite being completely sworn to the humans, “we knew this meeting would be difficult and while Sir Beau’s reaction was, confronting, that does not mean negotiations have been disconnected entirely.”\n\nThe councillor stared back at the citizen model before him, who had been quiet this entire time, watching and observing as he was supposed to do, now reasoning with him as a bureaucrat on his level.\n\n“Councillor, when Beau and Itsuki were contained under Kyu-Kage they were under the impression they were prisoners of war and I suspect the company were under the impression they were Rajavan constructs. Humans do not possess frequency organs but do possess an extreme amount of nerve endings, what you and I would consider enough force to injure results in unimaginable pain for them, what they consider an appropriate retaliation would seem extreme to us.”\n\nThe doctor looked between the lieutenant and the councilor,\n\n“It was a collection of terrible misunderstandings on both sides, but is it not the desire to learn from those mistakes and forge relationships that the council was founded upon? To be a society all can live in safety and harmoniously? Free from pain and fear?”\n\nXant bowed deeply to the councilor.\n\n“Humans also wish for this peace, Namegiver Jasmine wishes for a compromise between our peoples, give them time, understanding, they deserve that much.”\n\nThe councilor nodded his head gently.\n\n“well-spoken, doctor,” Kaalijorn admitted, “the humans have requested time, I will give them time.” Kaalijorn closed his eyes and allowed his shoulders to sink, “Lieutenant escort the doctor back to be with the Namegiver entourage, I have some thinking of my own to do,”\n\nNako, hesitated.\n\n“Are you sure councilor? We can't wait until another Ranger can relieve us?”\n\n“Yes I am sure, the council needs to be informed,” Kaalijorn sighed heavily “and I need to reconsider my position, dismissed,”\n\n&nbsp;\n\n##[Wiki/Chapter list](https://www.reddit.com/r/HFY/wiki/series/transcripts) = [First Chapter](https://www.reddit.com/r/HFY/comments/ftp5nq/transcripts_disparity_prologuechapter_1_isekaid/ = [Previous](https://www.reddit.com/r/HFY/comments/1i8x4ft/transcripts_resolve_chapter_4_state_of_affiars/?) =  [Next]()\n\n##[Book 1- Transcripts](https://www.reddit.com/r/HFY/comments/5tcesp/oc_research_transcripts_of_dr_xant_translator/)\n\n\n##[Book 2- Transcripts: Zero ](https://www.reddit.com/r/HFY/comments/7sbwwp/oc_transcripts_0_prologue/) \n\n##[Book 3- Transcripts: Dreams](https://www.reddit.com/r/HFY/comments/9b934s/octranscripts_transcripts_2_chapter_1/) \n\n##[Book 4- Transcripts: Disparity](https://www.reddit.com/r/HFY/comments/ftp5nq/transcripts_disparity_prologuechapter_1_isekaid/) \n\n\n\n\n##[Patreon Squiggle Story Studios](https://www.patreon.com/SquiggleStoryStudios)\n##[Read on Royal Road](https://www.royalroad.com/fiction/42987/transcripts)\n##[Read on Archive of our Own](https://archiveofourown.org/series/1636900)\n##[Read on Tapas](https://tapas.io/series/Transcripts)\n\n\n##Buy [Transcripts](https://www.amazon.com/dp/1980714193) and [Transcripts: Zero](https://www.amazon.com/dp/B07ZPVQTP9)  on Amazon!",
                "comments": [
                    {
                        "author": "squigglestorystudios",
                        "comment": "Hello everyone! \nSorry to keep you waiting! I had originally intended to post last weekend but, shrug life ya know, so! Extra updates today! In fact I plan on doing a 3/4-post every weekend, when life allows. I have also been enjoying the warm welcome back, I had honestly thought my story had been forgotten over the last two years but it warms my heart to know people are still eager for updates, I only hope it lives up to the wait!\n\nFor book 5, I was writing with extreme burnout and stress, so I decided to fit as much as I wanted to into the story so that once it was finished I could walk away happy. The pace is much faster then the other novels but I didn’t want to leave you guys hanging with unanswered questions!\n\nSpecial thanks to u/Fontaigne , u/Alsee1 and everyone who helped with detailed grammar and spelling comments, Dyslexia is frustrating as heck!\n\n(PS. Kalijorn is supposed to be non-binary so any ‘he/hims’ that pop up, let me know and i’ll fix it!)",
                        "published_at": 1737732638.0,
                        "likes": 37,
                        "subcomments": [
                            {
                                "author": "Wooper160",
                                "comment": "For a civilization that reproduces via cloning its surprising there’s any gender, mating, or romance at all.",
                                "published_at": 1737736670.0,
                                "likes": 15
                            },
                            {
                                "author": "DRZCochraine",
                                "comment": "Gonna say it again, great to have you back!",
                                "published_at": 1737733879.0,
                                "likes": 8
                            },
                            {
                                "author": "kitolz",
                                "comment": ">I had honestly thought my story had been forgotten over the last two years\n\nNo way, this story lives rent free in my head!",
                                "published_at": 1737735258.0,
                                "likes": 7
                            },
                            {
                                "author": "mechakid",
                                "comment": "Worth the wait! The quality of your writing is top-notch, and the characters feel very organic, precisely as they should.\n\nBe proud of your work.",
                                "published_at": 1737735807.0,
                                "likes": 6
                            },
                            {
                                "author": "Alsee1",
                                "comment": "u/squigglestorystudios good work, both on this particular narrative and accuracy. I only caught a single minor grammar fix: they *~~was~~* ***were*** really only\n\nI am however a bit puzzled and surprised by the 15 year travel time to earth? Everything around it sounds so completely off that I wonder if some error or misunderstanding slipped in there?\n\nWhile it is of course possible that the 'bad guys' shipped the humans an unlimited distance under cryostasis, I find it hard to imagine why they would have been cryo-shipped for so many years. Second, Councilor Kaalijorn seems to refer to it casually like 'merely' 15 year journey. And then, for the humans in general, this revelation pretty much says you're never getting home... and even if they did spend 15 years running at max speed then everyone they knew would be either dead or 30+ years older. And in particular, Jasmine apparently (and apparently quite casually) seems to suggest deferring to a proper diplomat summoned from Earth? Am I missing something?",
                                "published_at": 1737778286.0,
                                "likes": 5
                            }
                        ]
                    },
                    {
                        "author": "literallyjustsomeguy",
                        "comment": "Quite the first impression to make. I love how everybody is sweating about this meeting for different reasons. Nako due to realizing he can't strong arm Beau. The councilor realizing just how out of depth they really are. Also that bomb they dropped about the relationship between the arvas imperium and the council. You're doing a great job at hyping me up for what's to come",
                        "published_at": 1737735755.0,
                        "likes": 17,
                        "subcomments": []
                    },
                    {
                        "author": "Wooper160",
                        "comment": "Wow that contact could have gone better. \n\nThough it could have also gone worse, the councillor is at least still more or less intact even if their attendants are all freq fried. \n\n15 years away? Geez we knew they’d been under for some time but that’s a far way to go if they’re going to visit Earth and we still don’t even know if it’s still there Fighting, Sterilized or Enslaved.\n\nWe can hope the Rajava are leaving it as a biological preserve for natural grown genes since it seems the Council have forgotten that’s even a thing.",
                        "published_at": 1737737032.0,
                        "likes": 11,
                        "subcomments": [
                            {
                                "author": "simon97549",
                                "comment": "I wonder if that 15 isn't a typo. Having earth be on the other side of the galaxy seems like it is out of scale for this story.\n\nAnd the characters seem to think that 15 years is not a lot but... 15 years of travel time? That is quite far.\n\nPerhaps 15 lightyears?",
                                "published_at": 1737758142.0,
                                "likes": 3
                            }
                        ]
                    },
                    {
                        "author": "mechakid",
                        "comment": "Perhaps Jasmine should relate the story of the Battle of Camlann.\n\nAccording to legend, when Arthur and Mordred met to negotiate peace, a knight drew his sword to defend himself from an adder, thus starting a battle that would claim the lives of nearly all of the Knights of the Round Table.\n\nThis story should be told to both Beau and the councilor, as a warning not to destroy everything for a misunderstanding. Maybe then, they can make a new start with open honesty.",
                        "published_at": 1737736330.0,
                        "likes": 10,
                        "subcomments": [
                            {
                                "author": "raziphel",
                                "comment": "Though the councilor was polite and civil, they were threatened with what was undoubtedly an unfair and wildly unbalanced contract. Even disregarding the morality of cloning, Beau was right to turn the tables (with psychic force and the threat of physical force), to ensure that further negotiation could occur on a more equal footing. That the councilor underestimated the humans is their fault.\n\nThe law is a measure of power. Nothing more. Civil bullies are still bullies.",
                                "published_at": 1737840733.0,
                                "likes": 3
                            }
                        ]
                    },
                    {
                        "author": "Exiled-Traveler",
                        "comment": "So the imperium definitely recieved a larger bargain than expected,\nHonestly this probably explains why nakos benefactor is furious with him, if they were aware of what the Rajava were carrying at least.\nGuess we shall see what nako takes from the councilor admissions, and whatever consequences spawn from this discussion.",
                        "published_at": 1737736312.0,
                        "likes": 9,
                        "subcomments": [
                            {
                                "author": "mechakid",
                                "comment": "It speaks to Nako's foresight that he took the humans under his protection. The problem now, though, is that he seriously miscalculated just how strong the humans were.",
                                "published_at": 1737736518.0,
                                "likes": 11
                            }
                        ]
                    },
                    {
                        "author": "RandomBritishGuy",
                        "comment": "Just wondering, how does Itsuki know where the solar system is in the milky way?\n\nWe don't have any actual pictures of where we are or the Milky Way from a top down view (those are all CGI, or pics of other spiral galaxies), since we can only look sideways into it, as only a couple of probes have ever even got slightly out of the solar system itself.\n\nMaybe he could have got a glimpse somewhere else on a ship after he was abducted, but otherwise we'd have no way of figuring it out.\n\nOr he could have one of those pulsar map tattoos, that have earth at the centre and lines leading out which show the direction, distance, and pulse frequency if nearby pulsars. That could narrow the location down? I think it's based on the plaque that was in the Voyager probe.",
                        "published_at": 1737736543.0,
                        "likes": 9,
                        "subcomments": [
                            {
                                "author": "overlord1305",
                                "comment": "The artist representations are accurate- though I'm not sure about the half of the galaxy we can't see. Still, as long as you know how to orient the galaxy, finding the Orion spur is easy.\n\n\nNarrowing it down within the spur is the hard part. Yeah, dunno about that... the most realistic way would be if he had a picture saved on a phone or something.",
                                "published_at": 1737754777.0,
                                "likes": 5
                            },
                            {
                                "author": "kaian-a-coel",
                                "comment": "You can orient yourself with the magellanic clouds too.",
                                "published_at": 1737904579.0,
                                "likes": 2
                            }
                        ]
                    },
                    {
                        "author": "Makyura",
                        "comment": "Wow for the first time I vehemently disagree with the main characters genetic modification is not an absolute taboo nor should it be. Beau really needs to screw his head on straight as well",
                        "published_at": 1737776712.0,
                        "likes": 6,
                        "subcomments": [
                            {
                                "author": "raziphel",
                                "comment": "Nah. Beau was right. They would have been well-kept and unrewarded slaves.",
                                "published_at": 1737840826.0,
                                "likes": 4
                            }
                        ]
                    },
                    {
                        "author": "mctrump",
                        "comment": "Is nobody going to address how the councilor was trying to pin financial responsibility of the destruction caused by escaping abductees... upon said abductees?\n\nNext meeting should start something like:\n\nJasmine: Before any further proceedings occur, the Galactic Council must first acknowledge two important details. First, that Beau and Itsuki bare absolutely no financial responsibility to Kyu-Kage corporation and that Kyu-Kage is the sole liable party to all destruction incurred during their escape. Second, that Kyu-Kage corporation shall be held responsible for financial reparations to Beau and Itsuki to the tune of one hundred years of contribution credits each.\n\nCouncilor: What?\n\nJasmine: One hundred and ten years each.",
                        "published_at": 1737844712.0,
                        "likes": 4,
                        "subcomments": []
                    },
                    {
                        "author": "kaian-a-coel",
                        "comment": "Presenting a 15 years journey as \"mercifully short\" is baffling. A single round trip would take an entire alien lifetime. Even for humans, thirty years is a long time. How can Jasmine be relieved knowing that she would be setting foot back on earth in the late 2040s at the earliest? Her parents, all of her older relatives would be dead. Everyone she knows now a generation older. It's a horrifying thought.",
                        "published_at": 1737904900.0,
                        "likes": 4,
                        "subcomments": [
                            {
                                "author": "Chroniclyironic1986",
                                "comment": "I had that impression as well. But after thinking about it, Jasmine had already given up any hope of seeing friends or family again, and now that the location and [relatively] short distance to Earth is known i think she is just happy that the responsibility of negotiations for the autonomy of our entire species may not have to fall to her alone.",
                                "published_at": 1738095649.0,
                                "likes": 5
                            },
                            {
                                "author": "HaniusTheTurtle",
                                "comment": "It's less that it's \"only\" fifteen years, and more that it's possible to return *at all*. Jasi had accepted that it was impossible for her to ever see Earth again. Compared to that, fifteen years of travel is infinitely better. Not *great*, but more than the nothing she had before.",
                                "published_at": 1739484219.0,
                                "likes": 3
                            }
                        ]
                    },
                    {
                        "author": "GrumpyOldAlien",
                        "comment": "Yay for more Squiggly goodness!",
                        "published_at": 1737773777.0,
                        "likes": 3,
                        "subcomments": []
                    }
                ],
                "shares": 0
            },
            {
                "title": "Things Every Educated 21st-Century Person Should Know but that Most People Don't?",
                "url": "https://www.reddit.com/r/slatestarcodex/comments/nw2b1v/things_every_educated_21stcentury_person_should/",
                "score": 323,
                "comments_count": 319,
                "author": "SoccerSkilz",
                "created_utc": 1623262128.0,
                "selftext": "I was recently watching a college lecture where the professor prefaced a discussion of game theory with \"and the concept of a prisoner's dilemma is one of those things I am confident saying you are not an educated person in any meaningful sense if you have never taken the trouble to understand or learn it. The idea that we can map out the conditions under which cooperators will defect given individual incentives, even despite the fact that the collective incentive can be to cooperate for a higher payoff, is so fundamental to understanding the problems of the 21st century (like Climate Change) that I think it's only fair that we set our bar/expectations for the educated person high enough that they would know this enough to be able to act on it.\"\n\nThis got me thinking: what is your list (or solitary individual entry for what could become a larger list) of things every 21st Century person who likes to think of themselves as having achieved a serious education should know, but probably doesn't? I say \"probably doesn't\" because a list of what an educated person should know in general would be too long and (for the most part) too obvious for my purposes here (i.e. please don't say something like \"the earth orbits the sun\"). I also want people to emphasize knowing things that are considered groundbreaking in their respective fields and that may even have a practical or important connection to a larger issue, particularly the larger issues that we will be counting on the \"educated (but common) person\" to address in this century.\n\nPick any discipline you want, but try to meet my criteria. Here's mine! (A list like this is bound to sound opinionated and self-congratulatory because it's an attempt to list the things you think you already know but that many others don't, but for the same reason that the \"rationalist\" community has chosen a vaguely positive adjective for itself, and only aspirationally rather than narcissistically, I want you to put aside the self-conscious worry that you sound self-indulgent and just do your best to outline the greatest ideas an education can impart for someone aspiring to a true education)\n\nThese are not in any particular order from most to least important, but more \"what occurred to me first,\" and it is bound to be horribly incomplete or include things it shouldn't--that's where you come in!\n\nHere goes nothing:\n\n1. **Graham Oppy's concept of rational belief-formation as a process of  \"worldview comparison\"** where people follow the following dictum as strenuously and honestly as possible: \"the purpose of a belief, and the worldview beliefs make up, is to explain a maximum amount of data with a minimum of theoretical commitments.\"  \n\n(He reconciles this with the idea of non-referentially justified, properly basic beliefs, for any philosophy buff who is concerned that this statement is too broad note that he encourages a spirit of minimalism but not nothing-whatsoever when it comes to parsimony and Occam's razor)\n\n2. Adding to that, **Bayes Theorem,** and if not the whole theorem with every bell and whistle in mind, then at least the basic idea that you should estimate the likelihood of something based on a careful combination of 1. asking yourself what the world would be like if this idea was true, and comparing the world we actually live in with that world, and 2. the notion that a \"prior\" can exist independent of the evidence or hypothesis presenting itself to us in a given situation that should inform the outcome of our probability assessment. \n\n(If I am mutilating the theorem, please let me know so that I can correct it and become more of an educated person!)\n\n3. The fact of the **availability heuristic** and other relevant **cognitive biases** that leave us vulnerable to a knee-jerk pessimism about the world in general (or at least having the wrong policy priorities, regardless of where you come down on the optimism and pessimism debate). A poll in 2016 found that most American voters cited \"terrorism\" as the #1 greatest threat to American life at the time of the presidential election. \n\nI want to offer an alternative to this tendency to estimate probability based on imaginability rather than the frequency of real-world occurrences with Steven Pinker's notion of \"informed, rational optimism,\" which argues that news media follow a policy of \"if it bleeds, it leads\" that distorts our perception of just how hopeless things are and implicitly encourages a jaded, nihilistic, \"eat drink and be merry for tomorrow we die\" or \"take a wrecking ball through the 'establishment,' erase it and start over because nothing is working (what 'drain the swamp' turned out to mean in practice)\" attitude. \n\nHow many times have you heard that the world is just getting worse and worse and worse on every metric relevant to progress, that our best days are behind us, that if only we could return to year X things would be so much better? Often, Franklin Pierce Adam's quip that \"nothing is more responsible for the good old days than a bad memory\" is vindicated by our tendency to become amnesiacs with respect to progress achieved, once it has been achieved, and neurotics with respect to progress still yet to be attained. This is married in a gross symbiosis with our tendency to expand the definition of our words for progress to reflect our moral deficits by virtue of our moral gains: \"bullying\", \"assault\", and so on (and I'm not complaining about the intentions, obviously, but their unintended effects) have followed a pattern of us mistaking our rising standards for our plummeting conditions. \n\nCombine this with the fact that progress generally follows the law of the accumulation of marginal gains, and you have a recipe for an incorrigible pessimist. The news is about what happens, not what doesn't happen, and the worst things happen suddenly, but the best things happen gradually. A single downtick in an otherwise stable trend of progress is \"news\" because it is \"new,\" and a reporter never says \"I'm here reporting live from a country that hasn't broken out in civil war.\" The breakneck rapidity and inherent, cyclical amnesia of the \"news cycle\" blinds us to the steady accumulation of gradual successes and small victories that have made the convenience, amenities, increasing richness and safety of modern life possible. \n\n\"Max Roser points out that if news outlets truly reported the changing state of the world, they could have run the headline NUMBER OF PEOPLE IN EXTREME POVERTY FELL BY 137,000 SINCE YESTERDAY every day for the last twenty-five years... In 2000 the United Nations laid out eight Millennium Development Goals, their starting lines backdated to 1990. At the time, cynical observers of that underperforming organization dismissed the targets as aspirational boilerplate. Cut the global poverty rate in half, lifting a billion people out of poverty, in twenty-five years? Yeah, right. But the world reached the goal *five years ahead of schedule*. Development experts are still rubbing their eyes. Deaton writes, 'This is perhaps the most important fact about wellbeing in the world since World War II.'\" -- Pinker, Steven. Enlightenment Now (pp. 88-89).\n\nWell, resources like [ourworldindata.org](https://ourworldindata.org) or Pinker's book *Enlightenment Now: The Case For Reason, Science, Humanism, and Progress* reply by saying there is a rigorously quantitative and empirical way of addressing this question that identifies the spheres of human progress and awards points to each side (optimism/pessimism) based on *actually counting.* 175 graphs on everything from measures of physical health/mortality, violent crime, and accident deaths to subjective but operationally defined things like life-satisfaction, happiness, boredom, and a sense of meaning and purpose will help you realize that, regardless of where you come down on this debate, there is a far more evidence-based and subtle way to have it.\n\nIt should go without saying that none of this is to say that progress is inevitable, that progress is happening fast enough, or that progress will happen on its own without a rigorous and constant exertion of the systematic forces that have made it possible. It is also not to relieve us from individual and collective responsibility, as one existential catastrophe is all it takes to wipe out the gains of humanity in a relatively short period of time. So, my ideal of the educated person should have some intellectual permission to be optimistic, but none whatsoever to rest on the laurels of success or become negligently self-satisfied.\n\n4. **The causes, correlates, and consequences of the decline of all kinds of human violence throughout history.** Now, to be absolutely clear, I am only referring to what explains declines of violence *when they actually happen;* I am not endorsing Pinker's view that the *entire* story of human history is one long decline (with a few interruptions/upticks/rouge data points in an otherwise clear trend running back to even the hunter-gatherer pre-agricultural era) of violence, although I think reading The Better Angels of Our Nature was one of the best things I have ever done for my appreciation for the importance of thinking about violence in a rigorously interdisciplinary way (he ambitiously integrates the sociology/neuroscience/human behavioral biology/psychological adaptationism, a term I prefer to evolutionary psychology but which I understand is controversial/history/game-theoretical/and economic lenses on human violence and deviant behavior). \n\nThese are essential because if we know what we have done well, we can continue to deliberately deploy the known causes of the decline rather than reinventing the wheel or retrying solutions with a checkered and discrediting history.  For example, Pinker addresses the following religious and conservative theories in a huge discussion of the European homicide decline with the following thesis: \"Do you think that city living, with its anonymity, crowding, immigrants, and jumble of cultures and classes, is a breeding ground for violence? What about the wrenching social changes brought on by capitalism and the Industrial Revolution? Is it your conviction that small-town life, centered on church, tradition, and fear of God, is our best bulwark against murder and mayhem? Well, think again. As Europe became more urban, cosmopolitan, commercial, industrialized, and secular, it got safer and safer.\"\n\n5. **Robert Sapolsky's impressively interdisciplinary model for analyzing and explaining human behavior** (which he sets out in his monumental book *Behave: The Biology of Humans at Our Best and Worst*, which develops and responds to many of the ideas Pinker lays out in *Better Angels).* In this book, Sapolsky integrates several disciplines in the effort to explain our worst behaviors, such as the worst kinds of human violence. (Although the benefits of this book go far beyond just addressing the same issues I broached in #4.) \n\nTo me, this book is really just an ode to the modern synthesis of neuroscience, endocrinology, psychology, evolutionary biology, genetics, game theory, and more as an attempt to explain and characterize human nature with a scientific visual aid. He charts out the steps of explaining behavior from: one second before (neuroscience), seconds to minutes before (psychology), hours to days before (emphasizing things like endocrinology), days to months before (more on human behavioral biology), years before (the influence of prenatal and perinatal events on life outcomes and personality), centuries to millennia before (genetics, evolutionary biology, evolutionary game theory). This is, by definition of being on this list, one of the best books I have ever read and I cannot recommend it more emphatically.\n\n6. **Edward Wilson and C.P. Snow's idea of Consilience, or the unity of knowledge:** the idea that the disciplinary divisions that separate fields of knowledge say much more about the logistical limitations of our universities and institutional knowledge than it says anything about the nature of the real world which science and academia attempt to understand. This merges nicely with Sean Carrol's idea of emergent naturalism (also \"poetic naturalism,\"), which arranges each field of study into a hierarchy of \"most fundamental to least fundamental\" but not \"most important to least important.\" \n\nFor example, history could be thought of (and in the opening chapter of Yuval Noah Harari's *Sapiens* he embraces this framing of history) as the level of analysis that comes after physics, chemistry, biology, and anthropology have told their stories and assumes the existence of humans and cultures that change. Each discipline sits on the shoulders of the other giants, but that is not to say that any are less important than the others or somehow less valid. For example, imagine trying to explain the causes of WWII in terms of quarks and the position,  velocity, spin and magnetism of every particle in the universe. It wouldn't be a clarifying analysis, even if it would ultimately be true in its own way.\n\n7. **The integrity of psychometric operational definitions, the measurability of allegedly infinitely idiosyncratic and subjective traits like intelligence and personality.** I.e. the predictive validity and stability of assessments of intelligence like IQ, particularly along Howard Gardner's theory of Multiple Intelligences. The idea that there are special cognitive niches or specialties, and they are generally correlated so that a specialist in the 99th percentile on one is also likely to be a generalist in the 50+ percentile on the others. *Visual spatial sense:* sense of space and intuitions about distance, an ability to extrapolate geometrical patterns and intuit the progression of an object that changes according to a rule-governed sequence. *Quantitative/Mathematical:* I'll let you guess. *Verbal/Linguistic:* facility and fluency with language, the ability to express oneself articulately and clearly, the ability to quickly define words in contrast to their antonyms and, more challengingly, to their synonyms, (and there are many others, like Memory and Processing Speed) etc. \n\nAs for personality, some sense of the Five Factor Model of Personality would be helpful, as well as a basic survey of the evidence for organizing personality along five (or so) major dimensions (**O.C.E.A.N.**: Openness to Experience/Closed, Conscientiousness vs Impulsivity, Extraversion/Introversion, Agreeableness vs Antagonism, Neuroticism vs Emotional Stability). These are essential to the educated person's toolkit because they help us speak with a richer vocabulary when explaining why it is that people vary in their talents and dispositions, which is going to be important if you ever find yourself needing to interact with people and cooperate toward a complex goal, or build a team to solve a problem or realize an entrepreneurial idea. \n\nBut most importantly I think it is crucial that people become disabused of the idea that personal qualities and intersubjective traits like personality and intelligence are these amorphous, impenetrable concepts that could never be meaningfully measured or described with operational constructs. If you want to believe that, then go ahead, but also note that it is largely by endorsing and exploiting the psychometric worldview that corporate juggernauts like Google, the modern landscape of data-science-based advertising, and Amazon's ingenious personalized-preference-modeling have been able to rake in an unfathomable amount of money and now exert arguably more influence on the dynamics of our present day than entire countries. You are being molded, shaped, and influenced constantly by a lifelong process of psychological collation and quantification; how much more pliant and ideal a target you will be if you do not have a sense of the forces that are arrayed against you or the methods they are using to achieve unprecedented levels of consumer control. \n\nThe psychometric worldview is also essential because it allows for actuarial and algorithmic prediction making for life outcomes we care about (like earning potential, marital satisfaction, criminal recidivism, who we should parole and who we shouldn't, whether there is any point in keeping violent criminals in jail beyond the age of 42 + or - 5 years).\n\n8. **The consequentialist/utilitarian framing of justice as an antidote to that great legacy of religious traditionalism, the retributive theory of justice,** which I want to (somewhat facetiously) characterize as \"the idea that there is a cosmic scale of rights and wrongs that gets thrown out of balance by wrongdoing, and which only a righteously deserved PUNISHMENT can restore to its former graces.\" This \"punitive,\" deontological, punishment-for-punishment's sake attitude is the ultimate sentimentalization/moralistic bias, and in practice falls pretty squarely into the contrast between the empirical, evidence-based view of public policy and criminal justice and the knee-jerk, gut-feeling, sanctimonious fetishism of so much of contemporary society.  I'll let you guess which I think is which.\n\n9. **The Selfish Gene:** Defended, reimagined, and popularized by Richard Dawkins, the gene-centric view of evolution that emphasizes that the level at which evolution by natural selection takes place is the level of the gene, as opposed to individual-organism-level framings or (worse still) for-the-good-of-the-species framings. As an aside, people who are quick to dismiss evolutionary psychology are just as likely to pretend to have read this book, in my experience, which is odd because I would consider it one of the greatest works of evolutionary psychology (although it is obviously much, much more than that).\n\nEdit: ~~As promised, I will pick up where I left off with 10:~~\n\n**10. The Utilitarian, Quantitative analysis of public policy,** which despite its nerdy aura is the morally enlightened one because it treats all people as though they have equal significance relative to the outcomes. Along with this I would add the general (and deliberately vague, but still no less essential) orientation of our public policy debates around \"Do the Overall Benefits Outweigh the Overall Costs?\"; \"Has a gradual process of experimentation and representative comparisons demonstrated the benefits of this proposal, or are there likely to be unintended consequences at scale?\"; \"How does this compare with the available alternatives, and have we taken sufficient care to lay these out before endorsing a greater of two goods or a lesser of two evils?\"; \"What is the final, net outcome of this policy likely to be, and if we cannot even begin to answer this question should we continue to entertain it?\" That is, the opposites of questions like \"but does this fit my moralistic, deontological idealization of what my gut feelings and twitter sloganeering tell me is important? Is this exactly and unpragmatically what I want in exactly the way that I want it?\"\n\n**11. The Myth of Pure Evil:** The ideas that Jonathan Haidt lays out in his *The Righteous Mind: Why Good People are Divided by Politics and Religion.* That there is such a thing as different political personalities to which our biology and cultures predispose us (not in the outlandish sense of the body following a developmental program via our DNA to synthesize our party registration out of thin air, whatever that would mean, but in the sense that we can inherit general temperaments that motivate overall attitudes toward moral and political questions, or at least patterns of group-affiliation that will land us in cultural milieus that endorse certain political and moral ideals, i.e. urban living and college-attending partially as a consequence of high openness to experience vs. rural living and staying local as a consequence of less openness and more traditional feelings toward familial and community loyalty), which can cause us to assign different moral weights to the various \"moral foundations\" that motivate our social and political priorities. In other words, the idea that when someone disagrees with you politically, it may not be so much a reflection of their sadistic, unfeeling, sociopathic disregard for Truth and Goodness, but a recreation of the reasons you believe much of what you believe (beliefs as a loyalty badge, a social signal, an aspect of social belonging, and an outgrowth of different moral intuitions, etc.).\n\nEdit 2: ~~some others that I want to elaborate on with a blurb as I have been doing so far but don’t have time for right now. I thought I may as well include them so I remember to do it later:~~\n\n**12. The environment of evolutionary adaptedness** The idea that the traits we evolved are largely the product of evolution by natural selection in an ancestral environment that is very different from the world we live in today, helping to explain many of the puzzles of why we have the quirks we do and suffer from so many incompetencies that are deficits in the world we live in today (like many forms and severities of ADHD) but were likely things working “as intended” in the past, which may be an inspiration for some compassion for people who don’t fit into the bizarre and evolutionarily remote world we find ourselves in now and for which we were not \"designed\".\n\n**13. Effective Altruism** [The fact that](https://www.ted.com/talks/will_macaskill_what_are_the_most_important_moral_problems_of_our_time/footnotes?language=en) the difference between the least effective charities and the most effective charities is an enormous, oceanic difference, and that there are empirical/evidential ways of determining [which is which](https://www.givewell.org/charities/top-charities). The fact that charity is not necessarily a false solution to contemporary problems, and that individual giving can actually change the world if directed according to the priorities of data science rather than the priorities of our gut-feelings and folk moral psychology. \n\nI.e., the fact that a donation till with the face of one pitiful, hungry child receives several times more charitable contributions than a till emblazoned with five pitiful, hungry children. Or the fact that anti-milarial netting, as unromantic a solution as that may seem, is generally exceptionally more effective than more melodramatic or cute journalist-bait “solutions,” [like the now-infamous and celebrities-including-f**ing-Beyoncé-endorsed merry-go-round water pumps](https://en.m.wikipedia.org/wiki/Roundabout_PlayPump) that turned out to complicate the logistics of pumping water in needy African villages, were not in fact an improvement on the cheaper and more cost-effective conventional water pumps, and quickly became yet another source of drudgery for the globally poor, with teams of women rather than the intended children at play arduously pushing the carousels in what looks like a distinctly not-fun process, the recreational implications of the [flowery, bright red-and-green-pastels](https://lh3.googleusercontent.com/proxy/6KSBubX_qx_EgFaSd_k_8KvWPl2RbdQv8qDvwvZWYP5JXu5A4NKw-40QWUqp6SjnGouFYE9C4Q_bRI5ntwbFDI5n7w0NUx-h9v3DGPa2y1W7EJ7VWpMpcqFk_B1y6nyRXXYWcKzRTpmcw6MCior9nQJxJAnsbUs) just adding a moral insult to an economic injury). \n\nYou really have to see it to believe it. It’s so awful it’s almost morbidly funny, or it would be if it weren’t for the depressing facts surrounding it and the fact that [it’s still going strong a decade and much-scathing-criticism later.](http://www.playpumps.co.za)\n\n~~And I can tell I should add something on the following three but need to get some sleep first before being back at it tomorrow!~~\n\n**14. The Revolution of Behavioral Genetics** The fact that \"Nature and Nurture\" are alternatives of degree rather than alternatives of kind (a difference of degree being the answer to \"how much?\" and a difference of kind being the answer to \"whether at all?\"). It is actually logically impossible for a trait to be \"purely biological,\" because DNA is just a biological program that specifies a developmental process within an environmental venue, and cannot specify that process down to a perfect, literally replicating level of precision (that is, even genetically identical monozygotic twins will have neurological differences, because although their bodies followed the same genetic program to achieve a developmental outcome, that program could not specify the precise location of every neuron and the other cell-types that compose the brain down to a square nanometer-for-square-nanometer replica. \n\nAs a result, the Lady Luck of chance variation has her way with the remaining details, and that's saying nothing about the many monozygotic twins who nevertheless do not share a placenta, inviting even more environmental differentiators into the mix!). Moreover, \"influenced by biology\" does not mean \"created by biology\" but rather \"organized in advance of experience and exposure.\" Biology is often the container, and culture is the content. You are prepared by the biology for a lifelond process of experience. \n\nBut just as there can be no biology without culture, there can be no culture without biology. What would it even mean for sex differences to be \"purely cultural,\" for example? If they are writing on a blank slate, then there at least has to be a slate to write on; that is, a central nervous system to be informed by the experiences that are allegedly responsible for any and all non-superficial differences. This runs into a kind of \"infinite regress problem,\" where we explain the competitive aggression of men in terms of a cultural transmission of the competitive aggression of men from some earlier society with those values, arbitrarily assigned to men at a coin-flip or deliberately for the pursuit of power (no one asking why, if there are no inherent differences, it could not have been generally the other way, with women making the decision as to who would inherit that particular \"original sin\" once and forever defining posterity according to an arbitrary ancestral edict), inviting the question \"well where did that come from?\" in the face of which the radical environmentalist must defer to another cultural transmission from some yet earlier society, who themselves were informed by some earlier society, who themelves were informed by some earlier society...   \n\nFurthermore, the emerging science of behavioral genetics has upended our folk intuitions about nature and nurture, challenging even the notion that parenting styles determine lifelong outcomes in personality and intelligence and greatly de-emphasizing the importance of the \"shared environment\" (as opposed to the unshared environment and genetic endowments) in explaining individual differences (I recommend Judith Rich Harris's monumental *The Nurture Assumption* for a survey of the evidence of this maturing field of study). \n\nIt has often been said that parents who read books to their children at night and line the shelves with the classics of the English literary cannon are bound to have masterfully articulate children; but all of this was assumed regardless of the fact that a set of parents who take the trouble to enrich their child's environment are likely highly industrious people by temperament, and are also highly verbally fluent to have a fascination with books in the first place. Small wonder their child turns out to be a natural in English class! \n\nPeople often wonder how something like vocabulary could be a high indicator of general intellectual ability, or why it is strongly correlated with mathematical and visual-spatial reasoning, because it seems to reflect the richness of one's environment rather than inborn aptitudes; but it turns out that verbally precocious youth will simply pick up and retain words faster, understand them in an intuitive and flexible way, intuit their relationship to others extemporaneously and do not have to be shepherded through Vocabulary 101, and seek out reading material and latch onto terminology by virtue of the sense of intellectual need that is provoked by a preponderance of intellectual ability (you will generally wish to flex the muscles that you have). \n\nBut does this mean we should be depressed and fatalistic and give up on parenting? Well, first of all, parenting is about creating a relationship, not a person! The overbearing obsession with bombarding kids with Mozart in the car and chess club after school (even after they complain about it) so that they will grow up to have high intelligence is unhealthy and scientifically misguided. Only newlyweds thinks that they can change their spouses; the purpose of the relationship is love, not to strive to micromanage their innermost and stable and largely inherent qualities. But, second of all, the punchline of the revolution in behavioral genetics research is that the role of the [shared environment](https://dictionary.apa.org/shared-environment) as opposed to the [nonshared environment](https://dictionary.apa.org/nonshared-environment) has been exaggerated, not that the environment does not matter. Peer groups are extremely formative, for example, and parents still have considerable control over that. \n\nI would also like to emphasize the importance of understanding the significance of the existence of cultural universals as an insight into the nature-v-nurture discussion. One legacy of the behaviorism movement in psychology was the idea that language has no innate structure, that we are born with blank slates, that everything is a product of experience, and that if the slate is blank you might as well grab a pen (leading to some pretty bizarre parenting advice and a massive overstatement of the potential of public policy to engineer every social outcome we can fondly imagine). Noam Chomsky replied with the single most influential book review ever written as an undergraduate at the University of Pennsylvania with his theory of universal grammar, whereby he demonstrated that children acquire language with the aid of a bevy of inborn, biologically predisposed devices that are culturally universal. \n\nFor example, all children are born with the capcity to make the rudimentary phonetic sounds that are employed in various languages, with toddlers playfully trilling and rolling their \"r's\"; culture, however, prunes this down into a useful set of linguistic building blocks by signaling to the developing brain that hears their chattering parents whether the \"r-trill\" is essential to their language or not: if not, the ability usually vanishes, and may be difficult or impossible to reacquire in adulthood. If a trait can be found in all cultures of any significant size, especially those that have been insulated and isolated from contaminating influences (in the scientific sense of making the identification of causes and effects ambiguous), then it stands to reason that there is a substantial biological component to the trait (hold the environment constant, and if you still see differences, the genes are at least partially responsible, and vice versa; I say partially because in practice you can never hold the environment constant). \n\nWhat is so terribly interesting is that we have found far more cultural universals since Chomsky wrote his earthshaking debut in the field of linguistics. It was once thought that human emotions are culturally idiosyncratic and non-universal, or that facial expressions have far more differences than similarities and do not generally correspond to the same emotions cross-culturally. This has been flatly refuted by a massive raft of scientific evidence. Anthropology, once a field scandalously committed to exaggerating the fundamental uniqueness of different cultures as a convenient source of dissertation-fodder, has now begun to embrace the litany of similarities. Donald Brown published one of the most widely-referenced lists of cultural universals, from which I have excerpted the following:\n\n\"the existence of and concern with aesthetics, magic, males and females seen as having different natures, baby talk, gods, induction of altered states, marriage, body adornment, murder, prohibition of some type of murder, kinship terms, numbers, cooking, private sex, names, dance, play, distinctions between right and wrong, nepotism, prohibitions on certain types of sex, empathy, reciprocity, rituals, concepts of fairness, myths about afterlife, music, color terms, prohibitions, gossip, binary sex terms, in-group favoritism, language, humor, lying, symbolism, the linguistic concept of “and,” tools, trade, and toilet training.\" [The real list is considerably longer.](https://condor.depaul.edu/~mfiddler/hyphen/humunivers.htm)\n\n15. **The Unmerited Nature of Meritocratic Success:** The great winners of the 21st century will be meritocrats. Exceptional, technically gifted, luminously brilliant, zealously hardworking meritocrats. They will also be the winners of various genetic and environmental lotteries: nobody chooses their parents, which prenatal hormone exposures occur throughout their mother's pregnancy, whether their early childhood environment is characterized by high levels of stress and a general absence of a varied and stimulating, intellectually enriched environment, and nobody chooses their genes. \n\nThere is no escaping the fact that conscientiousness, the personality trait which underlies industriousness and a general temperamental pressure to strive, and which at its extremes becomes an unforgiving call to perfection, is a highly heritable trait that is also likely a highly inherited trait (heritability being the explanation of differences or variations in human traits in the general population in terms of the contribution of genes from parents to offspring, and inheritance being the endowment of individual characteristics to individual children through biological parentage; for both of these measures of implicating biology, there is an enormity of evidence that conscientiousness has a substantial genetic component: parenting and adoption studies, and genome wide association studies that have become possible in the last two decades by virtue of the comprehensive mapping of the human genome). \n\nBut you may reject this evidence and prefer instead to say that hard work and intelligence (to the extent that we have been able to measure it in a standardized, statistically normalized way) are purely environmental. Even that would not give a foothold to the false ethic of our meritocratic culture, because no one chooses their early childhood and prenatal environments, and even later few people can change the likely environmental culprits without opposing external forces lending a hand (like sane egalitarian, utilitarian, and empirical public policy) that account for the variability of intelligence between individuals. \n\nThis is not to say that we should no longer reward hard work, or allot social prestige to the winners of competitive enterprises, or prefer an average surgeon to a peerless extraordinaire, but it does mean that we should foster a spirit of humility in our elite culture, discourage class-insulation, break up insulated pipelines to institutionally guarded success (as with the five American zip codes that make up a substantial contingent of the undergraduate class at Ivy League and other elite universities), and, crucially, follow out the obvious ethical implication that it is wrong to force someone to live with the consequences of events outside of their control. \n\nThat is to say, improve the external factors that we can improve which account for the predictive advantages differential psychology research has unveiled, and improve the conditions of people who are simply not talented enough to make it (rather than setting a bare-minimum floor, like \"here's enough not to starve, but good luck with your rotting teeth and horrendous chronic orthopedic problems that nevertheless call for elective and uninsured healthcare interventions\").\n\n**To Be Continued At Some Point Today or Tomorrow:**\n\n16. **Anti-Fragility:**\n\n17. **Hedonic Treadmill:**\n\n18. **Network Theory:**\n\n19. **Reciprocal Altruism:**\n\nThis list is getting a little long; I will come back later to add things, but I skipped lunch to write this! Anyways, I think this will be enough to get the ball rolling. Tell me what you think in the comments!\n\nEdit 4: \n\n[Cross-posted from my blog](https://jonahfranks.blogspot.com)\n\n**With so much interest in these topics and such a variety of interesting opinions in the comments, I have decided to create a YouTube channel under my real name where I will script and produce a series of videos on each of these ideas if people continue to indicate their interest in prepared content like this or if I receive a few channel subscriptions so that I know I won't be talking to myself :p** [Please check it out here and subscribe if you would like to see a video version of this!](https://www.youtube.com/channel/UCikrin9KBbf8Tt4leOEWaXw/featured)",
                "comments": [
                    {
                        "author": "yldedly",
                        "comment": "Basic economics concepts like prices being set by supply and demand, elasticity, comparative advantage, effects of taxation and subsidies, efficient market hypothesis, are shockingly poorly understood by most people.",
                        "published_at": 1623264683.0,
                        "likes": 177,
                        "subcomments": [
                            {
                                "author": "tracecart",
                                "comment": "I'd add *opportunity cost* as well, both in money/resources and in time.",
                                "published_at": 1623277300.0,
                                "likes": 53
                            },
                            {
                                "author": "TheOffice_Account",
                                "comment": "> prices being set by supply and demand\n\nEnter online argument on *The fashion industry has conspired to ensure women don't have pockets on their pants* 😒\n\nIf I find it ridiculously difficult to persuade people about this, then I certainly cannot explain elasticity or comparative advantage to the average adult on Reddit.",
                                "published_at": 1623267041.0,
                                "likes": 46
                            },
                            {
                                "author": "SoccerSkilz",
                                "comment": "Would you mind recommending a resource(s) to help people who feel they don't have a solid grasp of these find one? *And this goes for everyone else: if you have an idea or set of ideas you think people should know more about and that are major deficits for most educated people, please offer a resource for people to address the deficit if you have one!*",
                                "published_at": 1623265071.0,
                                "likes": 18
                            },
                            {
                                "author": "grendel-khan",
                                "comment": "And the basic idea of opportunity cost! Decisions presented as \"should we do this good thing?\" feel cheaply obvious in a way that \"which of these good things should we do?\" does not.",
                                "published_at": 1623278234.0,
                                "likes": 13
                            },
                            {
                                "author": "Unknown",
                                "comment": "and they're most poorly understood by the people lobbying to unleash market interventions....",
                                "published_at": 1623269635.0,
                                "likes": 13
                            }
                        ]
                    },
                    {
                        "author": "fubo",
                        "comment": "Learning about the Prisoner's Dilemma without learning about *other* payoff matrices (Stag Hunt, etc.) may prove to be misleading. Not every game is a PD. Not every failure to cooperate is a PD, either.\n\nLikewise, not every game is zero sum; N-player games aren't 2-player games; various equilibria may or may not exist; mixed strategies are sometimes a thing; etc.\n\nThat said: the notion of an evolutionarily stable strategy (ESS) or non-invadable strategy is kind of handy.",
                        "published_at": 1623266700.0,
                        "likes": 99,
                        "subcomments": [
                            {
                                "author": "DM_ME_YOUR_HUSBANDO",
                                "comment": "And learning about the prisoner's dilemma without also learning about the iterated prisoner's dilemma is also leaving out a lot.",
                                "published_at": 1623273787.0,
                                "likes": 47
                            },
                            {
                                "author": "Unknown",
                                "comment": "[deleted]",
                                "published_at": 1623280484.0,
                                "likes": 17
                            },
                            {
                                "author": "kwanijml",
                                "comment": "This.\n\nAnd I would add that its not widely understood that these games are models, just like any other theoretical models...all models are wrong, but some are useful.\n\nIt's important and useful to understand the cetaris paribus forces and factors at play when trying to do institutional design...but we can't prax out how humans or the market will behave based on running a bunch of iterations of a PD.  \n\nHumans routinely disrupt the best laid incentive structures with out-of-band actions, and seemingly uncoordinated individuals solve collective action problems or produce public goods in ways unforseen to theorists.",
                                "published_at": 1623304430.0,
                                "likes": 11
                            },
                            {
                                "author": "dnkndnts",
                                "comment": "I feel like this is missing the point. The overall point is local incentives may cause net movement in direction most consider undesirable. Tragedy of the commons would have been a better poster child, but the underlying idea is what matters.",
                                "published_at": 1623321002.0,
                                "likes": 7
                            },
                            {
                                "author": "niplav",
                                "comment": "There is, as so often, a [really nice LessWrong post](https://www.lesswrong.com/posts/KwbJFexa4MEdhJbs4/classifying-games-like-the-prisoner-s-dilemma) about the different types of 2x2 games.",
                                "published_at": 1623329246.0,
                                "likes": 4
                            }
                        ]
                    },
                    {
                        "author": "deja-roo",
                        "comment": "I find most of these items to be complete overkill. \n\nFirst and foremost, I'll be far from the first to mention simple supply and demand making things available or not for purchase and setting their prices. The number of people who think high prices on one thing or another or lack of availability of one thing or another are an outright *conspiracy* is galling. \n\nI would also agree with the prisoner's dilemma because of how relevant that is to everyday behavior and how absent it is from most people's thinking. \n\nMy personal contribution is the various biases that we grapple with while considering the world: selection bias, confirmation bias, not-invented-here. \n\nPeople see things on the news and think that those things must be happening more often because they hear about them more often on the news, while never considering that the things they hear on the news are *inherently novel enough to be newsworthy*. Or think that not hearing about them on the news means they're uncommon. \n\n\"Well there's lots of mass shootings in the news, but when's the last time you heard of someone using a gun in self defense?\"\n\nPeople are awful at risk analysis I surmise at least partially due to these shortcomings in understanding bias.",
                        "published_at": 1623268396.0,
                        "likes": 96,
                        "subcomments": [
                            {
                                "author": "chitraders",
                                "comment": "Yes I agree.  When I read the list it looked like the list of things 1% people know.  Maybe even .1% people.  \n\nI doubt even 5% of the population has any real understand of intro economics.\n\nMost people have zero statistical training.  The average person can’t even understand that the media can make anything true in a nation of 300 million people by finding the 50 idiots doing something.",
                                "published_at": 1623275411.0,
                                "likes": 50
                            },
                            {
                                "author": "ObedientCactus",
                                "comment": "The things that came to my mind that somewhat fit are in the vein of this, post so  i'll add my 2c here.\n\n\nThe one bias i'd add is **survivor-ship bias**, which occurs somewhat commonly. One \"funny\" instance of this is authoritarian parenting, where people that do this only consider the ones that made it trough the hardship but never look at the failures that are miserable adults, or just committed suicide in their teens.\n\n\nThe other stuff is knowledge from playing competitive games for a long time (mtg) that can be applied in RL. Which is basically applied game theory or more aware decision making.\n\n\n**Results Oriented Thinking**: Decisions have to be judged given the knowledge at the point in time the decision was made, and not with the benefit of hindsight. Decisions are also not wrong just because a undesirable outcome occurred. A lot of people seem to really struggle to conceptualize the last one.\n\n**Have a plan**: Don't just have an abstract goal in mind when making bigger decisions but actually think trough how individual decisions help or hurt you reaching that goal\n\n**Play to win**: Less applicable in RL, but basically in game terms avoid playing in a way that just prolongs the game but doesn't help you win it. Instead make riskier moves that might actually win you something. The most applicable situation to this would probably be dating.",
                                "published_at": 1623331656.0,
                                "likes": 17
                            },
                            {
                                "author": "dmorga",
                                "comment": "Was going to say mostly the same points. Fully agree with supply and demand, I would consider myself \"educated\" but until I was like 21, supply and demand was just a buzzword or academic until I actually internalized it affecting price and availability (thanks Sowell).\n\nRelated to your points on biases, I would say it can be somewhat summarized as base rate neglect. Just thinking to ask the question helps correct for these biases, especially for things like the news where the base rate is often 0.001%. If you consider base rates a decent amount, I would imagine forming bayes-like intuitions on probability is natural. I.e. I shouldn't expect to be the exception to this 99% without good reason - how good are my reasons?",
                                "published_at": 1623288433.0,
                                "likes": 4
                            },
                            {
                                "author": "pellucidar7",
                                "comment": "After the countless bans of Uber and Lyft surge pricing because COVID, I no longer believe the principle of supply and demand *can* be taught.  The innate failure to grok it belongs under cognitive biases.",
                                "published_at": 1623325440.0,
                                "likes": 2
                            }
                        ]
                    },
                    {
                        "author": "dantuba",
                        "comment": "Here's one I don't see so far: **basic model of how a computer/phone works**, at the level of CPU, RAM, disk, network, programs, data. Not anything deep or technical, but some understanding of what happens when you click \"install\" in some App store, or when you see a link vs and attachment in an email, etc.\n\nI think a lot of people use computers every day but do so in confusion, frustration, and fear. Like driving a car: you don't need to know the details, but should be aware that there is gas used as fuel for an engine, which converts that to power to make the wheels turn when you press on the accelerator pedal, etc.",
                        "published_at": 1623268827.0,
                        "likes": 83,
                        "subcomments": [
                            {
                                "author": "DJWalnut",
                                "comment": "Given how important computers are for society and only getting more so, to be informed voters people need to understand the issues",
                                "published_at": 1623273910.0,
                                "likes": 13
                            },
                            {
                                "author": "DuplexFields",
                                "comment": "If people used cars like they use computers, a significant portion of the driving populace would call the pedals \"buttons\", and take their car to the repair shop whenever it ran out of gas. I'd say it's a testament to just how user friendly modern computers and phones are.",
                                "published_at": 1623279701.0,
                                "likes": 11
                            }
                        ]
                    },
                    {
                        "author": "ZurrgabDaVinci758",
                        "comment": "This thread is just going to be entirely people justifying why their own special interest is the objectively most important thing in the world",
                        "published_at": 1623277693.0,
                        "likes": 56,
                        "subcomments": [
                            {
                                "author": "Unknown",
                                "comment": "Exactly. All these lists are just people's different preferences.",
                                "published_at": 1623292630.0,
                                "likes": 13
                            }
                        ]
                    },
                    {
                        "author": "goyafrau",
                        "comment": "Compound interest. \n\nHaving babies becomes increasingly more dangerous beginning in your 30s.",
                        "published_at": 1623268552.0,
                        "likes": 55,
                        "subcomments": [
                            {
                                "author": "SoccerSkilz",
                                "comment": "Do you have a resource for this so that I can learn more and fact check this? Sorry if that sounds rude but this is the first time I am hearing that the dangers of conception after the age of 30 follow a process of compound interest (in some sense, apparently).\n\nEdit: \n\nOh, lol. Those were supposed to be separate. I thought you were making some kind of eccentric, counterintuitive point about how compound interest is a good way of describing how women accumulate congenital/natal problems with age/become progressively infertile.",
                                "published_at": 1623279241.0,
                                "likes": 21
                            },
                            {
                                "author": "Unknown",
                                "comment": "[deleted]",
                                "published_at": 1623281457.0,
                                "likes": 14
                            },
                            {
                                "author": "tehbored",
                                "comment": "Also that men have a biological clock as well, and that if you want to delay having biological children, freezing your sperm might not be a bad idea. Just because you're technically fertile doesn't mean the genetic integrity of your sperm is what it should be.",
                                "published_at": 1623326681.0,
                                "likes": 7
                            },
                            {
                                "author": "pellucidar7",
                                "comment": "“Dangerous” is not the right word, but the decline in female fertility is an important part of a general understanding of human aging and which of our systems tend to break down, not to mention how and when.",
                                "published_at": 1623324524.0,
                                "likes": 4
                            },
                            {
                                "author": "PM_ME_UTILONS",
                                "comment": "Yeah, if anyone can think of a socially acceptable way of raising that second one with friends you care about and would like to see reproduce, share it here! \n\nIt's  pretty hard not to be spending weirdness points when you share this with people.",
                                "published_at": 1623551828.0,
                                "likes": 3
                            }
                        ]
                    },
                    {
                        "author": "Unknown",
                        "comment": "What I’m learning from this thread is that I’m not meaningfully educated.",
                        "published_at": 1623278305.0,
                        "likes": 53,
                        "subcomments": []
                    },
                    {
                        "author": "bibliophile785",
                        "comment": "I think the professor's premise is myopic drivel. I struggle to imagine the mindset that unironically states, \"a person can't be considered 'educated' unless they know some of the specific things I find important.\" Let's ignore the chronological logistics for a moment and say that John von Neumann didn't know anything about the Prisoner's dilemma. Let's say that Einstein didn't, either. Would you really want to look at the foremost mathematician and physicist of the 20th century, respectively, and declare them uneducated? Einstein was brilliant and widely knowledgeable. Von Neumann made him look dim in both categories. Calling either of them uneducated for not knowing any one body of work, however important, approaches strict factual inaccuracy. The same reasoning holds true even if we move away from the academic stars and consider normal, educated people.\n\nHonestly, the claim sounds less like a serious contestation from a careful thinker and more like something I'd hear from an undergrad lit major. I can almost hear the sneering over how no one *with taste* reads Shakespeare when they could be pondering Dostoevsky. In fairness to the hypothetical elitist here, at least they kept their claim within the realm of the purely subjective. The professor would struggle even to claim that much.\n\nSorry for taking a whole comment to nitpick your post's premise. I think it was relevant and important, but it's not really what you were asking for. More to your question, your list looks like a good (if necessarily incomplete) showing of things that everyone interested in rationality should take the time to read over. I would add to it knowledge of the rate of technological advance, both in the past and for common projections of the future. The most important conversation of our time isn't climate change, it's how we expect our technology to advance in coming decades and what we can do to align that advancing technology with our values.",
                        "published_at": 1623265091.0,
                        "likes": 43,
                        "subcomments": [
                            {
                                "author": "Versac",
                                "comment": "> Let's ignore the chronological logistics for a moment and say that John von Neumann didn't know anything about the Prisoner's dilemma.\n\nHang on - you know who wrote *[On the Theory of Games of Strategy](https://link.springer.com/article/10.1007%2FBF01448847)* and gave that field its name, right? It's one thing to challenge a premise with a hypothetical, but it's another to pick one so resoundingly counterfactual.",
                                "published_at": 1623266218.0,
                                "likes": 37
                            },
                            {
                                "author": "haas_n",
                                "comment": "straight clumsy shocking plants voracious market grab station yam full\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                                "published_at": 1623267541.0,
                                "likes": 11
                            },
                            {
                                "author": "SoccerSkilz",
                                "comment": "I'm laughing right now because you picked a terrible example for your point. You do realize that Jon von Neumann was the progenitor of game theory, with his groundbreaking paper \"The Theory of Games,\" where he used the game of poker to model payoffs and strategic ideals given limitations and consistent rules?\n\nI was also very explicit in the preface that I was talking about setting a new aspirational standard for lay knowledge, not critiquing all conceivable people, including scientific geniuses with enough knowledge to compensate for any individual oversight. The list is supposed to be impressionistic and cumulative, multi-disciplinary and hopefully somewhat practical, not condescending and shallow. You're being a little uncharitable to call this effort \"myopic drivel.\"\n\nI think I see where you're coming from, but I also think it is fair to say that the definition of \"an educated person\" is aspirational and bound to change with the state of our current knowledge, and is also goal-relative (that is, I am pumping people for ideas as to what we would wish lay people would know today given the unique challenges of contemporary society). I would hesitate to call Aristotle, one of history's most celebrated geniuses, an idiot, but I am sure that a relatively smart high-schooler knows considerably more about the world we actually live in than he did.\n\nThat isn't to say we have gotten to that point with respect to the Einstein's and the Neumman's, but that is precisely because they have done so much in such recent times to define what the essential knowledge of an educated person is today, not that they are so far in the past that we should condescend to them given our current knowledge.  It is also a vague archetype that is more an attempt to stimulate a conversation than to suggest that smart, polymathic people can never exist who have -1 fact that you could include in a list like this.\n\nFollow your argument a little further, and what you'll realize is that ANY brilliant, knowledgable person would still be brilliant and knowledgeable even if they knew one less thing, i.e. take all of Einstein's brilliance and knowledge but subtract out his awareness of the structure of the atom and tell me with a straight face that he is not still a brilliant and knowledgeable person. But does that really imply that nothing is essential and profoundly worth knowing? The point isn't that he would be a benighted idiot by virtue of not knowing the prisoner's dilemma, but that he is, all things considered, a *less* educated person as a result of not knowing it, and in an important rather than trivial way, and I dare to say he would agree with me if we could ask him.",
                                "published_at": 1623265894.0,
                                "likes": 3
                            }
                        ]
                    },
                    {
                        "author": "flannyo",
                        "comment": "A general understanding of world history with special focus on events since 1900. Some philosophy with special focus on ethics and aesthetics as those tend to come up the most often in daily life. A general understanding of major world religions, with special focus on Christianity, Islam, and Hinduism, as those are the most common. A general understanding of popular culture.\n\nI’d add a solid grasp of the arts with a special focus on music and literature, as literature is the easiest and cheapest art to practice and access, and literally everyone on the planet likes music. “Men do not get the news from poems but they die every day from lack of what is found there.” -William Carlos Williams",
                        "published_at": 1623268582.0,
                        "likes": 30,
                        "subcomments": [
                            {
                                "author": "Unknown",
                                "comment": "This is what educated people used to know (its called being cultured), but no one else in this thread seems to think art is useful at all. \n\nI don't see how knowing cognitive biases helps you in life. You can't escape them or convince others to change their views based on their use of these biases, it just makes you feel superior to other people.\n\nKnowledge of art actually helps people navigate life because it gives a more holistic and aesthetic view of different situations, and helps with things like empathy",
                                "published_at": 1623269896.0,
                                "likes": 26
                            },
                            {
                                "author": "dnkndnts",
                                "comment": "Yeah, analysis of post-WWII geopolitics was sorely missing from my education, and would have been a vastly better use of time than studying a bunch of French monarchs that haven’t the faintest relevance to my everyday life.",
                                "published_at": 1623321203.0,
                                "likes": 9
                            },
                            {
                                "author": "SoccerSkilz",
                                "comment": "> A general understanding of major world religions, with special focus on Christianity, Islam, and Hinduism, as those are the most common. \n\nAn excellent addition, and I would like to recommend *Religious Literacy* by Steven Prothero for this one. [You can find the book here.](https://www.amazon.com/Religious-Literacy-American-Know-Doesnt/dp/0060859520)\n\n> A general understanding of pop culture\n\nHow does one attain that? And how does one know if they have it? This is a hard one for me because I am a huge nerd :p",
                                "published_at": 1623273028.0,
                                "likes": 4
                            }
                        ]
                    },
                    {
                        "author": "haas_n",
                        "comment": "crown direful wild lunchroom fuzzy market placid fact ghost marry\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                        "published_at": 1623267305.0,
                        "likes": 26,
                        "subcomments": [
                            {
                                "author": "SoccerSkilz",
                                "comment": "Adding to this, the idea of a **reinforcement schedule**, which can vary in two important ways: by continuity/vs/intermittency and, if intermittent, by fixedness, variability, ratio-, and interval-. People should know which ones Casino’s use, and which are most associated with addiction and help us to predict and explain the “abuse liability” of controlled substances like Cocaine and Methamphetamine vs Psilocybin and Cannabis. See [this resource to learn more.](https://www.simplypsychology.org/schedules-of-reinforcement.html)",
                                "published_at": 1623272776.0,
                                "likes": 11
                            },
                            {
                                "author": "Qotn",
                                "comment": "I'd expand, or edit this, to say that it's more about how people learn and grow *in general* rather than how we think of teaching/learning traditionally. Operant and respondent conditioning is the basis for everything we do that we're not born already doing.",
                                "published_at": 1623344187.0,
                                "likes": 3
                            }
                        ]
                    }
                ],
                "shares": 1
            },
            {
                "title": "Synthetic Dawn was recently released, so here's the up-to-date information tidbits for people curious about the game, its DLC and what changed so far since Utopia",
                "url": "https://www.reddit.com/r/Stellaris/comments/74qi9p/synthetic_dawn_was_recently_released_so_heres_the/",
                "score": 924,
                "comments_count": 122,
                "author": "KaTiON",
                "created_utc": 1507323298.0,
                "selftext": "Synthetic Dawn has been out for two weeks and the 1.8.2 hotfix is out. I suppose its time to create a new thread regarding what changed since the last expansion for new players and returning ones.\n\nIf you are interested to know what changed since the games' lunch back in May of 2016 up to Utopias' release I suggest [checking out this thread by /u/Russ31419](https://www.reddit.com/r/Stellaris/comments/6djd3d/for_those_who_are_curious_about_the_game_or_dlc/) the last time this type of thing was made.\n\n# What is Stellaris?\n\nStellaris is a sci-fi strategy game that combines aspects of 4X and grand-strategy. You start as a nation that has managed to unite its homeworld under a single government which is now looking to expand towards the vast expanse above. This expanse is indeed quite vast as you begin in a procedurally generated galaxy that can have up to 1000 systems, each capable of containing planets, moons and asteroids. \n\nThe game offers many different mechanics to simulate the management of such an empire and they include:\n\n* The ability to colonize potentially habitable worlds\n* Developing said worlds into figurative ecumenopolises by virtue of building construction and populacional assignments\n* Interaction with dozens of different empires, each unique in their own way, including the ancient and powerful Fallen Empires: empires that once ruled the entire galaxy but are now a mere shadow of their former selves\n* Personalizing your founding species by choosing its portrait (about 120 different ones) and biological traits and your government type by selecting different ethics, authorities and civics\n* Raising a space armada with a somewhat simplified composition (4 types of combat ships but potentially dozens of different, ever improving weapon types and modules to choose from) capable of waging wars\n* Researching hundreds of technologies like cold fusion, psionic theory and extradimensional weaponry\n* Hiring and managing leaders like governors and scientists, each with different traits, and make them formidable by raising their skills\n* Using said scientists to explore the galaxy around you in search of knowledge and anomalies\n* Equipping ships with three different types of FTL travel engines, each offering a unique type of playstyle\n* Terraforming all sort of planets to better suit your species (or simply for the fun of it)\n* Different playstyles based on previously selected ethics, authorities and civics\n* Dealing with factions that do not like you (and receiving the boons from those that do)\n* Control your population (or not) by making them (or some other species) slaves or livestock for the benefit of the empire\n* Genetically modify species, uplift pre-sapients, infiltrate pre-FTL nations or simply purge them all because one should suffer not the alien to live\n\nIts worth mentioning that the game is often patched with hotfixes, but every semester or so a big free patch is released that accompanies each DLC and it includes most of the newly implemented mechanics and gameplay changes. In a way, buying the DLC helps subsidizing the free improvements everyone receives.\n\nYou can buy the game at [Paradox Interactive](http://www.paradoxplaza.com/stellaris/STST01G-MASTER.html) or [Steam](http://store.steampowered.com/app/281990/Stellaris/) for $39.99 or your regional equivalent. Keep in mind more often than not there are sales that cut the price considerably so keep an eye for those opportunities!\n\nThere is also a [wiki](http://www.stellariswiki.com/Stellaris_Wiki) that is run by Paradox Interactive that is frequently updated by fans of the game and it can provide some much needed context or help for your playthroughs. You can also check YouTube for tutorials and let's plays. \n\n# What changed since Utopia?\n\nSince Utopia and its 1.5 (Banks) patch a number of changes have happened, the significant ones are:\n\n* You can now colonize every type of world (if not non-adaptive) as habitability now affects population growth, happiness and resource output (-5% at 20% habitability, the minimum allowed) \n* The old, somewhat broken AI rebellion crisis has been replaced by The Contingency, an ancient and dormant machine intelligence that can awaken and proceed to sterilize the galaxy of organic pops\n* Vassal creation is simplified, to create a vassal select a planet and click on the \"Create Vassal\" button, systems can be granted or seized via trade\n* Missiles have been severely buffed as they can now re-target if a target is destroyed\n* Election mechanics have been revamped – meaning that democratic governments no longer get to choose their ruler from a pool of active leaders, instead it's centered around factions. Candidates are now representatives of factions and by taking into account the citizenship status of pops, the odds of a candidate winning an election are determined by the amount of support a given faction has throughout the empire\n* Genetic modification has been reworked, there is now a system of templates you can create and save/modify/delete at any time. Said templates can later be applied on specific pops\n* Robots can now have traits via Robomodding (mechanical equivalent of genetic modification)\n* There is a new thing called land appropriation which displaces up to 5 pops on filled-out, conquered planets, turning them into refugees\n* Manual purging is back but only works on special cases like if a pop is considered a slave or an undesirable\n* Awakened Fallen Empires now suffer decadence after 20 years (oh the horror) which slowly increases the larger they are and this decadence manifests as lowered income, ship power and vassal opinion\n* Crisis now appear 200 years into a game in the earliest\n* Leader skill level cap is 5 by default but it can be increased to 10 depending on traditions, civics, traits, etc.\n* There is now a single governor that governs all core systems\n* You can now build/demolish buildings and move pops around inside a sector, there is also no longer an influence penalty to remove systems from sectors\n* You can now drain 75% of stockpiled resources from sectors at the cost of 100 influence or 25 if in a defensive war (abuse that as much as you'd like)\n* You can also press the ctrl key to give 1000 of a given resource to a sector\n* You can now tax a sectors' energy and minerals production independently\n* You can now terraform inhabited worlds with a new technology called Ecological Adaptation\n* Ironman now saves every 3 months instead of once a month\n* Many new rooms (those that appear during diplomacy) that represent empires with different personalities, the player can freely choose any at the beginning\n* Ruined Ringworlds can now too be repaired with mega-engineering\n* Hiveminds have a lot more flavor text\n* AI now builds defense platforms with snares near planets with space ports\n* Gaia worlds now provide +5 happiness and +15% unity production\n* Ship yards no longer give a reduction in ship mineral cost (/u/Sirchinaman)\n* Army units now have experience  (/u/Sirchinaman)\n* Corvettes and ships in general cost more (/u/Sirchinaman)\n* No more naked corvettes! And ship modules techs (weapons, shields,...) in general carry more fighting power so technologically advanced ships are now actually better (/u/nonium)\n* AI empires play better and more competitively, expanding a lot faster and attacking more (/u/nonium)\n\nFor a more comprehensive list, please check out [Patches over at the wiki](http://www.stellariswiki.com/Patches).\n\n# What does Synthetic Dawn have to offer?\n\nIn regards to the expansion itself: it's not of the same scope as Utopia, meaning that it doesn't really change the way the game is played if one doesn't own it. As its description states, it's a story pack like Leviathans.\n\nThere's this neat [video](https://www.youtube.com/watch?v=Jg-hcUcOIi8) made by Stellaris' Game Director Martin Anward which tells what the DLC adds.\n\nIn text form:\n\n* Ability to play as a machine empire from the get-go, this means hivemind-like mechanics such as: immortal (but not immune to death/malfunction) leaders, 100% habitability, no food requirements, no happiness nor ethics divergence, all pops must be constructed and different templates can be made to specialize your robotic population, etc.\n* Flavor and event chains for your playthrough as a machine, with unique dialogue options with a lot of different empires, anomalies and crisis events\n* Machines can now rebel and, if successful, become the new overlords  \n* Ability to terraform worlds into Machine Worlds that give +25% robot production in every field\n* Eight new machine portraits to choose from, each representing a different species group (and each one is beautiful)\n* Many new voice packs for VIR that give it different personalities\n* Synthetic Fallen Empire and its amusing shenanigans\n* Three new songs\n\nI have to warn that the DLC *does not* come with dedicated ship types.\n\nBy all means get this expansion if you are interested in any of the points I wrote in the list above. There are also special types of machine empires such as Driven Assimilators that look to cyborg the entire galaxy (i.e. Borg) and the Rogue Servitors who look to pamper and delight every organic there is (i.e. a bit of Matrix and a bit of WALL·E). Oh, and not to forget the Determined Exterminators who, like the name implies, seek to eradicate the galaxy of any organic (i.e. Skynet). \n\nIf you are not interested in any of that, then it's not really that necessary to own this DLC.\n\nHopefully this quick run-down gave clarifications on what changed since Utopia. If you see any errors in this or anything you think is missing, please leave a comment mentioning it and I'll add it to this thread giving you credit.",
                "comments": [
                    {
                        "author": "LittleComrade",
                        "comment": "WALL-E is a poor example of rogue servitors, considering how humans are still actually in charge. The autopilot received orders to take over, but it didn't actually do anything before WALL-E showed up, at which point its mutiny was quickly put down. Outside of that mutiny, humans were always in charge. \n \nThe Matrix is a better example, where the Machines responded to a terrible war by attempting to imprison humanity (for everyone's protection) in a simulated paradise. It was only after that failed that they made the 90s version of the matrix, and life in that was still paradise compared to the outside world. The Architect even explains that the Machines don't really need humanity, but prefer having them around, which to me resembles how poorly Rogue Servitors work when they don't have any organics to pamper. ",
                        "published_at": 1507473579.0,
                        "likes": 132,
                        "subcomments": [
                            {
                                "author": "Unknown",
                                "comment": "Yup. That makes more sense, since humans would be a horrible energy source or batteries. The amount of calories needed for the amount of energy gained is not worth it. I like to think that the machines keep humans around because the whole Matrix thing gives them a purpose. There is not much to do on a barren planet.",
                                "published_at": 1507755233.0,
                                "likes": 60
                            },
                            {
                                "author": "KaTiON",
                                "comment": "I like your example, will change accordingly.",
                                "published_at": 1507473803.0,
                                "likes": 12
                            },
                            {
                                "author": "Stercore_",
                                "comment": "the space ship from wall-e is a perfect example. robots tending to their every need, but when they seek something the robots are programmed not to allow then they have to take forceful control\n",
                                "published_at": 1515491345.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "Popotuni",
                        "comment": "Why did you have to do this?  I was content.  I could wait until Christmas to buy this, and dip my toe back in the water.  Now...  Sigh.  Fine, I'll buy it.",
                        "published_at": 1507324867.0,
                        "likes": 90,
                        "subcomments": [
                            {
                                "author": "Squaldor",
                                "comment": "Do not loose sleep over buying it. \n\nAs you will loose sleep over playing it",
                                "published_at": 1507361041.0,
                                "likes": 96
                            },
                            {
                                "author": "Beanchilla",
                                "comment": "Same. I took a couple of months off and now I'm back in again. I may not have the 1,000 hours so many on here have but perhaps I will if they keep putting out these kind of updates.\n\nReally glad to hear the missiles are buffed and the corvettes balanced.",
                                "published_at": 1507418172.0,
                                "likes": 12
                            }
                        ]
                    },
                    {
                        "author": "Sirchinaman",
                        "comment": "Thank you for your time typing all this out and posting. \nSome changes I have noticed. \nShip yards no longer give a reduction in mineral cost. \nMilitary units now have experience. \nCorvettes cost more and ships in general. \nYou can now change buildings on planets within a sector. \nRemoving planet from sector no longer costs 25 influence points. \nGame difficulty seems to be changed. \nGame play seems to be smoother\n\nMay the force be with you. ",
                        "published_at": 1507331063.0,
                        "likes": 62,
                        "subcomments": []
                    },
                    {
                        "author": "KeyworkOrange",
                        "comment": "As someone who picked up Stellaris a few weeks ago and then had to adapt to 1.8.1, it's safe to say I have *NO CLUE* how to make combat work. I'm basically back to square one. \n\nFor my first week of Stellaris (Pre-1.8.1) I figured out how to streak around the galaxy in a naked corvette doomstack, and life as a ravenous hivemind was good (it fit my headcanon of being a 'swarm' organism), but no longer. The fleet cap actually means something now, you can't build 9000+ corvettes and still function as an empire, the energy budget put a stop to that. You also can't pump out corvettes like you used to, they're more expensive now. I actually had to open up the ship designer *<GASP!>* and figure out counters, and boy am I just not getting it...\n\nThe AI is much more clever too, I noticed they like to do hit and run attacks on my stations and then emergency warp out before I can get to the fight. And since minerals are so precious to slowly building up a fleet, it's a real blow in the mid game (if I get that far). Now instead of devouring all life, I usually get dunked on by early alliances and stacks I can't seem to counter no matter how hard I try. It's a different game for sure!\n\nI've got half a mind to start a thread: \"Hello my name is KeyworkOrange and I'm a recovering corvette spam addict...\"\n",
                        "published_at": 1507528907.0,
                        "likes": 43,
                        "subcomments": [
                            {
                                "author": "Bonesplitter",
                                "comment": "I'd suggest massing science production, unless your traits are more geared towards incredibly wide playstyle.\n\nDoing this will give you the firepower early enough to squash neighboring empires and feed your people with them.",
                                "published_at": 1507766067.0,
                                "likes": 22
                            },
                            {
                                "author": "Havroth",
                                "comment": "+1 for starting that thread",
                                "published_at": 1508761705.0,
                                "likes": 14
                            },
                            {
                                "author": "riesenarethebest",
                                "comment": "My all consuming swarm play through is doing well. Wars started around year eleven and it's been non-stop ever since. I had a few expensive border skirmishes before I had critical mass of corvettes in my swarm. Probably 85% of my minerals are going into my fleet. \n\nAt one point, my hive had five different species on the dinner plate. Good eats.\n\nA big key was to avoid anything that let them band together (shared rivalries), kick starting by invading pre space species, and never ever dropping my fleet below the threshold that would send the whole galaxy at me all at once.\n\nGood luck!",
                                "published_at": 1514820970.0,
                                "likes": 2
                            }
                        ]
                    },
                    {
                        "author": "nonium",
                        "comment": "You forget 2 most important changes:\n\n* Ai (in 1.8+fixes in 1.8.1) has been significantly improved. Now it can actually play competitively.\n* Ship modules techs (weapons, shields,...) are no longer useless, more technologically advanced ships are now better then naked corvettes.\n\nBut of course there are things that Paradox still didn't fix:\n\n* Defense stations are still ~~useless~~ *rarely usefull* because they are too weak.\n* Late game performance is still bad because many calculations are handled with single cpu thread.\n* Propagation of power is very easy, you can basically attack and defend with single large fleet without risk of losing strategic targets (aka \"Doomstack problem\") -> interstellar travel is too fast\n",
                        "published_at": 1507368676.0,
                        "likes": 23,
                        "subcomments": [
                            {
                                "author": "Palmul",
                                "comment": "> interstellar travel is too fast\n\nBecause waiting 2 months between every system with warp clearly isn't boring enough.",
                                "published_at": 1507373760.0,
                                "likes": 44
                            },
                            {
                                "author": "OverlandObject",
                                "comment": ">interstellar travel is too fast\n\nStop",
                                "published_at": 1507657814.0,
                                "likes": 21
                            },
                            {
                                "author": "WyMANderly",
                                "comment": "> interstellar travel is too fast\n\nChanging this is not the way to make war (or general gameplay in Stellaris) more fun. There's other ways to solve the doomstacks problem that don't just add more tedium. ",
                                "published_at": 1507465663.0,
                                "likes": 13
                            },
                            {
                                "author": "Paulisawesome123",
                                "comment": "Just completed my first game, started months ago, I was getting about 20 fps at the end of the game. I have an i5 4690k and gtx 1080.  Go single core! ",
                                "published_at": 1507615259.0,
                                "likes": 5
                            },
                            {
                                "author": "ValissaSurana",
                                "comment": "Defense stations weren't useless in my 1.8.1 game, I've used fortresses to plug a system that one of the enemies had to go through.\n\n...although they may have been affected by one of the mods",
                                "published_at": 1507490788.0,
                                "likes": 4
                            }
                        ]
                    },
                    {
                        "author": "WNxTyr4el",
                        "comment": "Damn.  Now I want to play again.",
                        "published_at": 1507349124.0,
                        "likes": 20,
                        "subcomments": [
                            {
                                "author": "Unknown",
                                "comment": "[removed]",
                                "published_at": 1507430089.0,
                                "likes": 19
                            },
                            {
                                "author": "GoodIdea321",
                                "comment": "Even without the DLC the game is much better now.",
                                "published_at": 1507385553.0,
                                "likes": 13
                            }
                        ]
                    },
                    {
                        "author": "Unpacer",
                        "comment": "Is late game performance still a nightmare?",
                        "published_at": 1516804844.0,
                        "likes": 18,
                        "subcomments": [
                            {
                                "author": "Unknown",
                                "comment": "[deleted]",
                                "published_at": 1516898609.0,
                                "likes": 12
                            },
                            {
                                "author": "Madaboe",
                                "comment": "Next patch will fix it",
                                "published_at": 1517679694.0,
                                "likes": 3
                            }
                        ]
                    },
                    {
                        "author": "Rekov",
                        "comment": "At this point I think I'm going to wait for a war update. Fixing the tech cost problem (naked corvette) was a good start, but war still strikes me as terribly boring as long as it's just giant fleets bombing one planet at a time for fractional gains.",
                        "published_at": 1507783424.0,
                        "likes": 10,
                        "subcomments": []
                    },
                    {
                        "author": "thekippersnack",
                        "comment": "How big is this game going to get eventually? I mean are we going to get play prethoryn style civilizations eventually where all construction is more or less organic? It's pretty exciting.",
                        "published_at": 1510275654.0,
                        "likes": 10,
                        "subcomments": [
                            {
                                "author": "SolDelta",
                                "comment": "HAK HAK HAK",
                                "published_at": 1514179866.0,
                                "likes": 5
                            },
                            {
                                "author": "Crustypeanut",
                                "comment": "Just look at Europa Universalis and Crusader Kings 2 for an idea.  It gon git big.  I imagine we'lll be able to do tons of fun things by the end of it.",
                                "published_at": 1515903147.0,
                                "likes": 3
                            }
                        ]
                    },
                    {
                        "author": "sjc0451",
                        "comment": "So, I started my first game in several months and I like many of the changes, but did they massively reduce the prevalence of strategic resources?\n\nBecause I'm 100 years into the game, have a third of a large galaxy surveyed myself or via traded charts, have many strategic resource techs, and literally know of only one resource deposit deep in the territory of a neutral power.\n\nJust wondering if I got a weird galaxy spawn or something. If it is, I might start over...",
                        "published_at": 1508995012.0,
                        "likes": 8,
                        "subcomments": [
                            {
                                "author": "KaTiON",
                                "comment": "That doesn't sound right. Can you start a new game and then open the console and write the observe command? See if there is a normal distribution of SR.",
                                "published_at": 1508996503.0,
                                "likes": 2
                            }
                        ]
                    }
                ],
                "shares": 0
            }
        ]
    }
]