[
    {
        "topic": "history",
        "reddit_posts": [
            {
                "title": "Weekly History Questions Thread.",
                "url": "https://www.reddit.com/r/history/comments/1jh7x14/weekly_history_questions_thread/",
                "score": 30,
                "comments_count": 71,
                "author": "AutoModerator",
                "created_utc": 1742648455.0,
                "selftext": "Welcome to our History Questions Thread!\n\nThis thread is for all those history related questions that are too simple, short or a bit too silly to warrant their own post.\n\nSo, do you have a question about history and have always been afraid to ask? Well, today is your lucky day. Ask away!\n\nOf course all our regular rules and guidelines still apply and to be just that bit extra clear:\n\nQuestions need to be historical in nature. Silly does not mean that your question should be a joke. [r/history](https://www.reddit.com/r/history/) also has an active [discord server](https://discord.com/invite/r-history-284001693044310016) where you can discuss history with other enthusiasts and experts.",
                "comments": [
                    {
                        "author": "BriOfTheSword",
                        "comment": "Weird question, if anyone feels like answering. What did people use for carrying drinking water on long hikes or land traveling? (I.e. instead of water bottles?) \n\nI’ve heard of water-skins, and I have a rough understanding of them, but are there other methods or examples of products used back then? I’m writing a story that’s fantasy based, so it doesn’t entirely accurate to any time period or country, but I wanted an idea of survival gear that a character might be carrying around with them. I realized, I have little to no idea what they’d use instead of a water-skin (which is fine, but not the vibe I’m going for) or maybe a sealed glass bottle (which seams silly to travel long distances with if there is a better options.\n\nNo wrong answers, just an idea I’ve been rolling around in my head.",
                        "published_at": 1742857377.0,
                        "likes": 5,
                        "subcomments": [
                            {
                                "author": "Telecom_VoIP_Fan",
                                "comment": "In the ancient world they used leather water holders, for example, made out of goat skin.",
                                "published_at": 1742884300.0,
                                "likes": 2
                            },
                            {
                                "author": "akie003",
                                "comment": "Indigenous Pacific people have used gourds to carry water across oceans",
                                "published_at": 1742887634.0,
                                "likes": 2
                            },
                            {
                                "author": "elmonoenano",
                                "comment": "They would use animal bladders, usually in some kind of woven container, as well as the other options people have mentioned.",
                                "published_at": 1742927267.0,
                                "likes": 2
                            }
                        ]
                    },
                    {
                        "author": "redheaded_olive12349",
                        "comment": "How can i tell the difference beween late 19th century and early 20th century (like in the first 10 years) kitchens?\n\nI was watching a movie centred around cooking in what looked like cooking in this time period, and I told my mom that I thought it looked like the late 19th or early 20th century. I came to this conclusion by observing the types of kitchenware and clothing that they were wearing, similar to those that I have seen in the TV show Anne with an “E” witch is set in the late 19th century and then continues into the beginning of the 20th century.",
                        "published_at": 1742933185.0,
                        "likes": 4,
                        "subcomments": []
                    },
                    {
                        "author": "Larielia",
                        "comment": "I'm reading \"Digging Up Armageddon\" by Eric H Cline.\n\nWhat similar (archaeology) books should I read?",
                        "published_at": 1742656346.0,
                        "likes": 3,
                        "subcomments": [
                            {
                                "author": "MeatballDom",
                                "comment": "I haven't read that one but I'm guessing from the title it's about Megiddo. \n\nIn which case you might find *Finding the Walls of Troy* by Susan Heuck Allen interesting as it discusses the attempts to locate Troy, the various proposals, and people involved.",
                                "published_at": 1742706679.0,
                                "likes": 2
                            }
                        ]
                    },
                    {
                        "author": "zombie-flesh",
                        "comment": "Does anyone have any good primary sources about moral concerns of slavery within the British empire from the 1750s? Preferably something that shows the significance of moral concerns in the growing abolitionists movement. \n\nBig thanks to anyone who can help.",
                        "published_at": 1742903538.0,
                        "likes": 3,
                        "subcomments": [
                            {
                                "author": "elmonoenano",
                                "comment": "If you read Anthony Benezet's work, he was one of the early thinkers who helped establish the abolitionist movement. But other obvious places to look are at things like the Sommerset case, Granville Sharp, William Wilberforce, Olaudah Equiano's narrative,  and Thomas Clarkson. They have several pamphlets, sermons, or the Equiano narrative, and the Sommerset opinion that you can find on project Gutenberg or though wikipedia.",
                                "published_at": 1742927189.0,
                                "likes": 3
                            }
                        ]
                    },
                    {
                        "author": "OzymandiasWrath",
                        "comment": "Question\n\nWho is the \"oldest known\" assassin?\n\nJing Ke was my first guess but when googled I get \"Rashid al-Din Sinan\" who comes a bit after, like 1100 years.\n\nI'm not looking for the oldest known organization like \"Jewish Sicarii\" but the oldest testimony of an assassin who is named.",
                        "published_at": 1742774650.0,
                        "likes": 2,
                        "subcomments": [
                            {
                                "author": "EnvironmentalWin1277",
                                "comment": "Judith assassinating Holofernes might not be the oldest but dates back to early Biblical times, I doubt it is a verified history (accepted as such by Catholic cannon) but the account is detailed and has no miracles, etc.  She is a recurrent figure in various arts and social debates due to her ambiguous actions---plotting the seduction of Holofernes and then cutting off his head and proudly displaying it in her home city. \n\nThe text is in the Apocrypha but was chosen for removal from the Bible proper. Naturally there is speculation that Judith was a bit too much for the authorities.",
                                "published_at": 1742790939.0,
                                "likes": 1
                            },
                            {
                                "author": "Telecom_VoIP_Fan",
                                "comment": "How about Cain killing Abel?",
                                "published_at": 1742884366.0,
                                "likes": 1
                            },
                            {
                                "author": "Lord0fHats",
                                "comment": "The oldest assassin whose name is known to me (and can be concretely verified) is Jing Ke, who attempted to assassinate the Qin Shi Huangdi. This occurred in the 3rd century BC. Obviously there were many assassins and assassinations before this but history tends not to record who did the killing and Jing Ke is the first whose name was written to my knowledge.",
                                "published_at": 1742917987.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "Right_Direction8889",
                        "comment": "Where is the Mussolini façade right now? It was clearly 3 dimensional. Was it destroyed after they took it down or is it in a museum somewhere? I want to see the giant face.",
                        "published_at": 1742835098.0,
                        "likes": 2,
                        "subcomments": []
                    },
                    {
                        "author": "polishedhands",
                        "comment": "Hello everyone.\n\nId like to ask you guys if there is any site/article or literally anything i can use that would make me know more about the russian constitution crisis of 1993.\n\nFor more information,\nI have an upcoming discussion/mun thingy where we will discuss this crisis.\nAny facts or any information about this crisis is greatly appreciated as it will help me build this case and strengthen my argument. Thank you!",
                        "published_at": 1743027164.0,
                        "likes": 2,
                        "subcomments": []
                    },
                    {
                        "author": "packardcaribien",
                        "comment": "Would a European layperson/peasant in, say \\~1500 understand the concept of percentages? What about fractions? How about an educated person who could read and write? \n\nI am writing a conversation where people discuss splitting a monetary reward, and was thinking it would be funny to have one person suggest 25% each and another respond that they didn't know what that means, and insist on getting a one/fifth share.",
                        "published_at": 1742660942.0,
                        "likes": 2,
                        "subcomments": [
                            {
                                "author": "fatwiggywiggles",
                                "comment": "There is an English rhyme from Tudor times about sowing a field: \"Sow four beans as you make your row, One to rot, and one to grow, One for the pigeon, and one for the crow.\" So the understanding was you needed to compensate accordingly. As this was mostly a thing for illiterate farmers, you can bet it was widespread \n\n\"Per cent\" would have been understood by anyone who dealt with money on a consistent basis or spoke Latin. At around the same time, interest rates were communicated as denominations out of of 100. I think your illiterate farmer might have been less savvy about that though\n\nThe scene you're writing makes sense if it's from a more educated person talking with an illiterate. They would have called it \"one in five\" instead of \"one fifth\" though",
                                "published_at": 1742676744.0,
                                "likes": 3
                            }
                        ]
                    },
                    {
                        "author": "Kitchen_Gate_4254",
                        "comment": "Question \n\nDid slave masters/traders only pick healthy slaves to buy or put on their ships? \n\n\nDid slaves masters/traders only pick healthy slaves to buy/put on their ships or did they just pick a bunch of random people? Also was there any sort getting process and if so how did they determine who is healthy?",
                        "published_at": 1742758597.0,
                        "likes": 1,
                        "subcomments": [
                            {
                                "author": "MeatballDom",
                                "comment": "There's a long history of slavery, but assuming you're referring to Transatlantic Slavery... \n\nThe buyers certainly did. Slave auctions would be held and their health and such would be examined beforehand. Sure, this could easily be faked but in general it's not good business. The slaves that were weaker, less healthy, might still be bought at a reduced cost. \n\nAs for traders it didn't really matter. It was more about the numbers. If a large enough percent survive the journey and end up healthy enough to sell then they'll make a profit. Many would die along the way and they'd simply be thrown overboard. \n\nAs for practices, basically think of any way you could try and sell a horse while hiding its issues to someone who isn't a veterinarian. The few examples that likely didn't happen to horses is sometimes the slaves would be given a bit of alcohol to make them a bit more lively looking. But yeah they would try and hide as much as they could.",
                                "published_at": 1742773161.0,
                                "likes": 1
                            },
                            {
                                "author": "elmonoenano",
                                "comment": "Like the other poster, I'm assuming this is about the transatlantic system, but there's a big difference between what slave traders were doing and what slave masters were doing. It's easy to find descriptions of slave auctions in the US where they clearly did look at the people's teeth, made them walk, etc, to assess their health because it was a significant, and usually long term, investment. Walter Johnson's Soul by Soul is a good book for this aspect.\n\nSlave traders is a much different question. There are lots of links in the slave trading line, so it depends on where they are. You mention ships, so I'm assuming you want information about the trading forts in places like Elmina on the coast of Africa. Slave traders do want healthy people who will stand a better chance of surviving the journey, the typical transatlantic voyage had about a 20% mortality rate. That will maximize their profit. But they have several constraints. Able bodied men sell for the most, with children and old people selling for the least. Women sell for less than men, but in a range depending on their age. But, children are small so you can cram more of them into your hold. Ideally you would maximize your profit by getting boys who are on the cusp of puberty b/c you can take more and the increased number will offset the lower cost. They also are less susceptible to disease than younger children. \n\nBut that is contingent on simple factors like who is available for transport at a given facility. If there are only older people, or only sick people because you came at the wrong time of the year, your choices will be limited. Or, if the season is almost up to catch the tradewinds, you are under more pressure to take what's available. Also, if you've waited too long (and ships would linger on the coast of Africa for months buying people to take) and your human cargo is starting to sicken, it might make sense to just grab who you can and go. \n\nSo, there was lots of thought put into it, with a preference for boys around 13 to 15 years old, but that's all contingent on the time year, what enslaved people were available, and the condition of the enslaved people already in your hold, and how long you've been lingering off the coast. Steven Mintz works on childhood in early America and he's got a nice short essay on the topic. https://chnm.gmu.edu/cyh/case-studies/57.html",
                                "published_at": 1742850373.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "Goaty1208",
                        "comment": "Hello everyone,\n\nI was looking for some photos of the Italian police (Both Polizia and Carabinieri corps) forces from the Years of lead, however I could not find almost any photos online, and the ones I could find were either blurry or not too detailed.\n\nWhilst I do know more or less how their uniforms looked, and whilst I do know what kind of gear they used, I still need some reference photos for use in a project of mine.\n\nThanks!",
                        "published_at": 1742761652.0,
                        "likes": 1,
                        "subcomments": [
                            {
                                "author": "Extra_Mechanic_2750",
                                "comment": "I would go with Il Messaggero, Corriere della Sera and La Repubblica Italian newspapers.",
                                "published_at": 1742864939.0,
                                "likes": 1
                            }
                        ]
                    }
                ]
            },
            {
                "title": "She was almost sent to Auschwitz. Her early love of art may have saved her.",
                "url": "https://www.reddit.com/r/history/comments/1jl600l/she_was_almost_sent_to_auschwitz_her_early_love/",
                "score": 157,
                "comments_count": 8,
                "author": "AnthonyJRivera",
                "created_utc": 1743087786.0,
                "selftext": "Many people in this 96-year-old woman's retirement community in Falls Church, Virginia, know her. Few outside are aware that the Nazis forced her and her family to relocate to Theresienstadt transit camp/ghetto in Czechoslovakia when she was 13 years old. I spent a few months reporting, researching and interviewing her and her family. When you consider the circumstances she faced, it's nothing short of a miracle that she, her twin brother, mother and father survived the Holocaust. I thought it was important to tell her story as we're losing so many of these folks as each month/year goes by. [Gift link here.](https://wapo.st/4hM1nNG)",
                "comments": [
                    {
                        "author": "Mindless-Errors",
                        "comment": "Here’s an alternate link.  \n\nhttps://archive.ph/rrWWF",
                        "published_at": 1743108156.0,
                        "likes": 19,
                        "subcomments": [
                            {
                                "author": "Mindless-Errors",
                                "comment": "Thanks for that great story.  She lives her life with so much strength and hope.",
                                "published_at": 1743108565.0,
                                "likes": 7
                            }
                        ]
                    },
                    {
                        "author": "rainer_d",
                        "comment": "I take a bit of offense at the word „relocate“.\n\nThe SS‘ idea of „relocation“ didn’t exactly match with what we use the word these days. \n\nIt was a deportation.",
                        "published_at": 1743106610.0,
                        "likes": 8,
                        "subcomments": []
                    },
                    {
                        "author": "reflibman",
                        "comment": "I wanted to read but the gift link doesn’t work for me. Paywall.",
                        "published_at": 1743101618.0,
                        "likes": 7,
                        "subcomments": [
                            {
                                "author": "AnthonyJRivera",
                                "comment": "It may require an email registration to read for free.",
                                "published_at": 1743102324.0,
                                "likes": -8
                            }
                        ]
                    },
                    {
                        "author": "furrylandseal",
                        "comment": "Remarkable woman!  Thank you for telling her story.",
                        "published_at": 1743100314.0,
                        "likes": 5,
                        "subcomments": []
                    },
                    {
                        "author": "AutoModerator",
                        "comment": "Hi!  \nAs we hope you can appreciate, the Holocaust can be a fraught subject to deal with. While we don't want to curtail discussion, we also remain very conscious that threads of this nature can attract the very wrong kind of responses, and it is an unfortunate truth that on reddit, outright Holocaust denial can often rear its ugly head. As such, the /r/History mods have created this brief overview. It is not intended to stifle further discussion, but simply lay out the basic, incontrovertible truths to get them out of the way.\n\n##What Was the Holocaust?\nThe Holocaust refers to the genocidal deaths of 5-6 million European Jews carried out systematically by Nazi Germany as part of targeted policies of persecution and extermination during World War II. Some historians will also include the deaths of the Roma, Communists, Mentally Disabled, and other groups targeted by Nazi policies, which brings the total number of deaths to 11-17 million. Debates about whether or not the Holocaust includes these deaths or not is a matter of definitions, but in no way a reflection on dispute that they occurred.\n\n##But This Guy Says Otherwise! \nUnfortunately, there is a small, but vocal, minority of persons who fall into the category of Holocaust Denial, attempting to minimize the deaths by orders of magnitude, impugn well proven facts, or even claim that the Holocaust is entirely a fabrication and never happened. Although they often self-style themselves as \"Revisionists\", they are not correctly described by the title. While revisionism is not inherently a dirty word, actual revision, to quote Michael Shermer, *\"entails refinement of detailed knowledge about events, rarely complete denial of the events themselves, and certainly not denial of the cumulation of events known as the Holocaust.\"*\n\nIt is absolutely true that were you to read a book written in 1950 or so, you would find information which any decent scholar today might reject, and that is the result of good revisionism. But these changes, which even can be quite large, such as the reassessment of deaths at Auschwitz from ~4 million to ~1 million, are done within the bounds of respected, academic study, and reflect decades of work that builds upon the work of previous scholars, and certainly does not willfully disregard documented evidence and recollections. There are still plenty of questions within Holocaust Studies that are debated by scholars, and there may still be more out there for us to discover, and revise, but when it comes to the basic facts, there is simply no valid argument against them.\n\n##So What Are the Basics?  \nBeginning with their rise to power in the 1930s, the Nazi Party, headed by Adolf Hitler, implemented a series of anti-Jewish policies within Germany, marginalizing Jews within society more and more, stripping them of their wealth, livelihoods, and their dignity. With the invasion of Poland in 1939, the number of Jews under Nazi control reached into the millions, and this number would again increase with the invasion of the Soviet Union in 1941. Shortly after the invasion of Poland, the Germans started to confine the Jewish population into squalid ghettos. After several plans on how to rid Europe of the Jews that all proved unfeasible, by the time of the invasion of the Soviet Union in 1941, ideological (Antisemitism) and pragmatic (Resources) considerations lead to mass-killings becoming the only viable option in the minds of the Nazi leadership.\nFirst only practiced in the USSR, it was influential groups such as the SS and the administration of the General Government that pushed to expand the killing operations to all of Europe and sometime at the end of 1941 met with Hitler’s approval.\n\nThe early killings were carried out foremost by the *Einsatzgruppen*, paramilitary groups organized under the aegis of the SS and tasked with carrying out the mass killings of Jews, Communists, and other 'undesirable elements' in the wake of the German military's advance. In what is often termed the 'Holocaust by Bullet', the *Einsatzgruppen*, with the assistance of the Wehrmacht, the SD, the Security Police, as well as local collaborators, would kill roughly two million persons, over half of them Jews. Most killings were carried out with mass shootings, but other methods such as gas vans - intended to spare the killers the trauma of shooting so many persons day after day - were utilized too. \n\nBy early 1942, the \"Final Solution\" to the so-called \"Jewish Question\" was essentially finalized at the Wannsee Conference under the direction of Reinhard Heydrich, where the plan to eliminate the Jewish population of Europe using a series of extermination camps set up in occupied Poland was presented and met with approval.\n\nConstruction of extermination camps had already begun the previous fall, and mass extermination, mostly as part of 'Operation Reinhard', had began operation by spring of 1942. Roughly 2 million persons, nearly all Jewish men, women, and children, were immediately gassed upon arrival at Bełżec, Sobibór, and Treblinka over the next two years, when these  \"Reinhard\" camps were closed and razed. More victims would meet their fate in additional extermination camps such as Chełmno, but most infamously at Auschwitz-Birkenau, where slightly over 1 million persons, mostly Jews, died. Under the plan set forth at Wannsee, exterminations were hardly limited to the Jews of Poland, but rather Jews from all over Europe were rounded up and sent east by rail like cattle to the slaughter. Although the victims of the Reinhard Camps were originally buried, they would later be exhumed and cremated, and cremation of the victims was normal procedure at later camps such as Auschwitz.\n\n##The Camps  \nThere were two main types of camps run by Nazi Germany, which is sometimes a source of confusion. Concentration Camps were well known means of extrajudicial control implemented by the Nazis shortly after taking power, beginning with the construction of Dachau in 1933. Political opponents of all type, not just Jews, could find themselves imprisoned in these camps during the pre-war years, and while conditions were often brutal and squalid, and numerous deaths did occur from mistreatment, they were not usually a death sentence and the population fluctuated greatly. Although Concentration Camps *were* later made part of the 'Final Solution', their purpose was not as immediate extermination centers. Some were 'way stations', and others were work camps, where Germany intended to eke out every last bit of productivity from them through what was known as \"extermination through labor\". Jews and other undesirable elements, if deemed healthy enough to work, could find themselves spared for a time and \"allowed\" to toil away like slaves until their usefulness was at an end.\n\nAlthough some Concentration Camps, such as Mauthausen, did include small gas chambers, mass gassing was not the primary purpose of the camp. Many camps, becoming extremely overcrowded, nevertheless resulted in the deaths of tens of thousands of inhabitants due to the outbreak of diseases such as typhus, or starvation, all of which the camp administrations did little to prevent. Bergen-Belsen, which was not a work camp but rather served as something of a way station for prisoners of the camp systems being moved about, is perhaps one of the most infamous of camps on this count, saw some 50,000 deaths caused by the conditions. Often located in the Reich, camps liberated by the Western forces were exclusively Concentration Camps, and many survivor testimonies come from these camps.\n\nThe Concentration Camps are contrasted with the Extermination Camps, which were purpose built for mass killing, with large gas chambers and later on, crematoria, but little or no facilities for inmates. Often they were disguised with false facades to lull the new arrivals into a false sense of security, even though rumors were of course rife for the fate that awaited the deportees. Almost all arrivals were killed upon arrival at these camps, and in many cases the number of survivors numbered in the single digits, such as at Bełżec, where only seven Jews, forced to assist in operation of the camp, were alive after the war.\n\nSeveral camps, however, were 'Hybrids' of both types, the most famous being Auschwitz, which was vast a complex of subcamps. The infamous 'selection' of prisoners, conducted by SS doctors upon arrival, meant life or death, with those deemed unsuited for labor immediately gassed and the more healthy and robust given at least temporary reprieve. The death count at Auschwitz numbered around 1 million, but it is also the source of many survivor testimonies.\n\n##How Do We Know?  \nRunning through the evidence piece by piece would take more space than we have here, but suffice to say, there is a lot of evidence, and not just the (mountains of) survivor testimony. We have testimonies and writings from many who participated, as well German documentation of the programs. [This site](http://holocaustcontroversies.blogspot.de/2012/10/index-of-published-evidence-on.html) catalogs some of the evidence we have for mass extermination as it relates to Auschwitz. Below you'll find a short list of excellent works that should help to introduce you to various aspects of Holocaust study. \n\n* \"[Third Reich Trilogy](https://books.google.com/books?id=HZmXOPGTGjIC)\" by Richard Evans\n* \"[Hitler, the Germans, and the Final Solution](https://books.google.com/books?id=Z7FiPwAACAAJ)\" by Ian Kershaw\n* \"[Auschwitz: A New History](https://books.google.com/books?id=Wh9QVS3A5QIC)\" by Laurence Rees\n* \"[Ordinary Men](https://books.google.com/books?id=HFB-dkuZzSwC)\" by Christopher Browning\n* \"[Denying the Holocaust](https://books.google.com/books?id=_yLm_cHp_REC)\" by Deborah E. Lipstadt\n* [AskHistorians FAQ](/r/AskHistorians/wiki/wwii#wiki_nazi_germany)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/messa",
                        "published_at": 1743087794.0,
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "Medusa_Gorgeous",
                        "comment": "Wow, what an incredible story of resilience and the power of art. It's always important to hear firsthand accounts like this, especially as we lose more voices from that generation. Thanks for sharing.",
                        "published_at": 1743131701.0,
                        "likes": 1,
                        "subcomments": []
                    }
                ]
            },
            {
                "title": "Bookclub and Sources Wednesday!",
                "url": "https://www.reddit.com/r/history/comments/1jka2dn/bookclub_and_sources_wednesday/",
                "score": 26,
                "comments_count": 12,
                "author": "AutoModerator",
                "created_utc": 1742990450.0,
                "selftext": "Hi everybody,\n\nWelcome to our weekly book recommendation thread!\n\nWe have found that a lot of people come to this sub to ask for books about history or sources on certain topics. Others make posts about a book they themselves have read and want to share their thoughts about it with the rest of the sub.\n\nWe thought it would be a good idea to try and bundle these posts together a bit. One big weekly post where everybody can ask for books or (re)sources on any historic subject or timeperiod, or to share books they recently discovered or read. Giving opinions or asking about their factuality is encouraged!\n\nOf course it’s not limited to \\*just\\* books; podcasts, videos, etc. are also welcome. As a reminder, r/history  also has a recommended list of things to read, listen to or watch [here.](https://www.reddit.com/r/history/wiki/recommendedlist/)",
                "comments": [
                    {
                        "author": "CharredPepperoni",
                        "comment": "Does anyone have a great book about the Dutch East India company? It’s mentioned in Sapiens and The Invention of Everything and Merchant Kings but wondering if there is more . Thanks!",
                        "published_at": 1742993184.0,
                        "likes": 3,
                        "subcomments": [
                            {
                                "author": "elmonoenano",
                                "comment": "The Dutch Moment by Wim Klooster might be a good first stop, although it does contrast the VOC with the West Indies company, so the focus isn't solely on the VOC, but the contrast is key context. It's got solid reviews and isn't very old.\nhttps://www.goodreads.com/book/show/30142564-the-dutch-moment",
                                "published_at": 1743004209.0,
                                "likes": 3
                            }
                        ]
                    },
                    {
                        "author": "Hildringa",
                        "comment": "Hi! I would love suggestions on documentaries and/or podcasts about how regular people lived their day to day lives. Im particularly interested in the pre-industrial eras, and would prefer content where women are featured in some way. My biggest pet peeve with historical documentaries and podcasts (and books) is that they tend to be focused only on men - and in particular on the violence caused by men. To me, it's much more interesting learning about what people ate, what they wore, how they practiced their religion, how they built their houses, how they farmed, etc etc. \n\n  \nThe BBC's historic farm shows (and their off-shoots, like the castle and the bakery ones) are the ultimate to me, and Ive been searching high and low for ages for something with a similar topic. Ive watched everything featuring Ruth Goodman, she's the best! Ive also watched a fair bit of Lucy Worsley, Suzanna Lipscomb and Alice Roberts.",
                        "published_at": 1742992793.0,
                        "likes": 2,
                        "subcomments": [
                            {
                                "author": "labdsknechtpiraten",
                                "comment": "One possible book could be \"Independence Lost\" by DuVal. \n\nThe general sweep of the book is that it highlights some of the \"fringes\" of society during the American war of independence. So, it covers some loyalists who moved to Florida, war widows, women land owners and the like. I get it's not quite day to day, but this was a book I read for a uni course and it was heavily discussed, and it was pretty good.",
                                "published_at": 1742998858.0,
                                "likes": 1
                            },
                            {
                                "author": "elmonoenano",
                                "comment": "Terry Jones did one called Medieval Lives for BBC. They're all up on youtube now.\n\nThere was also a book that came out last year called A Rome of Ones Own that examines the lives of important Roman women. It's by Emma Southon, so it's not exactly regular people, but it's the people we have the best information about, to craft an examination of their daily lives.",
                                "published_at": 1743015030.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "Larielia",
                        "comment": "I'm looking for books about Neolithic to early Bronze Age Anatolia/ Asia Minor.",
                        "published_at": 1743042790.0,
                        "likes": 2,
                        "subcomments": []
                    },
                    {
                        "author": "HipponaxRambler",
                        "comment": "Hello, I'm wondering if anyone knows a good book about ideologies of democratization and participation in relation to the internet within the context of globalization, the end of the cold war, the dot com bubble, at the turn of the millenium. I feel like there are a lot of critiques - Morozov, for example - but I'm not sure who can provide a historical view.",
                        "published_at": 1743081660.0,
                        "likes": 2,
                        "subcomments": [
                            {
                                "author": "bangdazap",
                                "comment": "Yasha Levine - Surveillance Valley",
                                "published_at": 1743123261.0,
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "McGillis_is_a_Char",
                        "comment": "Could someone recommend an article or book about fashion in the Ottoman Empire especially during the 18th and/or 19th Century? Please and thank you.",
                        "published_at": 1743109705.0,
                        "likes": 2,
                        "subcomments": []
                    },
                    {
                        "author": "audiopathik-",
                        "comment": "**Sacred Kingship, Reformation and Secret Societies**\n\n\n**Richard C. McCoy - Alterations of State**\n*Kings were sacred ﬁgures for centuries in Europe, perceived as the Lord’s anointed deputies on earth. The Church and its sacraments were considered holier than the monarchy, but medieval rulers were still thought to have sacerdotal, spiritual, and even miraculous powers. Coronation was seen by some as a sacrament, akin to ordination; the royal touch was thought to have healing effects; and the mystical conception of the king’s two bodies implied that kingship never died. Moreover, rulers from Charlemagne to the Hapsburgs had claimed imperial autonomy from the papacy, causing tension between kings and clerics. The Reformation intensiﬁed this conﬂict while vastly expanding older notions of sacred kingship, making them simultaneously more grandiose and more problematic. In England, Henry VIII’s break with Rome was justiﬁed by new theories of royal supremacy that made the king the head of the church and clergy as well as the spiritual embodiment of the realm.\nAs the Reformation advanced, even the sacraments themselves were diminished and the Mass suppressed. These developments caused what John Bossy calls “a migration of the holy” in which “the socially integrative powers of the host” were transferred “to the rituals of monarchy and secular community.” Under the Tudors, the royal presence acquired some of the awesome sanctity of Christ’s real presence in the Eucharist and at times even threatened to replace it.\nRood screens were dismantled and sometimes replaced with the royal coat of arms under Edward, and the feast of Corpus Christi was eventually suppressed and superseded by a cult of Elizabeth and its annual royal processions. Both old and new ideas of sacred kingship still provoked increasing ambivalence and even hostility, and challenges and conﬂicts intensiﬁed throughout the Reformation.*\n\n\n**Urszula Szulakowska - The Sacrificial Body and the Day of Doom**\n*Martyrdom was believed to resource the Church with the spiritual wealth of divine grace, the foundation for its future development on earth.\nAccording to this doctrine, the ﬂesh was the ground of human salvation, its torment a necessity, whether in life as a martyr for Christ, or after death in the state of purgation.\nIn medieval doctrine it was the Church alone that could authorise the survival of the subject (that is, the body) by ensuring that the soul and its temporary somatic body went either to Purgatory, or (infrequently) directly to heaven through the grace of the Church’s sacraments.*\n\n\n*It was Luther who ﬁrst identiﬁed the Papacy with Antichrist and, on this basis, Lutheran artists had crowned the head of the Whore of Babylon with the papal tiara, as in the Wittenberg Bible of 1522. Furthermore, they equated the Pope with the Beast from the Bottomless Pit. The standard apocalyptic repertoire was created in Luther’s immediate social circle by Lucas Cranach in his woodcuts for the Passional Christi und Antichristi (1521) and for Luther’s Septembertestament (1522).*\n\n\n*Some Paracelsian alchemists, especially Heinrich Khunrath (ca. 1560–1605) and Stefan Michelspacher (active ca. 1615–23), were objects of persecution on the part of both Lutheran and Catholic authorities. Khunrath was an alchemist from Saxony, the heartland of the Reformation, but his theological stance was characteristic of the second generation of Protestants who felt that Luther’s work had been left incomplete and that another religious reform was essential.*\n\n\n*Dissenters from the established Protestant Churches were important precursors of a secular society, tolerant of religious divisions, in which Church and state were separated. In characterising these dissidents,\nSéguenny has adopted a concept from the philosopher Leszek Kolakowski, that of “religion without a Church”. I would add that a little known aspect of the history of secularism is the role of Paracelsian theosophy in creating a heterogeneous society supporting noncompliant religious views.*\n\n\n\n\n**Renko D. Geffarth - Religion und arkane Hierarchie**\n*The reception of the Kabbalah, Platonism and Hermeticism in the German-speaking world ultimately gave rise to the early modern concept of magic of Heinrich Cornelius Agrippa von Nettesheim and subsequently, with the integration of alchemy, the Paracelsian natural philosophy, the theosophy of Jakob Böhme and the panosophy of the Rosicrucian writings of the 17th century. All of this was always in interplay and conflict with Christianity and its denominations, which also persecuted such heterodox currents as heresy.*\n\n\n*Following the example of the Paracelsian Philosophia ad Athenienses, Robert Fludd constructed a cosmology based on the Paracelsian concept of the divine spirit in nature.*\n\n\n*In response to earlier doubts about his religious beliefs, Fludd had written the Declaratio Brevis to King James I in 1618-20. The alchemical appropriation of the Christian sacraments of baptism and the Lord's Supper was not welcomed by the ruling churches. None of them could accept a chemistry that claimed to produce substances that were equivalent to the body and blood of Christ and granted the same grace of spiritual and physical healing. The miracle of the bread and wine in the mass or communion service was unique and could never be imitated by chemical means, no matter how devout and prayerful one was. Moreover, none of the churches allowed unauthorized laymen to perform the sacramental rite, which was the prerogative of priests who had been formally appointed by a bishop by direct apostolic delegation from Christ. If, like Fludd, they introduced cabalistic angels (especially Metatron) into the alchemical version of the rite, he was, as Mersenne claimed, considered a practitioner of the most heinous demonic magic. The good or bad intentions didn't matter: it was a question of who should control this powerful miracle.*\n\n\n*Schlögl also emphasizes the enlightened character of the esoteric secret societies, as they represented an \"alternative to the salvation economy of the Christian churches\" with their efforts to redeem 'creation' in this world and therefore accommodated the \"self-confidence of people at the end of the 18th century\".*\n\n\n*In an overview essay on the Illuminati Order and the Gold and Rosicrucians in 1993, the Munich historian and professor Ludwig Hammermayer once again emphasized the contrast between the 'radical Enlightenment' Illuminati and the 'theocratic' Rosicrucians.*",
                        "published_at": 1742995323.0,
                        "likes": 1,
                        "subcomments": [
                            {
                                "author": "audiopathik-",
                                "comment": "(10.000 character limit? More like 7000)\n\n\n*Obviously challenging areas of social and cultural reform were the confessional and associated political tensions in the empire in the 16th century, the role of religion in culture and society and, last but not least, the perceived lack of understanding of 'science'. With the help of the secret brotherhood of the Rosicrucians, these three core issues were now to be subjected to a renewal that followed a uniform 'world view'. The Rosicrucian manifestos and the discourse that took place in the years following their first publication were thus not only the mediators of an early modern esoteric tradition that drew on the physician and hermeticist Theophrastus Bombastus von Hohenheim, known as Paracelsus (1493- 1541), and the hermeticism of the Renaissance, but also an expression of the perception of the crisis of the early 17th century.*\n\n\n*These first years after the publication of the Manifestos are considered the period of the 'older' Rosicrucians, followed by a 'middle' period resulting from the translation of the writings into other European languages and their reception in other countries, especially in England; the beginning of this second period is generally placed around the middle of the 17th century and its duration is extended into the early 18th century.\nFor the 'middle Rosicrucians', there is initial speculation about actually existing brotherhoods or even just circles of people who considered or described themselves as Rosicrucians; for example, Gottfried Wilhelm Leibniz is said to have been a member of a circle of alchemists and Rosicrucians. However, it is still true for this phase of 'Rosicrucianism' that a real society, an order comparable to that of the late 18th century, very probably did not exist.*\n\n\n*The history of the development of Freemasonry presented in the following section does, however, show influences from the reception of Rosicrucian writings in 17th century England, which were passed on via Elias Ashmole (1617-1692), a member of the Royal Society founded in 1660 and one of the early Freemasons. The chronological order chosen in this study, 'Older Rosicrucians' - Freemasons - Gold and Rosicrucians, is therefore based on the well-founded assumption that there was a connection in terms of content between the Rosicrucian manifestos and early Freemasonry, just as there was a structural connection between 18th century Freemasonry and the Order of the Gold and Rosicrucians.*",
                                "published_at": 1742995357.0,
                                "likes": 1
                            }
                        ]
                    }
                ]
            },
            {
                "title": "The copper threshing ground/copper pagan temple of the Danube Bulgars",
                "url": "https://www.reddit.com/r/history/comments/1jlahrp/the_copper_threshing_groundcopper_pagan_temple_of/",
                "score": 6,
                "comments_count": 0,
                "author": "legendairy-458",
                "created_utc": 1743099056.0,
                "selftext": "A copper threshing ground (медно гумно) or a copper pagan temple (медно капище) is noted in medieval writings, usually regarding Danube Bulgars, their political power, statehood and pagan religion. It's also mentioned (albeit rarely) in Bulgarian folklore. I couldn't find many English sources regarding this, so here I'll put down some information that I've discovered in Bulgarian (there aren't any sources in other languages).\n\nThe first mentions of a copper threshing ground are found in Byzantine sources dating back to the times when Danube Bulgars still existed and were pagan. Joseph Genesius's writings mention a threshing ground where Bulgar children are killed by triumphant Byzantines in the early 9th century, and in \"The Letter of the Three Patriarchs to Emperor Theophilos\", the Byzantine emperor Leo V (ruled 813-820) is told by a man named Sabbatios that if he destroys all icons, he will finally have prosperity and will stab his sword into the Bulgars' copper threshing ground.\n\nIn the 10th-11th century, many Christians in Europe were expecting the end of the world, so apocryphal eschatological literature saw a rise. We owe several mentions of a copper threshing floor to Bulgarian apocryphs. Those were written in the style of the biblical Book of Revelation or used Old Testament motifs, but the characters, places and symbols were often local.\n\nIn the apocryphal work \"Тълкувание Данаилово\" (\"Danail's interpretation\"), a copper pagan temple is mentioned. It's linked to Bulgar pagan religion by Bulgarian historians and its destruction by the character Михаил каган (Mihail khagan, identified by some with Boris I Mihail) symbolizes the Christianisation of Bulgaria. Mihail khagan goes on to fight and dethrone an \"evil king\" who abuses Christians (identified with Vladimir Rasate). The apocryph also describes battles in which he participated.\n\nAlthough pagan temples' ruins have been discovered in Pliska, the capital of pagan Bulgaria, copper hasn't been found. Either the copper was stolen and the threshing floor was destroyed during invasions, or it was a metaphor.\n\nIn a different apocryph, \"Видение на пророк Данаил за царете, за последните дни и за края на света\" (\"Vision of prophet Danail regarding the kings, the last days and the end of the world\") similar events are described, but instead of a copper pagan temple, there's a copper threshing ground. The name and title of the person who breaks the copper threshing ground aren't mentioned, but he's extraordinary. Wars are also noted (\"brother against brother\"), they might be the rebellion of the aristocraticy during the Christianisation of Bulgaria and the clash between Vladimir Rasate and his father.\n\nA copper threshing ground is referenced in another 11th century Bulgarian medieval apocryph, \"Сказание за пророк Самуил\" (\"Слово Самоилѣ прорка\", \"Word regarding prophet Samuel\"). Here, it's not linked with Bulgars, but instead, it appears in Nebuchadnezzar's dream and the prophet tells him that it symbolizes the world. It could signify what it meant to Bulgars and early Bulgarians - perhaps a model of the world or a symbol of the world.\n\nAs the Danube Bulgars assimilated into the Slavs, notions of a copper threshing ground survived in Bulgarian folklore. There's a riddle that goes \"beans sown on a copper threshing ground, an old man watches over them\" and the answer is the stars, the sky and the moon. A ritual song describing an unborn yet male child places the child on a horse that goes around a golden pole in the middle of a copper threshing ground. According to ethnologists, the horse, the copper threshing ground and the golden pole symbolize Ursa Minor, the sky and the Polar star. According to historian Marin Drinov, rare mentions of copper (and metal) threshing grounds have been recorded in the folklore of other Slavs, as well as in Greek folklore. However, according to historian Ivan Venedikov, the origins of the copper threshing ground are Bulgar, as there aren't any notions of such a thing in Greek or Slavic mythology, therefore the idea must've spread in the Middle ages. (Mentions in Macedonia in particular might be due to Kuber's Bulgars, but it's not proven 100%.)\n\nHowever, this raises several questions.\n\n1. How did Danube Bulgars come up with the copper threshing ground/copper temple? Was/is there any other steppe tribe that had/has anything similar? I've read about Volga Bulgaria, but notions of a copper threshing ground/copper temple are never recorded there. Both medieval Bulgarian states descend from Old Great Bulgaria, so I assume they must've had similarities at their founding, before they got influenced by the different religions that they converted into, by their neighbours and by the tribes that they incorporated.\n\n2. Why did it have to be copper in particular? Could it be that oxidized copper turns turquoise and therefore reminds them of the sky and Tangra? (Sky also gets orange hues in sunrise/sunset, like non-oxidized copper.)\n\n3. Why did Danube Bulgars pick a threshing ground in particular to represent their statehood, power and pagan religion? Bulgars were semi-nomadic, a threshing ground is not the first thing you'd associate with a semi-nomadic people.\n\n\n\n\nSources:\n\n\nДринов, М. Медно (бакърно) гумно, меден ток в словенските и гръцки умотворения. — В: Съчинения, Т. 2, С., 1911.\n^ an article in Bulgarian by historian Marin Drinov regarding the copper threshing floor among Slavs and Greeks, I couldn't find it online, so I can't give a link\n\n\nВенедиков, Ив. Легендата за Михаил каган. — В: Сб. Преслав. Т. 2. С., 1976.\n^ an article in Bulgarian by historian Ivan Venedikov regarding \"Mihail khagan\", I couldn't find it online, so I can't give a link\n\n\nВенедиков, Ив. Медното гумно на прабългарите. С., 1983\n^ a book by Ivan Venedikov called \"The copper threshing ground of the Bulgars\" where, among other things, he analyzes the copper threshing ground, I think it can be found online, you will have to use auto-translate\n\n\nhttps://liternet.bg/publish/tmollov/mei/6_1.htm\nhttps://liternet.bg/publish/tmollov/mei/6_2.htm\nhttps://liternet.bg/publish/tmollov/mei/6_3.htm\n^ three articles in Bulgarian by Bulgarian philologist and ethnology professor Todor Mollov where he discusses the copper threshing ground, Mihail khagan and the apocryphs, you can use auto-translate if you're interested in the articles\n\n\nhttps://dokumen.pub/the-letter-of-the-three-patriarchs-to-emperor-theophilos-and-related-texts-1-871328-12-8.html\n^ source is in English, \"The Letter of the Three Patriarchs to Emperor Theophilos\" (oddly, the threshing floor is called brazen here, but maybe it's the translation, I've seen it as copper in Bulgarian, I wanted to find the Greek original and see what kind of word they use there, but I couldn't)\n\n\nhttps://archive.org/details/genesios-1998-english-kaldellis-byzantium-813-886\n^ source is in English, writings of Joseph Genesius, threshing floor is mentioned on page 14, this might be a description of Leo V's victory against Bulgars during kanasubigi Omurtag's reign, or a confabulation of Nicephorus I Genik's destruction of Pliska; Leo V has never entered Pliska",
                "comments": []
            },
            {
                "title": "Māori Women and the Fight for Suffrage: The Overlooked Legacy of Meri Te Tai Mangakāhia",
                "url": "https://www.reddit.com/r/history/comments/1jihzvk/māori_women_and_the_fight_for_suffrage_the/",
                "score": 126,
                "comments_count": 2,
                "author": "paul-nikos",
                "created_utc": 1742788089.0,
                "selftext": "I recently started researching the role of Māori women in securing the vote and was surprised by how little recognition they receive—especially outside Aotearoa (New Zealand). One name that stood out to me was Meri Te Tai Mangakāhia, a pioneering Māori suffragist whose contributions deserve more attention.\n\nNew Zealand is often celebrated as the first country in the world to grant women the right to vote in national elections (1893). However, this achievement is usually credited to the mainstream suffrage movement, which was largely led by Pākehā (white) women and focused on securing voting rights within the British colonial political system. What is less discussed is that Māori women were engaged in their own struggle for political representation—one that was deeply tied to the survival of their communities, land rights, and sovereignty.\n\nIn 1893, the same year New Zealand granted women the vote, Meri Te Tai Mangakāhia became the first woman to address Te Kotahitanga, the Māori Parliament. Her speech was groundbreaking—not only did she advocate for Māori women’s right to vote, but she also called for their right to stand for election, something the mainstream suffrage movement wasn’t even fighting for at the time. She argued that many Māori women were landowners and decision-makers within their own communities but lacked the political power to protect their interests. In the face of ongoing colonial dispossession, securing representation wasn’t just about gender equality—it was about ensuring the survival of Māori as a people.\n\nMeri’s efforts helped Māori women win the right to vote in Te Kotahitanga elections in 1897. However, the Māori Parliament itself was never fully recognized by the colonial government and was eventually dismantled in the early 1900s, limiting the impact of these gains. Meanwhile, when Māori men were granted the right to vote in New Zealand’s national elections in 1867, they were only allowed to vote in separate Māori electorates, a system that remained in place for Māori voters—including women—after 1893. This meant that while all women in New Zealand gained the right to vote that year, Māori women’s political participation remained constrained by structural inequalities that continued long after suffrage was won.\n\nDespite her contributions, Meri Te Tai Mangakāhia’s legacy is often overshadowed. Even within New Zealand, her name is far less known than that of Kate Sheppard, the leader of the Pākehā suffrage movement. This marginalization is reflected in the country’s national suffrage memorial in Christchurch, where Meri is the only Māori woman depicted—positioned at the side of the five Pākehā suffragists.\n\nThis raises a broader question: whose stories do we center when we talk about progress? The fight for women’s political rights didn’t look the same everywhere, and in many places, it wasn’t a unified movement. The voices of Indigenous women, women of color, and those advocating outside mainstream feminist spaces are still often pushed to the margins.\n\nMeri Te Tai Mangakāhia’s story is a reminder that (feminist) history is more complex than the dominant narratives suggest. Whose stories do you think deserve more recognition?\n\nSources: \nAbout Meri Te Tai Mangakāhia\n1. https://tanzecampus.neocities.org/fansite/about\n2. https://www.penguin.co.nz/articles/3201-kia-kaha-profile---meri-te-tai-mangakahia\nAbout the Māori parliament \n3. https://teara.govt.nz/en/biographies/2m30/mangakahia-meri-te-tai\n\nFurther reading: “Māori Women and the Vote” by Tania Rei, 1993, Wellington, N.Z. : Huia Publishers\nISBN 090897504X",
                "comments": [
                    {
                        "author": "Purplekeyboard",
                        "comment": ">Whose stories do you think deserve more recognition?\n\nFrom what I understand, there were multiple competing Maori parliaments, this was the one that failed and was dissolved 5 years after it gave women the right to vote.  So, did anything she do have any long term effect on the government in New Zealand?  When did women get the right to vote in the Maori parliament which succeeded?",
                        "published_at": 1742838365.0,
                        "likes": 2,
                        "subcomments": [
                            {
                                "author": "paul-nikos",
                                "comment": "You make an interesting point about the different Māori parliaments! The Kotahitanga Māori Parliament, where Meri Te Tai Mangakahia advocated for women’s suffrage in 1893, did dissolve in the early 1900s. However, her advocacy was still significant. When Pākehā women gained the right to vote in the New Zealand Parliament later that year, there was debate over whether Māori women should also have the right. Her speech and activism were cited as part of the argument for including Māori women, which ultimately ensured that they were not excluded.\n\nAs for the Kauhanganui, the governing body of the Kīngitanga (Māori King movement), women not only had the right to vote but also actively participated as members. This was quite progressive for the time, especially considering that most Western parliaments still denied women such rights.\n\nI’m curious about the “multiple competing Māori parliaments” you mentioned—besides Kotahitanga and the Kauhanganui, I haven’t come across much about others. What sources or examples do you have in mind? Would love to learn more!\n\nNgā mihi \nNikos",
                                "published_at": 1742879955.0,
                                "likes": 2
                            }
                        ]
                    }
                ]
            },
            {
                "title": "who first write that china has 5000 years history?",
                "url": "https://www.reddit.com/r/AskHistorians/comments/1jlla5c/who_first_write_that_china_has_5000_years_history/",
                "score": 39,
                "comments_count": 4,
                "author": "SongOfThePast",
                "created_utc": 1743130461.0,
                "selftext": "I am chinese and everyone teach in china that we have 5000 years of history, but I don't think is true.\n\nshang dynasty happen in 1600 bc we don't even know the exact year because is so old. the history plan for xia shang zhou say xia is 2000 year bc. ok? what is the other 1000 years??? everyone in modern china know the san huang wu di is myth and not real history.\n\nso I want to know who first said this because i think is new with the communist party. i never see this write in history books before communist. nobody in qing dynasty said china has 5000 years history...nobody in song dynasty said china has 4000 years history...\n\ni hope someone know this history here. sorry for my english and thank you for the help.",
                "comments": [
                    {
                        "author": "AutoModerator",
                        "comment": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://old.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/1jlla5c/who_first_write_that_china_has_5000_years_history/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://old.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to the Weekly Roundup and RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/). In the meantime our [Bluesky](https://bsky.app/profile/askhistorians.bsky.social), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
                        "published_at": 1743130461.0,
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "voyeur324",
                        "comment": " [China is famous for going through a cycle of strong empires and fracturing and civil wars. But did people during times of small kingdoms see it as a “civil war” or as a war between separate states? Was there a desire or expectation that they’d all be united again eventually?](https://old.reddit.com/r/AskHistorians/comments/ihabe5/china_is_famous_for_going_through_a_cycle_of/) was answered by /u/touchme5eva and /u/necksbetrim and /u/Dongzhou3kingdoms.\n\nSee below",
                        "published_at": 1743136660.0,
                        "likes": 1,
                        "subcomments": [
                            {
                                "author": "voyeur324",
                                "comment": "/u/DrDickles has previously answered:\n\n* [In the history of modern China, the Warlord Era (1916-1928) is generally considered to have been a period of chaos and disorder owing to the political disunity of the region. Is this not a teleological conception of history which assumes that the ideal end state for China is political unity?](https://www.reddit.com/r/AskHistorians/comments/e70401/in_the_history_of_ancient_china_the_warlord_era/) \n\n/u/EnclavedMicrostate has previously answered [Why didn't China split into different countries?](https://www.reddit.com/r/AskHistorians/comments/8nh0yv/why_didnt_china_splinter_into_different_countries/dzvl249/)\n\n/u/cthulhushrugged has previously answered  \n\n* [Chinese  history is characterised by periods of vast, unified empires and their  collapse into small states. How long has the idea of a \"unified China\"  existed, and do we have evidence of states that were developing a unique  cultural identity?](https://old.reddit.com/r/AskHistorians/comments/9yg341/chinese_history_is_characterised_by_periods_of/)\n\n\nCthulhushrugged also hosts a podcast about Chinese history. \n\nMore answers remain to be written.",
                                "published_at": 1743136684.0,
                                "likes": 1
                            }
                        ]
                    }
                ]
            },
            {
                "title": "Why did coffee become popular so late in human history?",
                "url": "https://www.reddit.com/r/AskHistorians/comments/1jlj5fk/why_did_coffee_become_popular_so_late_in_human/",
                "score": 16,
                "comments_count": 1,
                "author": "CobblerPale9200",
                "created_utc": 1743123950.0,
                "selftext": "Hi reddit! I was looking up some information about the history of coffee, and I was surprised to learn that the preparation we know today was only a recent development. It seems like we only have records dating to the 15th century or so identifying coffee (ignoring folk legends about a certain shepherd and his hopped-up herd).  \n  \nContrast this with tea, a preparation with a history of thousands of years. Or tobacco, which may have been used even longer in the Americas. \n\nSo I'm wondering: what took so long? Why did humans live with coffee cherries for so long and never experiment with cooking them until recently? Why are some edible plants widespread while others languish?",
                "comments": [
                    {
                        "author": "AutoModerator",
                        "comment": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://old.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/1jlj5fk/why_did_coffee_become_popular_so_late_in_human/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://old.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to the Weekly Roundup and RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/). In the meantime our [Bluesky](https://bsky.app/profile/askhistorians.bsky.social), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
                        "published_at": 1743123951.0,
                        "likes": 1,
                        "subcomments": []
                    }
                ]
            },
            {
                "title": "european history recs ??",
                "url": "https://www.reddit.com/r/AskHistorians/comments/1jk21u9/european_history_recs/",
                "score": 2,
                "comments_count": 1,
                "author": "No-Web6737",
                "created_utc": 1742957855.0,
                "selftext": "i’m going to europe for a couple months and i feel like i know nothing about european history lol. feel like i want to have at least a base of knowledge to actually be able to appreciate going there, any recommendations of good documentaries or series to watch? (italy, uk, france mainly). thanks ! ",
                "comments": [
                    {
                        "author": "AutoModerator",
                        "comment": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://old.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/1jk21u9/european_history_recs/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://old.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to the Weekly Roundup and RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/). In the meantime our [Bluesky](https://bsky.app/profile/askhistorians.bsky.social), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
                        "published_at": 1742957856.0,
                        "likes": 1,
                        "subcomments": []
                    }
                ]
            },
            {
                "title": "What are some good works on non human actors in history?",
                "url": "https://www.reddit.com/r/AskHistorians/comments/1jkj79e/what_are_some_good_works_on_non_human_actors_in/",
                "score": 2,
                "comments_count": 1,
                "author": "YeOldeOle",
                "created_utc": 1743014531.0,
                "selftext": "Can be books or essays and non human could be animals, nature or just the environment in general.\n\n I'd be mostly interested in works about human animals studies and those dealing with their agency or even discussions about the question if they have agency. Less so about a history about ten worst storm in history (just a made up example). \n",
                "comments": [
                    {
                        "author": "AutoModerator",
                        "comment": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://old.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/1jkj79e/what_are_some_good_works_on_non_human_actors_in/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://old.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to the Weekly Roundup and RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/). In the meantime our [Bluesky](https://bsky.app/profile/askhistorians.bsky.social), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
                        "published_at": 1743014531.0,
                        "likes": 1,
                        "subcomments": []
                    }
                ]
            },
            {
                "title": "Given the length of Sumerian Civilization, did Sumer have archeologists and historians studying their own ancient history?",
                "url": "https://www.reddit.com/r/AskHistorians/comments/1jkpe7k/given_the_length_of_sumerian_civilization_did/",
                "score": 14,
                "comments_count": 1,
                "author": "WF-2",
                "created_utc": 1743030125.0,
                "selftext": "(c. 5500 – c. 1800 BC)\nhttps://en.m.wikipedia.org/wiki/Sumer",
                "comments": [
                    {
                        "author": "AutoModerator",
                        "comment": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://old.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/1jkpe7k/given_the_length_of_sumerian_civilization_did/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://old.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to the Weekly Roundup and RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/). In the meantime our [Bluesky](https://bsky.app/profile/askhistorians.bsky.social), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
                        "published_at": 1743030125.0,
                        "likes": 1,
                        "subcomments": []
                    }
                ]
            },
            {
                "title": "Where Can I Find Documents on Costa Rican National Parks' History?",
                "url": "https://www.reddit.com/r/AskHistorians/comments/1jk8yfs/where_can_i_find_documents_on_costa_rican/",
                "score": 3,
                "comments_count": 1,
                "author": "Competitive-Hope-482",
                "created_utc": 1742986346.0,
                "selftext": "Hi, everyone,\n\nI am an undergraduate History student, and this is my last year at university. I have been thinking about studying the history of Costa Rican national parks in a master's degree program. However, I am not sure where I can find documents about this topic online to take a look at first.\n\nI am particularly interested in sources not only related to legislation but also newspapers, political debates, government records, and other historical documents. Does anyone know where I could find relevant sources? Any recommendations or advice would be greatly appreciated!",
                "comments": [
                    {
                        "author": "AutoModerator",
                        "comment": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://old.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/1jk8yfs/where_can_i_find_documents_on_costa_rican/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://old.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to the Weekly Roundup and RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/). In the meantime our [Bluesky](https://bsky.app/profile/askhistorians.bsky.social), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
                        "published_at": 1742986346.0,
                        "likes": 1,
                        "subcomments": []
                    }
                ]
            },
            {
                "title": "What periods and places in Mexican and United States history are underdeveloped in historical research?",
                "url": "https://www.reddit.com/r/AskHistorians/comments/1jkcxbz/what_periods_and_places_in_mexican_and_united/",
                "score": 2,
                "comments_count": 1,
                "author": "Hot-Juice-4528",
                "created_utc": 1742998903.0,
                "selftext": "I have a general interest in Mexican and United States history, from colonization to the modern day, and I was wondering where there has been a lack of research in these fields. To specify a bit on where my interest lay geographically, I am mostly interested in the southern United States, the Yucatan, Central Mexico, and the States of Chihuahua and Texas. My interest also expand to wider Central America.",
                "comments": [
                    {
                        "author": "AutoModerator",
                        "comment": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://old.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/1jkcxbz/what_periods_and_places_in_mexican_and_united/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://old.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to the Weekly Roundup and RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/). In the meantime our [Bluesky](https://bsky.app/profile/askhistorians.bsky.social), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
                        "published_at": 1742998903.0,
                        "likes": 1,
                        "subcomments": []
                    }
                ]
            },
            {
                "title": "Hi! I'm Joe Street, author of Black Revolutionaries: A History of the Black Panther Party and a historian of the San Francisco Bay Area. AMA!",
                "url": "https://www.reddit.com/r/AskHistorians/comments/1jk7i8q/hi_im_joe_street_author_of_black_revolutionaries/",
                "score": 170,
                "comments_count": 78,
                "author": "Joe_Street",
                "created_utc": 1742980085.0,
                "selftext": "I'm an Associate Professor here at [Northumbria University](https://www.northumbria.ac.uk/about-us/our-staff/s/joe-street/), in the beautiful city of Newcastle upon Tyne. I'm a historian of the San Francisco Bay Area, and a few months ago, my history of the Black Panther Party, one of the most important revolutionary groups in American history, was published by the [University of Georgia Press](https://ugapress.org/book/9780820366951/black-revolutionaries/). I hope that my book offers some new perspectives on the BPP, informed by more than fifteen years of research and teaching on the organization. Ask me anything and I'll try my best to answer!",
                "comments": [
                    {
                        "author": "AdJust2798",
                        "comment": "Hi Joe, do you think we'll ever get to a point where people (in the US and beyond) stop associating the BPP with violence and guns only and there's a wider understanding of what they achieved and sought to achieve? Or is their legacy forever tarnished by those who tried to destroy them?",
                        "published_at": 1742981204.0,
                        "likes": 25,
                        "subcomments": [
                            {
                                "author": "Joe_Street",
                                "comment": "That really is an excellent question to open on! Thank you! Part of the reason I have spent so much time working on the BPP is because I agree with you that the broad assumption remains that the BPP was only about guns and violence, despite dozens of historians proving that this was not the case. Like you suggest, this popular image is largely due to the FBI and the police's sustained campaign against the BPP. We also have to acknowledge the role that racist assumptions about Black violence play in this.  \n\nAt another level, I also think that part of this comes from the BPP's image, which was defined in part by Eldridge Cleaver, who was behind the famous image of Huey P. Newton in the wicker chair and Newton and Bobby Seale outside the first BPP office. Both images prominently feature guns, which casual viewers simply equate with violence, despite both images being far deeper and much more complex. Of course, once people start to read the BPP's theory of the gun, they realise that it represents a deterrent rather than aggression, and was designed to prompt police officers to think twice about their brutalizing of Black American people. The BPP noticed early on that, once they started patrolling the police, police violence decreased. Newton was also adept at reminding police that, should they use their weapons, then he would use his. This he took from the great radical activist Robert F. Williams. But I wonder whether many people are given the opportunity to read more about the BPP.\n\nTo go back to your main question, I sincerely hope that we will get to a better awareness about the BPP's significance. But the power imbalances in society are such that this is something that we all have to work on.\n\nHope this answers your question!",
                                "published_at": 1742986366.0,
                                "likes": 33
                            }
                        ]
                    },
                    {
                        "author": "crrpit",
                        "comment": "Hello! Perhaps linking your stated interests a little, but I'm curious how San Francisco ended up becoming such a key hub for radical politics in the US? I'm aware of various movements that originated/thrived there, but have never really seen a holistic explanation for why San Francisco in particular ended up as their home.",
                        "published_at": 1742988178.0,
                        "likes": 12,
                        "subcomments": [
                            {
                                "author": "Joe_Street",
                                "comment": "Wow, that's a BIG question! There's so much to unpack, I think I'll do a few bullet points (not necessarily in chronological order, or exhaustive, so please feel free to add your own):\n\n1) San Francisco emerged in the C19 as a port and as a hub for prospectors. It always had its rough edges -- see the Committees of Vigilance, for example (which I touch on in *Dirty Harry's America*) -- and had quite an 'anything goes' atmosphere at times. Many of the early white inhabitants (\\*let's not forget that the land was originally occupied by the Ohlone peoples\\*) went there to remake themselves, which surely influenced their (and their descendants') relationship with change (in the abstract sense). \n\n2) As one of my excellent graduate students (among other historians), Gabe Hogg, revealed, San Francisco had a vibrant union movement in the early C20, that was informed by leftist thought. We overlook the importance of trade unionism at our peril!\n\n3) As the major embarking and disembarking point in WW2, it was the place where sailors and soldiers who were discharged dishonorably (quite a euphemism there...) would land. If they didn't -- or couldn't -- head home, they would set up their new lives nearby. This fed into the antiestablishment atmosphere.\n\n4) Oakland had a huge union movement, both in the shipyards and the railroads. As a major terminus, it was for example the location of the headquarters of the Brotherhood of Sleeping Car Porters (A. Philip Randolph, architect of the March on Washington, was their central figure). \n\n5) We see a lot of migration of Black southerners to the Bay Area during the Great Migration. As the excellent historian Donna Murch revealed, many future BPP members were sons or daughters of these migrants. I wonder whether the familial experience of migration -- which involves changing the circumstances that are around you -- might have influenced these young people to make different sorts of changes to their circumstances. In this, I wonder whether they chose to change politics rather than geography. \n\n6) I'm perhaps stretching things here, but the San Andreas and Hayward Faults might have an impact. Their instability means that Bay Area dwellers live under the permanent threat of massive ruptures to their lives, and I wonder whether that might impact on their way of seeing the world. If you know that the world around you can easily be remade by tectonics, why not try it yourself? OK, so I know what you're thinking here -- has Street gone mad? -- but if we accept that the built and natural environment around us impacts on our way of seeing the world, why \\*wouldn't\\* something like the threat of earthquake do so too?\n\n7) There are loads of other things, some of which are structural, some happenstance, some a bit random, and this is what I love about the Bay Area! We could add, for example, the Howl trial and the Beats, Cal's Berkeley campus, the great science fiction writer Philip K. Dick (who was always writing about reality changing around us), the vibrant radio culture (that helped nurture Sly Stone among many others) etc. etc. \n\nI don't think I've arrived at a unifying theory of Bay Area change here (you'll note that I've ignored Richmond, Antioch, the south of the Bay, etc. etc.) but I hope the above includes some sketchy notes towards it!",
                                "published_at": 1742992063.0,
                                "likes": 20
                            }
                        ]
                    },
                    {
                        "author": "Saint_John_Calvin",
                        "comment": "Hi Joe,\n\nThis is a question that has always interested me, but was there any intersection between the Black Panther Party and the work of the Black radical liberal tradition in American thought? Much of the writing on the BPP focuses on their Marxist borrowings (with some anarchist tinges here or there), but much of black radical intellectualism also consisted of a tradition of liberal republican (small-r) critique. I am thinking here of figures like Frederick Douglass, Anna Julia Cooper, Alain LeRoy Locke and in more recent times figures like Charles W. Mills and Kwame Anthony Appiah.",
                        "published_at": 1742982184.0,
                        "likes": 10,
                        "subcomments": [
                            {
                                "author": "Joe_Street",
                                "comment": "Oh wow, that is a fabulous question. The real answer to your question would require a book-length inquisition!\n\nFor me, you're right that there are clear intersections between the BPP and Marxist and Black Marxist thought. Frankly, I don't think anybody can understand BPP thought without making reference to Marxism. In terms of the intersections you mention, there are definite intersections with Anna Julia Cooper (I'm thinking here of her critique of the myopia of white feminist thought in ignoring the intersectional prejudice faced by Black women) and we might also espy links with the Sojourners for Truth and Justice (particularly their internationalism). \n\nThinking more deeply, I wonder about the BPP's relationship with liberal republicans. If you look at documents like the early Executive Mandates and of course the BPP's relationship with the Second Amendment, you can see a deep understanding of the Declaration of Independence and of course the American Constitution. In this, I suspect that the BPP did not see the political concept of the USA as fundamentally flawed, but instead that racism and what we might term the praxis of American democracy as a departure from the ideals espoused in these foundational documents. I suspect that Douglass and other folk would nod in agreement here. \n\nI would love to hear what you think about this issue though! Please tell me more.",
                                "published_at": 1742987115.0,
                                "likes": 17
                            }
                        ]
                    },
                    {
                        "author": "Abrytan",
                        "comment": "Hi Joe,\n\nThank you for doing this AMA! What are the practical difficulties you face as a historian of a place on the other side of the planet when working at Northumbria Uni and how do you overcome these?",
                        "published_at": 1742985463.0,
                        "likes": 8,
                        "subcomments": [
                            {
                                "author": "Joe_Street",
                                "comment": "Hi! Thanks for the question. It's a good one, and one that is increasingly on my mind now that it is becoming more difficult to enter the US.\n\nIn terms of the work for Black Revolutionaries, I was immensely lucky in that my university purchased microfilm copies of the BPP's organisational records. As far as I know, we're the only British university to hold them. I can't overstate how much this helped, as it meant I could research from home, and indeed, I spent countless hours poring over microfilms. Without this resource, I'd have been at the mercy of the big funding bodies in the UK, who aren't as wealthy as they might be. One day, hopefully, the originals (which are held at Stanford U) will be digitized and made available for all to see. Likewise, the people at the Marxists Internet Archive made the vast majority of the BPP's newspaper available online. I also have a few hard copies at work, courtesy of my friend and colleague Prof Brian Ward. This is, hands down, the best source for understanding the BPP, and I frequently get lost in its pages. (It's also a wonderful teaching tool: my students always say that the best session in my BPP module is the one where I bring in copies of the newspaper for them to read. On reflection, this doesn't say much for my teaching skills, does it?!)\n\nThe other big impediment is a bit more personal and relates to oral histories. Many, many years ago, I did an oral history with a member. It was an amazing experience, but once I went through my tapes (yes, it was that long ago that I recorded it on a cassette -- ask your grandparents what they were) I realised that I was just too awestruck by being in the company of somebody who I had admired so much that I wasn't really any good at asking them questions! Thankfully, in the years since then, many many more experienced and talented historians have conducted some wonderful oral histories and have made them available online. I am totally in their debt. \n\nBeyond this, there's a major question about whether somebody with my experience and identity (a white, middle-class man from the UK) can truly understand what it meant to be a Black person in Oakland (or the other locations in which the BPP was active) during the 1960s and 1970s. I hope that readers of the book will develop their own conclusions about this important question, one that is always present when I'm writing about the BPP.",
                                "published_at": 1742988007.0,
                                "likes": 18
                            }
                        ]
                    },
                    {
                        "author": "EdHistory101",
                        "comment": "Thanks so much for doing this AMA! I love, love, love the history around the Party and school breakfast/lunch. Are there any particular details from that history you think more people should know? Or things that are misunderstood about their efforts?",
                        "published_at": 1742996748.0,
                        "likes": 7,
                        "subcomments": [
                            {
                                "author": "Joe_Street",
                                "comment": "It's an absolute pleasure! I'm really enjoying it: it's a sunny day, I have the tunes on, and I'm thinking about History. Can't fault it, as my Grampy would say.\n\nAnyway, to the question, there are so many things about the school breakfast program that historians have identified as important but that remain largely underappreciated. For example, did you know that J. Edgar Hoover said it was the most dangerous part of the BPP's overall program? That says everything you need to know about Hoover. Feeding children is apparently dangerous...\n\nAs important, we have to think about how many local school districts adopted free breakfast programs in the wake of the BPP doing it. As a number of historians have noted, the BPP was a pioneer in acknowledging the importance of children going to school on a full stomach, and how hunger prevents learning. We can't underestimate this. Kids: if you're reading, eat your breakfast!\n\nMore seriously, we also have to think about how dedicated members of the BPP collected food from local businesses, cooked, fed, and then packed off to school thousands of kids. That is a huge organizational feat in itself. Using the surplus goods that emerge from capitalism was a work of genius, in my book. Critics, like Hoover, said that the BPP would use the breakfast program as propaganda, both to soften the image of the BPP and brainwash the children. I often wonder about reversing this: if this is the case, then why don't our governments offer free breakfasts to every kid?",
                                "published_at": 1743002389.0,
                                "likes": 13
                            }
                        ]
                    },
                    {
                        "author": "aquatermain",
                        "comment": "Thank you for joining us. In the 60s, the US' School of the Americas developed a counterinsurgency and guerrilla warfare training and instruction system, based on the French Revolutionary War Doctrine from the 50s, which was widely applied by military dictatorships across Latin América during the 70s and 80s. Its primary goal was to encourage the use of the armed forces directly instead of solely relying on intelligence agencies and security forces in the fight against real - or perceived revolutionary groups. Do we know if the US government ever considered applying - or actively applied any of the active engagement or psychological warfare strategies outlined in this theoretical framework against the BPP?",
                        "published_at": 1743010118.0,
                        "likes": 6,
                        "subcomments": [
                            {
                                "author": "Joe_Street",
                                "comment": "hi! Sorry I missed this earlier on. That's a very interesting question. In terms of active engagement, much of the FBI's work involved infiltrators (some of whom were recruited like Earl Anthony because they'd committed a crime and the FBI used the threat of prosecution to have the infiltrators do their bidding; other times agents joined themselves). There's a lot of evidence to suggest that a number of dangerous activities engaged by the BPP came at the instigation of infiltrators.\n\nIn terms of psychological warfare, I think it's worth looking at the ways the police/FBI engaged in daily activities to unsettle the organization. This involved things like mysterious phone calls, phone tapping, tailing people, that sort of thing, which heightened the psychological pressure of being in the Party. \n\nTo be honest, I'm consistently amazed that the BPP managed to do anything given the sheer volume of repression directed at its members. This is testament to the heroism of each and every member.",
                                "published_at": 1743065032.0,
                                "likes": 3
                            }
                        ]
                    },
                    {
                        "author": "OnShoulderOfGiants",
                        "comment": "Thanks for coming here today! As someone to young to really know the context of the times, how do the Black Panthers fit in amongst other radical groups of the time? Are they pretty unique, or fairly similar to others like the Weathermen?",
                        "published_at": 1742996808.0,
                        "likes": 4,
                        "subcomments": [
                            {
                                "author": "Joe_Street",
                                "comment": "Happy to be here and thanks for the excellent question, which is deceptively tough to answer!\n\nI think the BPP is/was unique in many respects, but reflective of its times in others. A terrible bit of fence-sitting, I'm afraid. If we compare it to the Weathermen, for example, we can see uniqueness in the breadth and depth of the BPP's vision for a different society, but similarities in their critique of American capitalism. The BPP was also far more disciplined and organized than the Weathermen -- we might turn to the 'Days of Rage' here, for evidence -- but both (to different extents) were aware that nonviolence was not providing the breakthroughs that many 1960s activists hoped it would\n\nA major difference lies in their experience of state repression: the FBI developed no serious sources within the Weather Underground, but the BPP was riddled with informers and agent provocateurs. We know that the vast majority of COINTELPRO resources were directed towards destroying the BPP, while the FBI failed to pay attention to other groups. This also speaks to the unique position that BPP members found themselves in, and here an intersectional approach is important, because we have to think about the repression they faced sitting at the intersection of many facets of their being: members were Black, often working-class or unemployed, many were female, and all were critics of the US system and members of an openly revolutionary group. As such, they faced a much more repressive environment than, say, a male, middle-class, university-educated friend of the Weather Underground. That naturally means that a BPP member's response to this unique position would itself be unique.\n\nThen we have to think about the BPP's relationship with other Black Power groups, which was often quite tense and related to differing understandings of the role of race in underpinning activism, one that the police and the FBI exacerbated for its own ends. But we also have to think of the BPP within the context of the times. Josh Bloom and Waldo Martin's history of the BPP, *Black Against Empire*, argues strenuously that the BPP cannot be separated from the atmosphere of the late 1960s (and particularly the War in Vietnam), and suggest that once the fervor of 1968 had waned, the BPP was almost doomed to collapse. So, they fit with the times really well, in addition to being unique. Argh, I'm on the fence again. Sorry about that.",
                                "published_at": 1743003416.0,
                                "likes": 5
                            }
                        ]
                    },
                    {
                        "author": "holomorphic_chipotle",
                        "comment": "Thanks for doing this AMA. From time to time, people will ask about the Nation of Islam (NOI). What was the relationship between the Black Panther Party and the NOI?",
                        "published_at": 1743004641.0,
                        "likes": 4,
                        "subcomments": [
                            {
                                "author": "Joe_Street",
                                "comment": "It's a pleasure. In terms of the relationship, I'd recommend looking at the BPP's Ten Point Platform and Program and see if you can spot similarities with the Nation of Islam's similar document (I can't think of the title off the top of my head at the moment; hopefully it'll come to me later). In terms of organizational links, we have to think of the BPP's drift from nationalism in 1967 and its increasing criticism of race-first approaches. The leading figures in the Party were also much bigger followers of Malcolm X, and we know about the tension between this group of people and the NoI. That said, Eldridge Cleaver was impressed by the way that the NoI organized Black prisoners and saw himself how they offered redemption to many men who struggled under the psychological weight of white supremacy and prison. He was briefly a Nation minister in prison, although like Malcolm X, he did not agree with the NoI's policy of avoiding interaction with formal politics.",
                                "published_at": 1743016379.0,
                                "likes": 3
                            }
                        ]
                    },
                    {
                        "author": "LordIndica",
                        "comment": "Thank you for your time and very thorough responses, professor. \n\n\nThe legacy of the BPP in popular culture is almost never associated with its marxist-leninist ideology. The organization was definitely constructed as a revolutionary one and we can see their praxis in the form of their community-building efforts and educational programs and liberation schools.\n\n\nWhat i am curious about is just how much of the body of sociaist/communist work was being taught by those schools/programs. There was the \"Panther Party Booklist\" that did feature american black socialists works, but i notice that some more \"foundational\" works of marx and lenin are not mentioned, which i find strange. \n\n\nIn their pursuit of Point 5 of the Ten-Point Program, did the Party advance more traditional eduction on marxist-leninism beyond its relation to american black liberation? Did Newtons shift from Black Nationalism to his pursuit of intercommunalism result in a shift in the education policies of the Party to focus on a broader group (i.e. the proletariat) and their collective class struggle as opposed to the unique position of black americans? ",
                        "published_at": 1742999094.0,
                        "likes": 3,
                        "subcomments": [
                            {
                                "author": "Joe_Street",
                                "comment": "Hi! A real pleasure to be doing this today. This is such a good question, and I'm so glad you asked it. I hope that the below suffices to start us off...\n\nI don't know for certain what went on during the educational programs (which I accept is one of my failings for not asking that question) but I'm fairly sure that a number of things were going on here:\n\nA great deal of the BPP's Marxism is filtered through their reading of Fanon's *The Wretched of the Earth*. This book was foundational for the BPP, and you can see its influence everywhere in the Party, particularly in the period between late 1967 and 1971. I insist my students read the book cover to cover, like members did. You can see directly how Fanon's understanding of the lumpenproletariat influenced the BPP's recruitment policies, how his thoughts about revolutionary education and culture fed into BPP praxis, and how his Marxist anticolonialism helped the BPP's internationalism and its understanding of internal colonialism. Given the depth and richness of Fanon, I'm not sure members needed much more!\n\nAs important, we have to see BPP philosophy moving through different phases. Initially you see a lot of Black nationalist ideas expressed in the newspaper. They gradually cede to a focus on class during 1968 before race returns when Newton re-appraises Black capitalism (a development that was intimately linked to a funding crisis for the Party). You might note that the 'class' period (and yes I'm oversimplifying here) coincides with Eldridge Cleaver's prominence in the Party. It's no coincidence. He was the most Leninist of the Party's central cadre (and was also a big fan of Nechayev's Catechism of a Revolutionary, which was reprinted in the newspaper at this time). I'm sure political education inside the Party broadly reflected these shifts.",
                                "published_at": 1743004146.0,
                                "likes": 4
                            }
                        ]
                    },
                    {
                        "author": "dhowlett1692",
                        "comment": "Can you talk about how government sources vs personal sources would tell two very different stories about the Blank Panther Party?  Given the FBI saw them as a huge threat, how do you breakthrough the bias/racism in portrayals of the party in government sources?",
                        "published_at": 1742996090.0,
                        "likes": 3,
                        "subcomments": [
                            {
                                "author": "Joe_Street",
                                "comment": "Sure! Thanks for the question. I guess the first thing to say about FBI sources is that the people who wrote them are extremely good at one thing: identifying where the people they follow are. Of course, that is when they aren't lying about the location. As this suggests, we have to treat govt-sponsored sources about the BPP extremely cautiously, and I think it helps not only to think about them in terms of bias and racism but in terms of organizational culture. Within this, we have to center J. Edgar Hoover and think about how individual agents relate to him and his position, which helps to explain some of the racism that permeates FBI sources: Hoover was always pleased to hear stories that were suggestive of a lack of (his understanding of) morality among Black Americans. But we also have to think about how agents would advance their careers; one way to do this would be to heighten fears of, say, a BPP operation against the police. This might then lead to them receiving extra resources for oppressing the local Panthers, which would make any anti-BPP operations more successful, leading to career advancement. Once we understand this, we develop a much more complex impression of how and why the FBI portrayed the BPP as it did, especially after Hoover escalates the COINTELPRO. \n\nI think it's helpful to see police sources similarly, and to think about how the police fit into structures of power. For example, we know that Chicago police collaborated with friendly newspaper columnists to plant stories about the local BPP, which heightened fears in the local power structure and played a role in creating the circumstances that led to Fred Hampton's and Mark Clark's murder by Chicago police in December 1969.\n\nI think the other thing worth remembering is that only a fraction of the COINTELPRO documents remain. Many were destroyed in the early 1970s, and I think we can be pretty certain that many anti-BPP activities were not documented, which makes it all the more important that we preserve what we have and that we think deeply about the value of personal sources, which tell a very different story.",
                                "published_at": 1742999353.0,
                                "likes": 6
                            }
                        ]
                    }
                ]
            },
            {
                "title": "What is known about the understanding and treatment of dementia in humans history?",
                "url": "https://www.reddit.com/r/AskHistorians/comments/1jjrp1o/what_is_known_about_the_understanding_and/",
                "score": 5,
                "comments_count": 1,
                "author": "abbie_yoyo",
                "created_utc": 1742930326.0,
                "selftext": "What I mean is, when do reports begin showing up of elderly or injured people without a consistent memory, and was anything done then drastically differently than what we do today ( watch over them, engage in a specific way, etc) ?",
                "comments": [
                    {
                        "author": "AutoModerator",
                        "comment": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://old.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/1jjrp1o/what_is_known_about_the_understanding_and/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://old.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to the Weekly Roundup and RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/). In the meantime our [Bluesky](https://bsky.app/profile/askhistorians.bsky.social), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
                        "published_at": 1742930326.0,
                        "likes": 1,
                        "subcomments": []
                    }
                ]
            },
            {
                "title": "I'm very interested in European medieval history. Could you recommend some good books that have Chinese translations?",
                "url": "https://www.reddit.com/r/AskHistorians/comments/1jjeh1k/im_very_interested_in_european_medieval_history/",
                "score": 6,
                "comments_count": 3,
                "author": "Intelligent-Fix1343",
                "created_utc": 1742890576.0,
                "selftext": "1. My English proficiency is quite average, so I can only read in Chinese. I hope these books already have Chinese translations.\n\n\n2. I'm particularly interested in Viking history, Byzantine history, and the histories of various European countries. As long as it's related to the Middle Ages, I'm interested.\n\n\n3. It would be best if the books were introductory, as I haven't yet built a comprehensive framework for the medieval histories of different countries. Compared to Asia's unified dynasties and tributary states, the history of medieval European countries is much more complex.\n\n\n\nThank you very much for your recommendations!",
                "comments": [
                    {
                        "author": "AutoModerator",
                        "comment": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://old.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/1jjeh1k/im_very_interested_in_european_medieval_history/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://old.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to the Weekly Roundup and RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/). In the meantime our [Bluesky](https://bsky.app/profile/askhistorians.bsky.social), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
                        "published_at": 1742890577.0,
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "Unknown",
                        "comment": "[removed]",
                        "published_at": 1742895986.0,
                        "likes": 1,
                        "subcomments": []
                    }
                ]
            }
        ],
        "youtube_videos": [
            {
                "title": "The Cruelest Punishment in History 😳 #shorts",
                "url": "https://www.youtube.com/watch?v=6USeiuB7KR0",
                "views": "18668903",
                "likes": "1034774",
                "published_at": "2025-03-04T01:48:51Z",
                "channel_title": "Sean Andrew",
                "channel_creation_date": "2013-02-24T08:39:38Z",
                "subscribers": "5650000",
                "transcript": "this might be the cruestv Europe if you were accused of a crime like theft or adultery you might be placed in front of boiling water then a priest would drop a ring into the scalding pots and you'd be forced to reach in and retrieve it now this water would instantly burn anyone but it was believed that God would protect the innocent from injury so a few days later if your hands were visibly burned or infected you were found guilty and often executed",
                "comments": [
                    {
                        "author": "@SeanAndreww",
                        "comment": "Guilty = Hands burned<br>Innocent = No burns",
                        "published_at": "2025-03-04T01:49:15Z",
                        "likes": 31498,
                        "subcomments": [
                            {
                                "author": "@Scarlet-it8jk",
                                "comment": "Ok",
                                "published_at": "2025-03-04T01:49:33Z",
                                "likes": 140
                            },
                            {
                                "author": "@Kingofcomedyshorts-yq7kq",
                                "comment": "@@BassClarinetCole no you were not",
                                "published_at": "2025-03-04T01:52:58Z",
                                "likes": 48
                            },
                            {
                                "author": "@GreatGorilla2",
                                "comment": "Why does it feel like judges and the law and that typa stuff always seem to just want to kill. Ofc ur hand will be burned.",
                                "published_at": "2025-03-04T02:01:45Z",
                                "likes": 332
                            },
                            {
                                "author": "@Niteshade_",
                                "comment": "That is crazy",
                                "published_at": "2025-03-04T02:02:06Z",
                                "likes": 50
                            },
                            {
                                "author": "@Lexistence4evrnlife",
                                "comment": "What",
                                "published_at": "2025-03-04T02:19:01Z",
                                "likes": 11
                            },
                            {
                                "author": "@parmitadas3754",
                                "comment": "That makes sense🤐😱☠️",
                                "published_at": "2025-03-04T02:39:48Z",
                                "likes": 10
                            },
                            {
                                "author": "@thecraft56674",
                                "comment": "@GreatGorilla2 you were given 1 week for your hands to heal and if your hands were still burned then you would be guilty",
                                "published_at": "2025-03-04T03:01:45Z",
                                "likes": 18
                            },
                            {
                                "author": "@legendaryfox9864",
                                "comment": "No burns = WITCH",
                                "published_at": "2025-03-04T03:30:29Z",
                                "likes": 0
                            },
                            {
                                "author": "@lordphantom2123",
                                "comment": "No burns = witch",
                                "published_at": "2025-03-04T04:25:21Z",
                                "likes": 43
                            },
                            {
                                "author": "@justsomeonewhosboredlol",
                                "comment": "They're guilty if their hands don't recover within 3 days. It heals within 3, they're innocent. Although it could've been different in some parts in Shank place",
                                "published_at": "2025-03-04T06:05:54Z",
                                "likes": 10
                            },
                            {
                                "author": "@Ashfaque627",
                                "comment": "It's immunity Test 😂",
                                "published_at": "2025-03-04T06:25:53Z",
                                "likes": 7
                            },
                            {
                                "author": "@Nosiyboi",
                                "comment": "👃👃",
                                "published_at": "2025-03-04T12:08:53Z",
                                "likes": 2
                            },
                            {
                                "author": "@smijah_playz2707",
                                "comment": "Yeah i watched the video headass",
                                "published_at": "2025-03-04T12:53:37Z",
                                "likes": 0
                            },
                            {
                                "author": "@anuwedbabubabu5454",
                                "comment": "This is cristanity before 50 year kkkk not only this  if you moke prist  you burn life kkkkkkkk this thing  not from God kkkkk pegans believe",
                                "published_at": "2025-03-04T13:38:36Z",
                                "likes": 0
                            },
                            {
                                "author": "@CamcorderHomeVideos",
                                "comment": "Trying to force God to do something is insane...",
                                "published_at": "2025-03-04T15:54:27Z",
                                "likes": 6
                            },
                            {
                                "author": "@joshuadohrmann6355",
                                "comment": "I feel like this is a inspiration for a trap in Saw 3 where Kerry had to dip her hands in acid to retrieve a key to unhook herself from it",
                                "published_at": "2025-03-04T17:38:23Z",
                                "likes": 0
                            },
                            {
                                "author": "@justinwike4987",
                                "comment": "So everyone's guilty 😅",
                                "published_at": "2025-03-04T20:28:20Z",
                                "likes": 3
                            },
                            {
                                "author": "@AubreeTurich",
                                "comment": "I learned this this year and I learned that some places in the Middle Ages were burned at the stake it they were declared a witch",
                                "published_at": "2025-03-04T21:08:03Z",
                                "likes": 2
                            },
                            {
                                "author": "@Dino_Derek",
                                "comment": "What if I cut off my hands",
                                "published_at": "2025-03-04T23:00:55Z",
                                "likes": 2
                            },
                            {
                                "author": "@AubreeTurich",
                                "comment": "@@Dino_Derek honestly idk what u would do then",
                                "published_at": "2025-03-04T23:21:11Z",
                                "likes": 3
                            },
                            {
                                "author": "@AubreeTurich",
                                "comment": "Oh wait no u would prob die from the blood loss",
                                "published_at": "2025-03-04T23:21:50Z",
                                "likes": 4
                            },
                            {
                                "author": "@Dontreadmyprofiledone",
                                "comment": "Dont read my name",
                                "published_at": "2025-03-05T00:54:39Z",
                                "likes": 1
                            },
                            {
                                "author": "@Messifanschannel-21",
                                "comment": "Nice video😊\n\nhttps://youtube.com/shorts/UTNrIZDsFmg",
                                "published_at": "2025-03-05T01:29:40Z",
                                "likes": 0
                            },
                            {
                                "author": "@Blazed-Fury",
                                "comment": "If ur hands healed well =not guilty",
                                "published_at": "2025-03-05T06:34:08Z",
                                "likes": 1
                            },
                            {
                                "author": "@ifoundthatkoala",
                                "comment": "But theft will just make you more skilled with stealing and you'd not be burned or if adultery, iykyk.",
                                "published_at": "2025-03-05T11:09:02Z",
                                "likes": 0
                            },
                            {
                                "author": "@KSA_175x",
                                "comment": "So anyone can false accuse a person and possibly get him executed? Or an actual robber having the water not hot enough and retrieve the ring fast run away with his crime?",
                                "published_at": "2025-03-05T16:06:18Z",
                                "likes": 2
                            },
                            {
                                "author": "@tricianestor2370",
                                "comment": "😮😮😮",
                                "published_at": "2025-03-05T19:34:02Z",
                                "likes": 0
                            },
                            {
                                "author": "@MateoG-x6s",
                                "comment": "@GreatGorilla2 yep just like the witch test. they tie u up and throw you in a lake if you floated then you were a witch. if you sank you weren't. if you floated they will bring you back to shore and burn you alive.(once Thought of the only way to kill a witch) and when you sank they will bring you back up",
                                "published_at": "2025-03-05T21:13:37Z",
                                "likes": 0
                            },
                            {
                                "author": "@kimberleegolder5691",
                                "comment": "Does it hurt???",
                                "published_at": "2025-03-05T21:31:56Z",
                                "likes": 0
                            },
                            {
                                "author": "@B4KRONYT",
                                "comment": "Sean this was from angolo saxob time",
                                "published_at": "2025-03-05T21:41:29Z",
                                "likes": 0
                            },
                            {
                                "author": "@RobbySpiess-v6e",
                                "comment": "@@anuwedbabubabu5454WTF are you  even talking about",
                                "published_at": "2025-03-05T23:02:15Z",
                                "likes": 0
                            },
                            {
                                "author": "@harper8611",
                                "comment": "So it’s literally the Salem witch trials ;-;",
                                "published_at": "2025-03-06T07:00:56Z",
                                "likes": 0
                            },
                            {
                                "author": "@Hemeerr",
                                "comment": "3 days i thought? Thats what i was taught​@@thecraft56674",
                                "published_at": "2025-03-06T08:24:16Z",
                                "likes": 0
                            },
                            {
                                "author": "@Stevo1221",
                                "comment": "Thanks!!!!",
                                "published_at": "2025-03-06T08:45:19Z",
                                "likes": 0
                            },
                            {
                                "author": "@Shresthdixit08",
                                "comment": "Success rate 100%😂😂😂",
                                "published_at": "2025-03-06T09:44:14Z",
                                "likes": 0
                            },
                            {
                                "author": "@universefightingtime4310",
                                "comment": "🌚🌚avtivated\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n-Entertainment purpose only",
                                "published_at": "2025-03-06T10:12:19Z",
                                "likes": 0
                            },
                            {
                                "author": "@CATONDALARDER",
                                "comment": "I think I know why. I think the guilty will shake his/her hand, maybe they will be hard to pick up dat ring. Innocent are maybe not shaking his/her hand sooooooo.... Yah know",
                                "published_at": "2025-03-06T10:14:07Z",
                                "likes": 0
                            },
                            {
                                "author": "@penguincute3564",
                                "comment": "So everyone is guilty.",
                                "published_at": "2025-03-06T11:37:16Z",
                                "likes": 1
                            },
                            {
                                "author": "@ambrosefavour3885",
                                "comment": "It's a no win situation 😢",
                                "published_at": "2025-03-06T21:18:25Z",
                                "likes": 0
                            },
                            {
                                "author": "@ezzy_6965",
                                "comment": "Yeah, the water will burn anybody because nobody’s innocent before God😭",
                                "published_at": "2025-03-06T23:02:28Z",
                                "likes": 0
                            },
                            {
                                "author": "@Jayman2lit",
                                "comment": "😮😮😮i get it now",
                                "published_at": "2025-03-07T00:04:11Z",
                                "likes": 0
                            },
                            {
                                "author": "@Tohn1013",
                                "comment": "So basically, it doesn't matter if you guilty or innocent. 😭😭",
                                "published_at": "2025-03-07T01:11:11Z",
                                "likes": 0
                            },
                            {
                                "author": "@EzeGod-p9d",
                                "comment": "Wow 10 Million viewer in 3 days respect😮😮",
                                "published_at": "2025-03-07T08:53:13Z",
                                "likes": 1
                            },
                            {
                                "author": "@Jakeforml",
                                "comment": "What if you have no hands?",
                                "published_at": "2025-03-07T10:51:31Z",
                                "likes": 0
                            },
                            {
                                "author": "@NVA-64",
                                "comment": "why did i read \"innocent = no hands\"?",
                                "published_at": "2025-03-08T04:22:12Z",
                                "likes": 0
                            },
                            {
                                "author": "@ChatBeWildin",
                                "comment": "This is the punishment for a bad guy if your skin survive your innocent in 3 days if your skin not survive mins your not innocent pls like 😭🙏",
                                "published_at": "2025-03-08T05:23:56Z",
                                "likes": 0
                            },
                            {
                                "author": "@umamaheswari59",
                                "comment": "100%❤❤",
                                "published_at": "2025-03-08T10:12:01Z",
                                "likes": 0
                            },
                            {
                                "author": "@dickalatorre",
                                "comment": "​@AubreeTurich people are still being accused of being witches and burned alive... Google: \"list of people executed for witchcraft\" I think the most recent example is in South Africa 2021",
                                "published_at": "2025-03-08T10:52:03Z",
                                "likes": 0
                            },
                            {
                                "author": "@oi-saulo",
                                "comment": "@@lordphantom2123 lol fr",
                                "published_at": "2025-03-08T21:48:04Z",
                                "likes": 0
                            },
                            {
                                "author": "@TheIcyGene",
                                "comment": "@GreatGorilla2it was a mixture of greed, cruelty, and religious zealousness",
                                "published_at": "2025-03-08T22:43:07Z",
                                "likes": 0
                            },
                            {
                                "author": "@KawaiiPrincess_Love",
                                "comment": "Nobody ever actually believed that god would protect one from injury, they just needed a way to pretend like their ruling is \"fair\" and \"correct\", also, but this is speculation, they used that to play out their sick, sadistic perversion.",
                                "published_at": "2025-03-09T10:32:58Z",
                                "likes": 0
                            },
                            {
                                "author": "@R3x_004",
                                "comment": "That's not completely true: actually you were guilty if you couldn't pick the ring up and you were unguilty if you could, as God must have been on your side to pick it up",
                                "published_at": "2025-03-09T11:39:23Z",
                                "likes": 0
                            },
                            {
                                "author": "@MahsaYounesi",
                                "comment": "makes sense bro",
                                "published_at": "2025-03-09T15:41:14Z",
                                "likes": 0
                            },
                            {
                                "author": "@deadhardjuuzou",
                                "comment": "No shit",
                                "published_at": "2025-03-09T17:08:11Z",
                                "likes": 0
                            },
                            {
                                "author": "@buniboi2163",
                                "comment": "makes no sense",
                                "published_at": "2025-03-10T05:31:30Z",
                                "likes": 0
                            },
                            {
                                "author": "@trinhhung2869",
                                "comment": "God=Help\nBurn=Guilty\nTruth=Lie\nMind=Controlled",
                                "published_at": "2025-03-10T08:57:10Z",
                                "likes": 0
                            },
                            {
                                "author": "@TheWhiskyDelta",
                                "comment": "@GreatGorilla2 Not at all, infact they have generally found more cases of innocence than guilt in tests (the test is rigged). The reason for these tests was to prevent disputes and blood feuds (in an era where such things were rampant). If a court of yeoman found your son guilty you might think they were wrong and seek vengeance against the accusor or jury. If God says your son is guilty, you are going to be god fearing enough to just accept the result.\n\nTypically the priest would sort out a rational judgement beforehand and then rig the test as needed to get the intended result.",
                                "published_at": "2025-03-10T15:59:12Z",
                                "likes": 0
                            },
                            {
                                "author": "@Gimmickvr",
                                "comment": "It’s the ceiling which trials all over again",
                                "published_at": "2025-03-10T16:50:45Z",
                                "likes": 0
                            },
                            {
                                "author": "@NBS735",
                                "comment": "So nobody got away",
                                "published_at": "2025-03-10T18:16:30Z",
                                "likes": 0
                            },
                            {
                                "author": "@SuperNovAA-1-h3i",
                                "comment": "BUT WHAT ABOUT FLAYING SCAPHISM AND THE BLOOD EAGLE-",
                                "published_at": "2025-03-10T22:18:05Z",
                                "likes": 0
                            },
                            {
                                "author": "@germanandresgomezlondono6065",
                                "comment": "5​@@Scarlet-it8jk",
                                "published_at": "2025-03-10T23:58:57Z",
                                "likes": 0
                            },
                            {
                                "author": "@kesner1487",
                                "comment": "Yes\nYes\nYes",
                                "published_at": "2025-03-11T00:58:47Z",
                                "likes": 0
                            },
                            {
                                "author": "@HelloHiHey",
                                "comment": "@@Niteshade_ hi checkmark",
                                "published_at": "2025-03-11T02:50:00Z",
                                "likes": 0
                            },
                            {
                                "author": "@AneezProto",
                                "comment": "ho hands = invulnerable",
                                "published_at": "2025-03-11T03:29:51Z",
                                "likes": 0
                            },
                            {
                                "author": "@JosephKariuki-tj5tx",
                                "comment": "I don't know whether this is appropriate but I am looking for used electronics. I just need those I could salvage them",
                                "published_at": "2025-03-11T09:14:07Z",
                                "likes": 0
                            },
                            {
                                "author": "@josedemorla5211",
                                "comment": "Did you... see the video?​@GreatGorilla2",
                                "published_at": "2025-03-11T15:17:01Z",
                                "likes": 0
                            },
                            {
                                "author": "@hamsterchief7344",
                                "comment": "Danm",
                                "published_at": "2025-03-11T17:35:53Z",
                                "likes": 0
                            },
                            {
                                "author": "@SKako64",
                                "comment": "nah no burns = witch \n\nthus guilty",
                                "published_at": "2025-03-12T19:29:06Z",
                                "likes": 0
                            },
                            {
                                "author": "@Jakob2322",
                                "comment": "incorect",
                                "published_at": "2025-03-12T20:26:37Z",
                                "likes": 0
                            },
                            {
                                "author": "@MichaelHernandez-qi3td",
                                "comment": "​@@Kingofcomedyshorts-yq7kqwhat is he not?",
                                "published_at": "2025-03-12T21:53:11Z",
                                "likes": 0
                            },
                            {
                                "author": "@RAEJDER",
                                "comment": "Yup, youre fucked regardless. Its like the witch trials. \n\"well if we tie their hands, attach a big stone to their ankles and throw them in the lake. If they float then we will know they are a witch.\n\n\nOh what happens if they dont float? Uhm...\"",
                                "published_at": "2025-03-12T22:26:55Z",
                                "likes": 0
                            },
                            {
                                "author": "@Tacholoco",
                                "comment": "wouldn't witchery be exactly the opposite?",
                                "published_at": "2025-03-13T00:14:11Z",
                                "likes": 0
                            },
                            {
                                "author": "@lolla7506",
                                "comment": "@GreatGorilla2 that's not the law that is religion",
                                "published_at": "2025-03-13T21:19:49Z",
                                "likes": 0
                            },
                            {
                                "author": "@YOULOCALFAIRYGODMOTHER",
                                "comment": "Id just jump my hand in Vaseline",
                                "published_at": "2025-03-14T08:35:30Z",
                                "likes": 0
                            },
                            {
                                "author": "@Itsappuru",
                                "comment": "Dumbest way of testing people 😅",
                                "published_at": "2025-03-14T13:46:41Z",
                                "likes": 0
                            },
                            {
                                "author": "@ulloapaul.",
                                "comment": "That's not that bad it's not as bad as the BLOOD EAGLE search it up if you don't know what it is.(It's disturbing)",
                                "published_at": "2025-03-15T03:29:17Z",
                                "likes": 0
                            },
                            {
                                "author": "@trashman966",
                                "comment": "Salem logic:\nHands burned = Guilty\nNo burns = Witch = Guilty",
                                "published_at": "2025-03-17T14:50:46Z",
                                "likes": 0
                            },
                            {
                                "author": "@Xiao_adeptusxx",
                                "comment": "​@@Niteshade_yoo",
                                "published_at": "2025-03-20T10:27:02Z",
                                "likes": 0
                            },
                            {
                                "author": "@AnaApay",
                                "comment": "wow I just saw the other that walk into hot coal just up",
                                "published_at": "2025-03-21T09:45:55Z",
                                "likes": 0
                            },
                            {
                                "author": "@conroyII",
                                "comment": "Witch!",
                                "published_at": "2025-03-28T03:15:30Z",
                                "likes": 0
                            }
                        ]
                    },
                    {
                        "author": "@TheBlueGuyy",
                        "comment": "I swear medieval europe was so dumb",
                        "published_at": "2025-03-26T18:54:13Z",
                        "likes": 2,
                        "subcomments": []
                    },
                    {
                        "author": "@Mariaxgymnastics",
                        "comment": "That’s like ”if you breathe daily, you’re guilty”👹",
                        "published_at": "2025-03-25T13:33:24Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@GeoSappy",
                        "comment": "the cruelest punishment will be discovered after colonization 😭🙏💔",
                        "published_at": "2025-03-25T16:27:43Z",
                        "likes": 1,
                        "subcomments": [
                            {
                                "author": "@GNR2222",
                                "comment": "🥀🥀🥀",
                                "published_at": "2025-03-26T15:30:31Z",
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "@kk13world",
                        "comment": "I thought bro said coolest punishment 💀",
                        "published_at": "2025-03-24T10:00:17Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@RainGTM",
                        "comment": "I hate history tbh. If the judge was bored one day, they’d be like “ight if you jump into the fire and die, you’re guilty, if not, then you’re not guilty, but probably a witch” like vro it’s a loose-loose situation 😭",
                        "published_at": "2025-03-24T03:11:49Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@ConnorCubitt",
                        "comment": "This is not a punishment <br>It is known as tiral by ordial, which is a section where pracied in medicla to urope<br>This spific one is called trial by hot water",
                        "published_at": "2025-03-23T11:59:59Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@Whitepuppet9",
                        "comment": "Suddenly... KABOOM!! There goes your hand, watch it burn, feel the ring",
                        "published_at": "2025-03-23T09:34:34Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@djinnspalace2119",
                        "comment": "what about the 1 second of protection our skins physics give us? <br>we can touch fire and lava for a second, if you are fast enough you would easily been pardoned wouldnt you?",
                        "published_at": "2025-03-23T07:20:35Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@yanwang7872",
                        "comment": "So basically the only way to avoid this is to not do a crime. BUT you also have to be not ACCUSED of a crime. You’d gotta be neat and in order, but not too much or someone who is jealous of you would maybe accuse you. <br><br>This is the hardest time to stay alive",
                        "published_at": "2025-03-23T01:31:43Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@bodybloopers777",
                        "comment": "I&#39;m a Christian, but in this shit, in my mind , i consider myself guilty already!!!",
                        "published_at": "2025-03-22T19:43:17Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@Dudeface7-p3m",
                        "comment": "This is incredibly similar to most viking punishments",
                        "published_at": "2025-03-22T13:42:33Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@AzelShorts",
                        "comment": "My hands is already burned by hot hot hot hot hot coffee",
                        "published_at": "2025-03-22T07:08:23Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@catussupreme",
                        "comment": "Definitely not the cruelest punishment in history but okay bro",
                        "published_at": "2025-03-28T03:44:52Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@josephcottam1382",
                        "comment": "Correction <br>The cruelest punishment in history is crucifixion !",
                        "published_at": "2025-03-28T03:35:06Z",
                        "likes": 0,
                        "subcomments": []
                    }
                ]
            },
            {
                "title": "Ranking The Best School Moments Ever In History",
                "url": "https://www.youtube.com/watch?v=xzD7MZnLBP4",
                "views": "16918747",
                "likes": "604752",
                "published_at": "2025-03-07T20:14:20Z",
                "channel_title": "Zero Ranks",
                "channel_creation_date": "2025-01-13T01:15:09.795634Z",
                "subscribers": "56200",
                "transcript": "give me a Boom Boom Pow five six seven eight boom boom [Music] [Music] hey get [Laughter] out I am s",
                "comments": [
                    {
                        "author": "@Skyler-E",
                        "comment": "Number five he is in big trouble. I saw a teacher walk up to him. Lol",
                        "published_at": "2025-03-27T23:12:45Z",
                        "likes": 3,
                        "subcomments": []
                    },
                    {
                        "author": "@Moon-boy-dandyworld",
                        "comment": "Number 2 sound like when the Grinch was a kid 🤣🤣🤣",
                        "published_at": "2025-03-28T00:50:58Z",
                        "likes": 2,
                        "subcomments": []
                    },
                    {
                        "author": "@Redcobraedit",
                        "comment": "Numbers 4 and Number 1 💩💀",
                        "published_at": "2025-03-28T03:16:00Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@MrWeirdoOfficial",
                        "comment": "The last one ate Case or smt bro 😂😂😂",
                        "published_at": "2025-03-28T02:00:29Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@LofiKitty-Lk",
                        "comment": "❌ Fighting for his life\r<br>✅Farting for his life",
                        "published_at": "2025-03-27T22:44:13Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@duck-t7c",
                        "comment": "4. <br>IS THAT A BRAWL STARS REFFERENCE?!?!?!??!<br>FANGGGGGGGG",
                        "published_at": "2025-03-27T21:25:15Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@savannahgiliberti8053",
                        "comment": "How I would rank them:<br>1: oi oi Baka <br>2: boom boom pow <br>3:supercar racing <br>4: what is that laugh <br>5: bro is in the trenches",
                        "published_at": "2025-03-27T21:22:15Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@milmila503",
                        "comment": "The last one is from the Polish school",
                        "published_at": "2025-03-27T19:09:12Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@MelanieOchoa-s2k",
                        "comment": "I go to the score of the first one that says boom, boom boom and I know your teacher I seen you in class before",
                        "published_at": "2025-03-28T03:54:29Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@Rosie-q2h-e7e",
                        "comment": "Honesty the way in the car on the teacher can fuming at him to take it got me rolling on the floor laughing an people do it at my school lol🤣",
                        "published_at": "2025-03-28T03:52:02Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@Thatguy-nl4fh",
                        "comment": "Number 3 bro, let the intrusive thoughts, get to him",
                        "published_at": "2025-03-28T03:11:17Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@Dovud-f8s",
                        "comment": "1 and 2 got me rolling on the floor, and I paused the video with my forehead 😂",
                        "published_at": "2025-03-28T02:46:25Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@YIPPEEEE32",
                        "comment": "THE OI OI OI GUY WHO FELL OMG IM DYING",
                        "published_at": "2025-03-28T02:28:52Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@Aliciaking-pe7pu",
                        "comment": "U mean school means i like oí oí baka",
                        "published_at": "2025-03-28T02:24:50Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@AnaReyes-n1t",
                        "comment": "Ahahahhahaha the first one was crazy🤣",
                        "published_at": "2025-03-28T02:11:13Z",
                        "likes": 0,
                        "subcomments": []
                    }
                ]
            },
            {
                "title": "😂Ranking The GREATEST Falls In HISTORY😂",
                "url": "https://www.youtube.com/watch?v=J-jUVafGsXw",
                "views": "11555763",
                "likes": "558228",
                "published_at": "2025-03-10T19:13:18Z",
                "channel_title": "Doodlur",
                "channel_creation_date": "2025-03-05T15:46:03.539143Z",
                "subscribers": "5150",
                "transcript": "the Egyptians believed the most significant thing you could do in your life was [Music] die hello it's me [Music] he",
                "comments": [
                    {
                        "author": "@BrooklynBellRoss",
                        "comment": "the cartoon fall remindes me of Shaggy Rogers from scoopy doo.😭😭😆🤣",
                        "published_at": "2025-03-27T16:00:59Z",
                        "likes": 58,
                        "subcomments": []
                    },
                    {
                        "author": "@Osh20ghjh",
                        "comment": "the cartoon fall remindes me of Shaggy Rogers from scoopy doo.😂😂😂",
                        "published_at": "2025-03-26T14:48:44Z",
                        "likes": 4,
                        "subcomments": []
                    },
                    {
                        "author": "@NourBoulahya",
                        "comment": "The last one was really smooth 😂",
                        "published_at": "2025-03-27T21:05:27Z",
                        "likes": 3,
                        "subcomments": []
                    },
                    {
                        "author": "@Alice_Alisara",
                        "comment": "The last one had my rolling to Pluto with a laugh that sounds like a dying dog😂😂😂",
                        "published_at": "2025-03-27T12:45:07Z",
                        "likes": 2,
                        "subcomments": []
                    },
                    {
                        "author": "@angelgreen8953",
                        "comment": "The cartoon fall sent me FLYING😂",
                        "published_at": "2025-03-24T13:30:08Z",
                        "likes": 2,
                        "subcomments": []
                    },
                    {
                        "author": "@PastTenseMotel",
                        "comment": "The delivery driver after I write &#39;Fragile&#39; on my package",
                        "published_at": "2025-03-28T04:36:06Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@Phr0g_g1rl-c5h",
                        "comment": "Bro the cartoon fall I can&#39;t I was cackling like a dying horse😂",
                        "published_at": "2025-03-26T00:52:15Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@Tswifty_13",
                        "comment": "I FEEL BAD FOR THE LAST GUY!😭😭😭<br>He was just trying to live the childhood he could never have!😭😭😭",
                        "published_at": "2025-03-25T21:27:28Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@redhead3870",
                        "comment": "#1 GOT ME SOUND LIKE PEPPA PIG😂😂",
                        "published_at": "2025-03-28T02:57:18Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@Alicemercirahh",
                        "comment": "No 2 is lowkey giving that one time bangchan fell on stage 😭😭😭",
                        "published_at": "2025-03-28T00:02:36Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@Phebestreet",
                        "comment": "It&#39;s number 3 with the sound effects tied with number 1.",
                        "published_at": "2025-03-28T02:05:49Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@Kdrama-obssessd",
                        "comment": "Me as a delivery driver be like 😭😭😭",
                        "published_at": "2025-03-27T21:27:46Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@Yummy_IsHere",
                        "comment": "Bro why did I read “She was a Fairy” as “She fell for 100 hours.” 😭",
                        "published_at": "2025-03-27T21:13:32Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@JaidenBegay",
                        "comment": "I think I know why he did that it probably says, &quot; Please be careful it is fragile&quot;",
                        "published_at": "2025-03-27T21:24:56Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@crashcrashed6770",
                        "comment": "How fed ex delivers your packages 😂😂",
                        "published_at": "2025-03-27T21:01:00Z",
                        "likes": 0,
                        "subcomments": []
                    }
                ]
            },
            {
                "title": "James Alan Hetfield's legendary life #history #life #JamesAlanHetfield #evolution",
                "url": "https://www.youtube.com/watch?v=5Le5C42d-w4",
                "views": "8996734",
                "likes": "200651",
                "published_at": "2025-03-11T12:19:10Z",
                "channel_title": "Strong H",
                "channel_creation_date": "2021-05-28T09:10:15.942603Z",
                "subscribers": "97500",
                "transcript": "it's a hard to get home without a CA I don't want to perish like a fing it's like diamonds in the Sun and I'm top forever So Many Adventures could come today so many songs we forgot to play so many dreams swinging out of the blue let us go through for young I want to be forever young do you really want to live forever",
                "comments": [
                    {
                        "author": "@Элбекжумаев-в9к",
                        "comment": "Bu qaysi AI yordamida yasalgan? Biz ham o&#39;z rasmlarimizni huddi shu kabi yarata olamizmi? Iltmos tavsiya bering. I am Uzbek.",
                        "published_at": "2025-03-24T03:31:37Z",
                        "likes": 1,
                        "subcomments": []
                    },
                    {
                        "author": "@iMemo-Ai",
                        "comment": "Is this made with AI ?",
                        "published_at": "2025-03-23T22:23:58Z",
                        "likes": 1,
                        "subcomments": [
                            {
                                "author": "@strongh6140",
                                "comment": "yes ai",
                                "published_at": "2025-03-24T00:00:00Z",
                                "likes": 1
                            }
                        ]
                    },
                    {
                        "author": "@BrandonVanKarsen-t1i",
                        "comment": "Bro looked like a girl at one point",
                        "published_at": "2025-03-27T23:35:35Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@Lillie_Rose_Yt",
                        "comment": "My hero aged well, i love James Hetfield ❤❤❤❤❤❤❤",
                        "published_at": "2025-03-27T13:32:06Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@MeMeVoyageOf",
                        "comment": "He gets better with age, thoygh his hottest look was 2023.",
                        "published_at": "2025-03-27T08:08:15Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@ShoryoTombo",
                        "comment": "My God he grew even more gorgeous!",
                        "published_at": "2025-03-27T08:35:12Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@adanperez2792",
                        "comment": "Oh my god, the older,  the better he was getting.  And so handsome.  Wow",
                        "published_at": "2025-03-27T03:55:00Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@ramonaaldama2084",
                        "comment": "si que cambia la edad pero cuando aran un video de alguien de México o de países de Abla Isoans?",
                        "published_at": "2025-03-27T04:33:10Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@cleonisilva484",
                        "comment": "Vixiii, que gatooo!! Quanto mais velho mais bonito!!❤❤❤",
                        "published_at": "2025-03-27T01:04:51Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@yesseniarivas3167",
                        "comment": "Magnífico  hermoso cada día estás mejor",
                        "published_at": "2025-03-27T02:19:46Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@ElsoViana-kn3jw",
                        "comment": "Justiçe  o  boy. Nunca deixou de ser. Bonito",
                        "published_at": "2025-03-26T21:15:03Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@fleiva30",
                        "comment": "Wow for a minute i thought it was a girl 😮",
                        "published_at": "2025-03-26T20:16:23Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@heatherw.671",
                        "comment": "He looked better at 60 than he did at 40!  😊😊😊  i was like that too.  I looked way worse in my 30s than i do in my 50s.  This was a beautiful video effect showing how quickly life flows by.  It passes so fast...use your time wisely!",
                        "published_at": "2025-03-26T19:39:35Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@illwill6713",
                        "comment": "Are you sure that ain&#39;t real people",
                        "published_at": "2025-03-26T11:57:47Z",
                        "likes": 0,
                        "subcomments": []
                    },
                    {
                        "author": "@amxx3291",
                        "comment": "He looked his best at 60 😮",
                        "published_at": "2025-03-26T09:32:51Z",
                        "likes": 0,
                        "subcomments": []
                    }
                ]
            }
        ]
    }
]